{"data":{"markdownRemark":{"html":"<p>I recently discovered <a href=\"https://bikeparkatuitsig.co.za/\">The Bike Park</a> in Constantia. Situated on the Uitsig wine farm. The bicycle park consists of a number of trails made up of a variety of dirt tracks, pump tracks, berms, table-top jumps, rollers, hips and various other constructions including a treeline bridge ride (with a corckscrew exit) and a large wooden berm. There is also a bike/rental shop that offers gear, repairs, rentals and even coffee. </p>\n<p>Looking back to my childhood, without a doubt, the best gift I ever received was one Christmas when was gifted a BMX bicycle by my parents. Needless to say, I rode that thing non-stop for the entire holiday. Over the years, I have been on a few mountain bike rides. I enjoy riding bikes, and it is an especially fun way to see cities while travelling. I enjoy it enough, that a few months ago, I purchased a work colleague's old mountain bike. A red and black Scott mountain bike with shocks on the front. I had the tires upgraded to tubeless to reduce puncture issues. Since then, I have taken the bike out a few times, and decided to bring it along on my road trip because it was likely I would find plenty of good spots to ride. So far, this has been a good decision, but not until the bike park, did I realise just how good. </p>\n<p>I doubt that any bike riding experience will ever match up to when I first got my bike as a kid. I think that combination of excitement, joy and surprise at receiving something that activates your sense of adventure and freedom like a bicycle does as a child would be hard to match. Riding at the bike park came close though!</p>\n<p>It is ridiculously fun to ride laps upon laps of terrain, cruising through bermed corners, rolling over humps and learning to hit jumps on a bike after all these years. Admittedly, I was most attracted to learning to try and air my bike over the two small table-top jumps and trying to get faster and lower through the berms than casual riding, but I think, on some level, going hell for leather at these features is as close to that child-like bicycle riding experience on can get. </p>\n<p>That, or it could have been seeing a father and his tiny little son (covered head to toe in a helmets and all manner of pads) tearing around the at track full speed, hollering and wooping, seemingly having the time of their lives that reminded me of that experience. Regardless, if you enjoy riding bikes, or you are a parent, looking for a place to have fun with your kids, look no further than The Bike Park in Constantia. The trails are varied enough that there is something for everyone and every skill level, and due to the layout of the park, you are never too far from any corner of it. Chances are, you will have just as much fun as your kids will! </p>\n<p><em>Note: Even if you are a mountain biker not looking for the type of riding this park offers, I would still encourage you to go and ride there. Riding these types of trails will increase your technical riding skills immensely. Since you are generally riding at speed, through tight corners, over angled and rolling terrain, I am sure that your general trail riding ability will increase significantly. Especially since you are doing laps, you can actively focus on improving certain skills through repetition at faster and faster speeds. That being said, it is advisable to ease into it and get the feeling of the place before you start putting the pedals down hard. It is really easy to over find yourself going off the trails with rather comical and/or painful results!</em></p>","frontmatter":{"title":"Fun."}}},"pageContext":{"slug":"/post043/"}}