{"data":{"markdownRemark":{"html":"<p>Over the last few days, I have had several interactions with 'support' services from various companies. The interaction with phone support has been particularly bad. </p>\n<p>Below are some thoughts on this process: </p>\n<ul>\n<li>Call centres are terrible. The amount of time spent waiting on the line is, considering modern technology, unforgiveable. When it comes to 'support' calls, especially for large financial institutions that compete on service and have sizable budgets, having a poor call centre experience is shameful. </li>\n</ul>\n<p>To my mind the following should happen: </p>\n<ol>\n<li>If a customer has been on the line longer than a certain period - provide a reference number and inform them a support consultant will call back so that the customer does not need to wait indefinitely on the line. </li>\n<li>If the above is not possible, at least, provide a number in the queue. if am number 37 in the line, I will hang-up and try later. However, if I am number 3, I am happy to stay on the line. </li>\n</ol>\n<p>Regarding 'call backs'.</p>\n<p>In one particular interaction, I informed a consultant of what I required and was told a support consultant will contact me 'within 24 hours'. This was a Friday, so within 24 hours includes a weekend. The consultant then called the follwing day (a call I missed because I do not always keep my phone with me), saying 'they tried to contact me' and said I must call the service number again. So basically, thanks for contacting, but go through the whole rigmarole you just did again. Repeat. At least the email left a number to call. </p>\n<p>That number, when I called it, turned out NOT to be the number of someone who could help me, instead it was a number of someone who did not have 'mandate' to help me and passed me through to wait on the line again. This completely defeats the purpose of the service in the first place. </p>\n<p>In my view, there are two mistakes here: </p>\n<ol>\n<li>Provide the number of the line that can actually assist me. Instead of wasting my time once again. (Note: What I was attempting to do, was not enabled online, i.e. I could not achieve on my own in my own time.)</li>\n<li>If you are going to call 'within 24 hours', <em>before</em> the call is going to be made, send an email/sms to say, please expect the call within x minutes/hours. At least that way, there is some notice. Particularly because of the following: </li>\n</ol>\n<p>These days, customers/consumers are inundated with unwanted and unwarranted sales calls. </p>\n<p>Many of these are 'automated' sales calls. As in, an automated voice recording plays when you answer the phone. 99% of these calls are from unknown numbers. In many cases, the same institutions that already have your business, contract out support services to sell other services to their existing customers. As such, it is not uncommon to answer several calls a week only to say \"No I am not... no, thank you... excuse me... I am not intere...I am not... inte...\". It is horrible. A waste of time. </p>\n<p>Now, a reasonable person may resolve <em>not</em> to answer unknown numbers. The proliferation of apps designed specifically to identify unknown and call centre numbers such as Tru Caller have become commonplace. With that context, are companies honestly telling me that a support line is going to add their call, which the customer initiated, in the same hat as all the rest of the unwanted calls and expect us to be waiting patiently for their call? </p>\n<p>I certainly am not. </p>\n<p>I expect better. Better can be provided. </p>\n<p>In a world where every company is competing fiercely for attention, stellar service will stand head and shoulders above the rest. These days poor service is the norm. Good or excellent service will be spread via word of mouth. Yet, most companies still trawl the same strategies, the same approaches as always leaving terrible customer experiences in their wake. </p>","frontmatter":{"title":"Support Service."}}},"pageContext":{"slug":"/til0094/"}}