{"data":{"markdownRemark":{"html":"<p><em>Note: This post is a transplant. First published on 2017/05/20. It was written by myself on another site and has been moved.</em></p>\n<p>Almost as if on cue, Lyft and Waymo have <a href=\"https://www.nytimes.com/2017/05/14/technology/lyft-waymo-self-driving-cars.html\">announced a partnership</a> to bring Waymo's self-driving technology to Lyft customers. This puts Uber into an increasingly precarious situation. Consider the following:</p>\n<h3>Costs</h3>\n<p>Once automated driving is viable for ride-sharing services - the costs will be greatly reduced. This will mean a huge competitive advantage for the service that gets there first. Lyft was a small time player with some minor partnerships in this area and Uber was already testing its own technology on city streets. In essence, Lyft had no real plays in this area. Now they are partnered with arguably the leader in self-driving technology.</p>\n<h3>Complements</h3>\n<p>Details of the Lyft/Waymo partnership were not revealed, but it is worth considering that the Lyft/Waymo partnership may mean that Uber is no longer the leader in terms of both ride-sharing and self-driving technology in combination. The importance of this cannot be overstated. Lyft offered no self-driving technology and Waymo did not have a clear line to market access. They complement each other's needs so well.</p>\n<h3>Gaining ground</h3>\n<p>Lyft has recently raised more money and will be looking to capitalise on Uber's problems by attacking Uber in the US. This is likely to be in terms of a price war. This is a knock against Uber's budgeting as they now need to burn money competing for rides while funding their own self-driving technology. Lyft has no such needs as they focus all efforts on gaining market share from Uber. All the while Waymo focuses on the self-driving technology. No doubt, with Eric Holder's report still pending, and the Uber/Waymo lawsuit only just beginning. All bets are off as to who will ultimately capture a market that until very recently seemed destined to be Uber's.</p>\n<h3>Route to market</h3>\n<p>Waymo now has route to market, and likely, is greatly incentivised to capitalise on Uber's failings. Alphabet, Waymo's parent company, is no doubt looking for \"what's next\" in terms of market opportunities and now, have the possibility to get real skin in the ride-sharing game. Waze has already been <a href=\"https://www.theverge.com/2017/2/7/14538064/google-waze-carpool-bay-area-waymo-uber-lyft\">piloting ride-sharing initiatives in California</a>, so this partnership is likely to be a big boost to Alphabet's ride-sharing ambitions.</p>\n<h3>Data, data, data</h3>\n<p>While the primary benefit of this partnership is that both Lyft and Waymo now have capabilities in areas they did not previously have, one has to wonder what benefits this will bring to the data being employed? Google's knowledge of your calendar, your appointments, your travel plans, not to mention your mapping and traffic data means that Google knows where you want to go before Uber does. This could bring significant competitive advantage to Lyft. In some respects, Google may be able to \"prime the pump\" and predict who needs rides where and when before Uber does.</p>\n<h3>Snatching defeat from the jaws of victory</h3>\n<p>Who knows what will happen to Uber next? Uber management seem as likely to destroy the company as help it succeed. At a time when they should be focused on the market, the technology and the opportunities before them, they are fighting significant fires. While they are leagues ahead of competitors in market and mind-share, what happens while their attentions are facing inward rather than outward?</p>\n<h3>A battle of many fronts</h3>\n<p>Uber will need to fend off inspired, and continual attack on their current core business of ride-sharing.\nAt the same time, they will need to conduct an increasingly difficult battle to bring self-driving technology to market. If the lawsuit goes against them, they will be fighting that battle with one hand behind their back.</p>\n<h3>Considerable lead</h3>\n<p>Uber's market leadership is probably considerable, and Lyft does not yet operate outside of the US. As such, Uber is only competing with local players in other markets is likely to not be losing too much ground in those areas as Lyft will still need to enter those markets and build up a customer base. This means that Uber is likely to have some breathing room. Added to that, the partnership between Lyft and Waymo is yet to be proven.</p>\n<p>As such, the main questions for Uber are:</p>\n<ul>\n<li>How can they resolve the Waymo case relatively unscathed and continue moving forward on self-driving?</li>\n<li>How quickly can management put their problems behind them and get back to focusing on their business?</li>\n</ul>\n<p>Needless to say, there is blood in the water and the sharks can smell it.</p>","frontmatter":{"title":"Blood In The Water."}}},"pageContext":{"slug":"/post010/"}}