{"data":{"markdownRemark":{"html":"<p><em>Note: This post is a transplant. First published on 2018/01/22. It was written by myself on another site and has been moved.</em></p>\n<p>In the spirit of some speculative fun, here are my guesses at what Apple may or may not do in 2018:</p>\n<h3>iPhone</h3>\n<p>It is going to be fascinating to see what Apple does with the iPhone line in 2018. 2017 introduced 3 models: iPhone X, iPhone 8 and iPhone 8 Plus. What happens with the traditional 'S' cycle upgrade since being upturned by the latest release cycle?</p>\n<p>Generally Apple does not introduce new form factors in the 'S' cycle (last year being the exception) and this cycle is traditionally focused on software-based introductions and improvements. Does this mean we will see:</p>\n<ul>\n<li>iPhone XS.</li>\n<li>iPhone 8S.</li>\n<li>iPhone 8S Plus.</li>\n<li>iPhone SE (with iPhone 7 internals).</li>\n<li>New battery case (Has anyone noticed Marty Bird's continual use of the battery case in Ozark?)</li>\n</ul>\n<p>It will be fascinating to see what Apple does in 2019 to the \"old\" iPhone form factor. Depending on how the iPhone 8/X sales go, might we see the \"old\" form factor kept as the low-cost option, or will it fall away completely? On that note, I suspect 2019 will see the release of:</p>\n<ul>\n<li>iPhone X (What will it be called? iPhone X2?).</li>\n<li>Will we see a dual-camera iPhone X?</li>\n<li>iPhone X Plus.</li>\n<li>Apple Pencil integration for iPhone X Plus.</li>\n<li>What will happen to the notch?</li>\n<li>The race to a fully-full-screen phone is on and there are big questions around how to solve for the front-facing camera and sensors in order to achieve this.</li>\n</ul>\n<h3>AirPods</h3>\n<ul>\n<li>New AirPods.</li>\n<li>New colours.</li>\n<li>Pricing of new vs old AirPods.</li>\n<li>Another interesting AirPods question is when will we see \"low-end\" AirPods in the box with new iPhones? (Could this be on the cards as the product line matures and the components move down the cost curve making EarPods-level AirPods 'Lite' possible?)</li>\n<li>I suspect the AirPods serve as a successful up-sell, so providing AirPods in the box might cannibalise \"high-end\" AirPods so we may see the form factor remain constant for a while. Maybe there is space to incorporate the AirPods price into the iPhone as iPhone price pushes upwards?</li>\n<li>Do AirPods remain a single form-factor product line? Does Apple widen the product offering to include on or over-ear headphones that compete with Beats?</li>\n<li>When we will see cellular connectivity in the AirPods?</li>\n</ul>\n<h3>iPad</h3>\n<p>After the raft of iPad updates in 2017, will Apple continue this story in 2018?</p>\n<ul>\n<li>iPad with iPhone X-like bezel-less design.</li>\n<li>iPad with FaceID.</li>\n<li>New (smaller) Apple Pencil.</li>\n<li>Improved iPad keyboards/cases.</li>\n<li>What of these MacOS/iOS combination rumours?</li>\n</ul>\n<h3>Apple Watch</h3>\n<ul>\n<li>Always-on time ('Finally' becoming a 'real' watch.)</li>\n<li>I suspect there will be one more year of the current form-factor before a thinner Apple Watch in 2019.</li>\n<li>Or do we see a new form-factor this year and always-on remains a hanging fruit? (Apple must be itching to get a thinner Watch out there! Would likely be a good push on the upgrade cycle. Especially considering all those health-insurance subsidised watches out there.)</li>\n<li>When (if ever) does Apple breakout Apple Watch numbers?</li>\n</ul>\n<h3>HomePod</h3>\n<ul>\n<li>Release within Q1?</li>\n<li>And what of Siri integration?</li>\n</ul>\n<h3>Siri</h3>\n<ul>\n<li>Looking forward to many improvements as Siri is now under Craig Federighi (along with iOS, MacOS, TvOS and WatchOS)</li>\n<li>Multi-lingual support is an area Apple can claw back on the \"Amazon Echo\" lead. The presence of smart speakers in non-English markets is still in the very early to non-existent stages it seems.</li>\n</ul>\n<h3>Mac Pro</h3>\n<ul>\n<li>Will the Mac Pro see the light of day in 2018 as announced?</li>\n<li>And what about those external monitors?</li>\n<li>Big questions around form factor? (To avoid thermal corners)</li>\n</ul>\n<h3>MacBook and MacBook Pros</h3>\n<ul>\n<li>Will we see regular spec bumps in order to avoid the very long upgrade cycles and ever-rising (but currently relatively dormant) Mac criticisms?</li>\n<li>What happens to the TouchBar? (Does Apple keep it (surely?) and continue to maintain two lines of MacBook Pro?)</li>\n<li>What more will we find out about the MacOS/iOS combination? ARM-based Macs? LTE Macs?</li>\n<li>Increased usage of T-series processors (and other Apple silicon) across the Mac range.</li>\n</ul>\n<p>The HomePod, Mac Pro and MacBook/Pro release and upgrade cycles will come under scrutiny. Apple has made announcements and commitments to these and already the HomePod is slipping. Will be keeping an eye here to see if the others slip too.</p>\n<h3>Mac App Store</h3>\n<ul>\n<li>Phil Schiller's leadership of the App Store has resulted in great improvements to the iOS App Store. When will we see the fruits of his leadership come to the Mac App Store?</li>\n</ul>\n<h3>Apple TV</h3>\n<ul>\n<li>Dolby Atmos.</li>\n<li>Improved remote (Likely only in 2019 with new Apple TV hardware).</li>\n<li>Game controller? (Likely only paired with new hardware. If ever.)</li>\n<li>Anyone other than Gene Munster think there will be an actual Apple TV TV.</li>\n</ul>\n<h3>Apple Video and Music</h3>\n<ul>\n<li>Launch of first batch of Apple streaming video series.</li>\n<li>Improvement of Apple Music interface and recommendations.</li>\n<li>Shazam integration.</li>\n</ul>\n<h3>iCloud</h3>\n<ul>\n<li>Improved iCloud free and paid tiers.</li>\n<li>Streamlining of iCloud features - the iCloud authentication and password flows still seem horribly touchy and strange to me.</li>\n</ul>\n<h3>Project Titan</h3>\n<ul>\n<li>What happens with CarPlay?</li>\n<li>More rumours... leaks? (Likely that those leaks will only start in earnest once the supply chain comes into play.)</li>\n</ul>\n<p>Other areas of interest will be:</p>\n<p>Now that the majority of the work on Apple Campus and the Apple Stores seems to be done, where will Jony Ive be exerting his focus?What will be revealed about Apples US plans in terms of campuses, hiring, cash and tax repatriation?What effect will moving to the new campus have on the employees and their work?Will Apple be able to batten down the hatches in terms of public and somewhat embarrassing bugs?Come what may, it is going to be an exciting year!</p>\n<p><em>Update 23/01/2018</em></p>\n<p><em>Apple have announced that HomePod will be available in Apple Stores in US, UK and Australia on 9 Feb. Multi-room audio, stereo pair and AirPlay2 will however only be added in future software updates.</em></p>","frontmatter":{"title":"Apple 2018."}}},"pageContext":{"slug":"/post020/"}}