{"data":{"markdownRemark":{"html":"<p><em>Note: This post is a transplant. First published on 2018/06/04. It was written by myself on another site and has been moved.</em></p>\n<p>Just some quickfire thoughts before WWDC gets on the go. Broadly, I think (or is that hope?) some big themes will be:</p>\n<ul>\n<li>Tucked or untucked?</li>\n<li>Big Siri improvements and announcements. (Will we see the new Siri chief?)</li>\n<li>Widespread improvements and announcements for AR, Machine Learning and photo/video features (paving the way for new iPhones coming out later this year).</li>\n<li>\"<a href=\"https://scifi.stackexchange.com/questions/35594/does-the-game-that-chewie-plays-with-r2-d2-have-a-name\">Dejarik</a>\" AR demo - please! (The space chess game from Star Wars)</li>\n<li>Increased security and encryption. As well as increased privacy controls and awareness (Trump/FBI and China proofing).</li>\n<li>Increased and improved Health features.</li>\n<li>Will iTunes finally be split into multiple apps?</li>\n<li>New apps and services to bolster the burgeoning \"Apple Services\" narrative.</li>\n<li>Increased iCloud storage tiers and options (iCloud TimeMachine anyone?).</li>\n<li>Improved/re-designed Mac App Store (not expecting Mac Pro updates just yet...)</li>\n<li>Apple TV news to lay foundations for whatever streaming plans Apple has.</li>\n<li>Apple TV games announcements?</li>\n<li>Incremental improvements for Apple Maps.</li>\n<li>Any mentions of this possible MacOS/iOS platform unification?</li>\n<li>HomePod love? (Now that AirPlay 2 and audio-pairing just got released - what next for HomePod)</li>\n<li>Fruits of the Workflow and Shazaam acquisitions?</li>\n<li>China, China, and more China.</li>\n<li>More diversity on stage.</li>\n<li>Everything faster and more battery efficient. (So that products later this year are as thin or thinner than ever).</li>\n<li>Extra points for every mention of security, privacy, machine learning, AR.</li>\n</ul>\n<p>These are all wild guesses. As always, it will be exciting to see what is coming down the Apple pipes!</p>","frontmatter":{"title":"Pre-WWDC 2018 Thoughts."}}},"pageContext":{"slug":"/post026/"}}