{"data":{"markdownRemark":{"html":"<p>The Mueller Report has been a topic of interest for me of late. Being a New York Times subscriber, a lot of the ongoing news and commentary regarding the Mueller Report is front and centre within the NYT app. I dislike politics and I also do not understand the intricacies of American politics. Neither am I a lwayer, so I have no legal understanding of the topic. However, I am fascinated by the conversation around the topic of \"collusion\" and \"obstruction\", and this is an attempt by me to sound out some of thoughts around this:  </p>\n<p>In layman's terms, the gist of the report seems to me to be as follows:  </p>\n<h3>Regarding Collusion.</h3>\n<p>Regarding Russian interference and collusion - Russia <em>did</em> interfere with the 2016 elections. However, on the topic of possible \"collusion\" between Trump's team and the Russians it is more nuanced because: </p>\n<ul>\n<li>\n<p>Collusion, does not have a legal definition that Mueller and his team could work with. As such, they based their interpretation on a criminal defintion of \"conspiracy\", which, in essence, is defined by parties working <em>in concert</em> towards an end. </p>\n</li>\n<li>\n<p>As such, Mueller's team found <em>insufficient</em> evidence of \"conspiracy\" to act upon. </p>\n</li>\n</ul>\n<p>To this, my question is this: If a party is a beneficiary of Russian interference, knows of it happening (even welcomes it) and that interference is a crime - are you not, in some measure assisting in the continuance of it even if you are not committing the act? </p>\n<p>For example, if a civilian witnesses or knows of criminal behaviour, it is reasonable to consider that I <em>could</em> or possibly <em>should</em> be expected report the crime. However, I am not sure that as a civilian it is my express <em>duty</em> to report the crime. As such, I am probably not breaking any law by not reporting it. </p>\n<p>However, if I am the chief of police and know of or witness the same crime, and do not report it, let alone act upon it, especially if I am a beneficiary of it - it is a completely different story. As chief of police, my <em>duty</em> is to actively work to prevent such behaviour, and in certain capacities to disclose it. Not doing so, is in breach of my duty and as such, a serious offence. </p>\n<p>Regarding the behaviour of President Trump and his team in this capacity, something that comes to my mind in this debate is the following quote: </p>\n<p>\"It is difficult to get a man to understand something, when his salary depends on his not understanding it.\" </p>\n<p>In regards to the question of President Trump and his past behaviour, and by some accounts ongoing behaviour in relation to Russian interference is that this quote could be updated to say:  </p>\n<p>\"It is difficult to get a president to act on something, when his position benefits from him not acting on it.\"</p>\n<h3>Regarding Obstruction.</h3>\n<p>Mueller's report states that President Trump attempted, repeatedly, to interfere with the Mueller investigation. However, those required to carry out his requests, for whatever reason, did not do so - in effect thwarting his efforts. </p>\n<p>So, as a layman, the question I ask myself is that if someone <em>attempts</em> to commit a crime, but does not succeed for whatever reason. Is that still not grounds enough for prosecution as a crime? </p>\n<p>That would be like saying if I walked in to a bank, tried to empty the teller and was prevented from doing so, there would be no harm done. As far as I know, attempted robbery is still a crime. Clearly not as severe as an actual, successful robbery, but a crime none the less. As such, is <em>attempted</em> obstruction still not a crime? </p>\n<p>In the end though, something I also wonder is this: </p>\n<ol>\n<li>\n<p>If I were, for example, the CEO of a company, and was involved in an endless series of controversies and investigations. That I was embattled on a daily basis, it would be reasonable to question whether I was <em>fit</em> to execute my role effectively. Furthermore, at which point does the line get crossed between fit and unfit? </p>\n</li>\n<li>\n<p>Continuing the above example, if it were found, that I as CEO, was attempting to steer my company in certain directions and was attempting to get those who work for me, to do certain things, but was repeatedly ignored, again, would it not be time to question whether I was <em>fit</em> to lead the company? </p>\n</li>\n</ol>\n<p>Ultimately, to me, the question of criminality needs to be dealt with in the appropriate ways. </p>\n<p>However, to my mind, the question of criminality is separate to the question of ability to lead or perform a role. In overly simplicstic terms, to my mind someone does not need to be found guilty of a crime to be fired. If you are not able to effectively perform your job, you should be fired. </p>","frontmatter":{"title":"Collusion and Obstruction."}}},"pageContext":{"slug":"/post047/"}}