{"data":{"markdownRemark":{"html":"<p>The other day I was watching a video on YouTube by a guy called Ben DeGros. He has a YouTube channel where he posts skateboarding videos. He is not a pro skateboarder, but he is a father, husband and has a job. Being of a similar age and getting back in skateboarding, I found it interesting to hear what he had to say about skateboarding in his thirties and what progression means to him. </p>\n<p>He spoke about skateboarding and progression in particular as momentum. In order to progress, you need to maintain momentum which means skating regularly. In his view, this means that he tries to skate 3-4 times a week. His focus is primarily skating on the weekend, since then he has the time for it. However, he spoke about how important it is for him to get a skate or two in during the week in order to keep in touch with the activity. Then, over time, this builds his progression. </p>\n<p>I agree with this view, the difference in my case is that I tend to think about it in terms of consistency or continuity. It is better to only skate 2-3 times a week consistently for 12 months on end, than to skate every day for 2 moths month and then not skate for 3 and then to resume and skate everyday for a month or two, and then not do it again for a while. Unfortunately, that has been the pattern for me. I tend to get into a zone where I will get into something, pick up a great deal of momentum in that I do the activity as much as a physically can and then, at some point, that momentum falters. A gap then emerges, first a few days turns into a few weeks which turns into few months and then all momentum is completely lost and progress reverses. </p>\n<p>Thinking on it, I am not entirely sure how this happens. In some respects, I am quite extreme in this way - all or nothing. It is as if the beacon of progress fires me up and it burns bright and I make considerable progress and then, possibly through a mixture of hitting a plateau, getting tired or injured and then having my focus shift through a a busy or stressful period at work and then suddenly that momentum turns into wastefulness. </p>\n<p>Whatever you want to call it, be it momentum, continuity or consistency, the important thing, possibly even most important thing, is to maintain it over a long, extended period of time. Try not to get large gaps, granted, occassionally you need a rest and maybe a break from something for a while - but then it is all the more important to ensure that you get back on the board or bike or whatever it might once the break is over. </p>","frontmatter":{"title":"Momentum."}}},"pageContext":{"slug":"/post053/"}}