{"data":{"markdownRemark":{"html":"<p>While I have been a longtime user of Google Sheets. My usage has not been very deep. Mostly just making lists of things I like to keep track of. However, with the discovery of the wonderful app called <a href=\"https://www.glideapps.com/\">Glide</a>, my usage of Google Sheets has increased dramatically! </p>\n<h4>Filter.</h4>\n<p>Filter is a very useful formula enabling you to <em>filter</em> your view of data. For example: </p>\n<p><code>=filter(SheetName!A:E,Sheet!E:E=TRUE)</code></p>\n<p>This will pull data in from columns A to E in SheetName and will then display all items that have a value of TRUE in Column E of that same sheet. </p>\n<h4>Unique.</h4>\n<p>Unique enables you to pull out <em>unique</em> values from a list of values. For example: </p>\n<p><code>=UNIQUE(SheetName!I2:I)</code></p>\n<p>This will pull all unique values in from SheetName Column I from rows 2 to as many rows as I contains. </p>\n<h4>Sort.</h4>\n<p>Sort lets you, well, <em>sort</em> data in your sheet. I tend to use it to sort data from another sheet. For example: </p>\n<p><code>=SORT(SheetName!A2:F, 4, true)</code></p>\n<p>This will sort data from SheetName in the range of Columns A to F.</p>\n<h4>IF.</h4>\n<p>If lets you specify a condition, for example: </p>\n<p><code>=IF(D2=1,D2 &#x26; \" spot available\", D2 &#x26; \" spots available\")</code></p>\n<p>The above will check whether D2 is equal to 1, if so it will print '1 spot available', else it will print the value in D2 ' spots available'.</p>\n<h4>QUERY.</h4>\n<p>Query is a very powerful functions, essentially, it enables you to import data from another sheet and then use SQL to query that data. For example: </p>\n<p><code>=query({Vacancies2019!A2:F;Vacancies2020!A2:F;Vacancies2021!A2:F}, \"Select * where Col4>0 or Col5>0 or Col6>0\")</code></p>\n<p>In the above, data from 3 separate sheets is pulled in. From that pool of data, all the information is pulled in where the values in Column 4, 5 or 6 are greater than 0.</p>\n<h4>IMPORTFEED.</h4>\n<p><a href=\"https://support.google.com/docs/answer/3093337?hl=en&#x26;ref_topic=9199554\">IMPORTFEED</a> enables you to pull in RSS feed information into your Google Sheet. </p>\n<p><code>=IMPORTFEED(\"https://wordpress.org/news/feed/\",,TRUE,5)</code></p>\n<p>This will pull in 5 itesm from the official WordPress RSS news feed. </p>\n<p>Parameters: </p>\n<ol>\n<li>The URL you want to pull in. </li>\n<li>You can specify the query or fields you want to pull in, this is by defaults set to 'items' which pulls in the feed line items. </li>\n<li>A boolean to say whether you want to pull in headers/headings. </li>\n<li>Number of items you would like to pull in. </li>\n</ol>\n<h4>IMPORTXML.</h4>\n<p><a href=\"https://support.google.com/docs/answer/3093342?hl=en&#x26;ref_topic=9199554\">IMPORTXML</a> is another very useful function which enables you to pull in data from an XML source (eg. podcast feed) and specify the data you want to retrieve via XPATH queries. </p>\n<p><code>=IMPORTXML(\"your-rss-feed-here\",\"//enclosure/@url\")</code></p>\n<p>The above will extract the URL property from the <code>&#x3C;enclosure></code> tag, thus providing the direct link to the .mp3 file. Notably, this .mp3 file will not be provided via the IMPORTFEED formula, that will just provide the podcast host url for the feed.</p>\n<p>It is notable that you can actually use IMPORTXML to pull in data from any HTML page and use XPATH to extract data from it. </p>\n<p>You can find out more about XPATH <a href=\"https://www.w3schools.com/xml/xpath_intro.asp\">here</a>. </p>\n<p>To be continued...</p>","frontmatter":{"title":"Google Sheets Cheat Sheet."}}},"pageContext":{"slug":"/til0112/"}}