{"data":{"markdownRemark":{"html":"<p><a href=\"https://ionicframework.com/\">Ionic</a> is a cross-platform framework for building mobile applications. It sits on top of Cordova. Up until version 3, Ionic served Angular exclusively. The upcoming version 4 will however introduce WebComponents into the mix as well as the possibility to support React and Vue alongside Angular.</p>\n<p>Having never done mobile development and in the process of working on Angular, I thought it would be a good time to give Ionic a try. Here are some initial thoughts after starting to work with it today: </p>\n<ul>\n<li>The Ionic CLI is built on top of the Angular CLI, but it is <em>noticeably</em> and <em>considerably</em> slower in my experience (MacBook Pro, High Sierra, circa 2012).</li>\n<li>While my application is rudimentary, building the app is essentially identical to building one with Angular, except that you can make use of Ionic's premade components which provide default styling and functionality (similar to Bootstrap).</li>\n<li>From what I have seen, Ionic 4 is different to Ionic 4 in enough ways to mean you should be looking for v4 specific examples. (Note: Ionic 4 is far more <em>Angular-y</em> by the looks of it)</li>\n<li>While I have only experimented with the \"web\" part of it, I am curious to see how these Ionic components translate into \"native\" components in terms of look and feel. I imagine they must change quite drastically in appearance because, as it stands, the app I am building with default Ionic styling, looks nothing like stock-standard iOS or Android controls. </li>\n</ul>\n<p>While I have barely even come close to scratching the surface of this, I am excited to be learning something new that can take advantage of my existing skills. I also feel, that in some ways, Ionic or ReactNative will provide an interesting bridge to actual native mobile development one day.</p>\n<p>You can find my work-in-progress code <a href=\"https://github.com/nicholaspretorius/itemly-ionic\">here</a>.</p>","frontmatter":{"title":"First Thoughts: Ionic."}}},"pageContext":{"slug":"/til0056/"}}