{"data":{"markdownRemark":{"html":"<p>For the past few weeks, I have been getting back into some long lost hobbies of mine. Namely, wakeskating (like wakeboarding, but without the bindings and boots) and skateboarding. At my age, I likely have no business doing the latter, and even the former is proving harder than I remember it. The thing is, after a few weeks, I am starting to feel like it is starting to come back to me and starting to feel more comfortable. My arms and legs don't hurt as much, or get as stiff as they did before. My arms don't get as tired. The movements feel easier, more natural and I feel more confident trying new things. My mind is <em>racing</em> less as I hit a feature.  </p>\n<p>Being aware of the constraints of my age and not being in shape or attuned to the movements is, in a way, helping me improve. It is helping me build up a more solid base by slowly stepping up the things I try and the attempts I make instead of just going all in like I would have in the past. I seem to be taking a more <em>methodical</em> approach. For example, once I learned boardslides again, I moved to boardlisde to fakie (backwards). Once those were comfortable, I decided to try do them switch (opposite stance). First to regular and then to switch. Those are now coming along as well. Similarly, now that I am getting comfortable on the boardslide, I am trying frontside boardlides (where you slide backwards). This felt like a big step for me since I have not done these before. Once one is comfortable doing a trick one way, you step it up to the opposite way. </p>\n<p>Wakeskating is physically challenging. You fall a lot, and you have to swim a lot, but if you just keep at it, slowly but surely, you start getting better and I think this is how it goes with most of the things we do. Accept that you are going to fall a lot, that you are going to swim a lot and now and then going to get hurt. But rather than seeing each fall as a barrier to progress, see it as a stepping stone towards it. Each attempt is an experiment. A change of angle here, an adjustment of body position and speed there. Until eventually, you land the trick and ride away with a huge smile on your face.</p>","frontmatter":{"title":"Practice Incrementally."}}},"pageContext":{"slug":"/til0103/"}}