{"data":{"markdownRemark":{"html":"<p>In 2008, Steve Job's said in an interview with Betsy Morris for <a href=\"http://archive.fortune.com/galleries/2008/fortune/0803/gallery.jobsqna.fortune/13.html\">Fortune</a>:</p>\n<p>Things happen fairly slowly, you know. They do. These waves of technology, you can see them way before they happen, and you just have to choose wisely which ones you're going to surf. If you choose unwisely, then you can waste a lot of energy, but if you choose wisely it actually unfolds fairly slowly. It takes years.</p>\n<p>One of our biggest insights [years ago] was that we didn't want to get into any business where we didn't own or control the primary technology because you'll get your head handed to you.</p>\n<p>Fast forward to 2013 and Ben Thompson wrote a <a href=\"https://stratechery.com/2013/why-doesnt-apple-enable-sustainable-businesses-on-the-app-store/\">piece</a> explaining that much of Apple's current attitude towards developers and the business models afforded to those developers was moulded by Apple's difficult experiences with Office and Photoshop. Ben wrote:</p>\n<p>The trouble for Apple – or any platform provider – is apps that cross that line from nice-to-have to completely irreplaceable.</p>\n<p>Fast forward again to 2017 and Ben Thompson (you should subscribe to his daily updates) writes another great piece about <a href=\"https://stratechery.com/2017/apples-china-problem/\">Apple's China Problem</a>. The crux of the piece is summed up best when he says:</p>\n<p>The fundamental issue is this: unlike the rest of the world, in China the most important layer of the smartphone stack is not the phone’s operating system. Rather, it is WeChat.</p>\n<p>Thanks to Ben, we can start to see that it is no longer Apple that is irreplaceable in China but WeChat. By extension, WeChat is then central to continued success in China. If WeChat represents the problem, what is the solution?</p>\n<p>The answer might lie in reading those two paragraphs from Steve Jobs in reverse order. With specific focus on the analogy of the wave. Let's look at it like this:</p>\n<ul>\n<li>There is a growing wave of dissatisfaction with the stringent control Apple exerts on the App Store. Apple carves 30% out of every purchase. (This is acceptable to Apple, as long as the developer's customers are not willing to leave the store along with the developers in large numbers.)</li>\n<li>There is a growing wave of business models that are enabled not only by larger payments, but by many smaller payments. Taking 30% out of these, or charging each time one is made is not sustainable to the developers or their customers. (As shown by WeChat's tipping feature)</li>\n<li>These waves are still coming and have not broken...yet.</li>\n</ul>\n<p>What Steve's quote does not reveal is that, while waves can be seen coming for quite some time. Once a wave has gathered pace, if you are not in the right place to meet it, that waves passes you by no matter how long you have been watching it or how hard you paddle!</p>\n<p>Better to catch a big wave with someone else, than to watch them ride it all the way to the beach.</p>\n<p>That being said, there are always more waves. You might just have to wait a long time for a wave as big as China.</p>\n<p><em>Note: This post is a transplant. First published on 2017/05/08. It was written by myself on another site and has been moved.</em></p>","frontmatter":{"title":"Apple, WeChat and Waves."}}},"pageContext":{"slug":"/post004/"}}