{"data":{"markdownRemark":{"html":"<p>When I was young, I used to skateboard. I really enjoyed it, and through the years, I went through some phases were I would get back into it. However, as I got older, I did it less and less. Especially over the last 7 years, I hardly ever did. When I was younger, not doing something for a while, didn't mean losing the ability, one just needed to <em>rediscover</em> it. This happened pretty quickly for me. This time, it has been different. Starting to skate again has been difficult. It took me quite a while just to get the minimum basics back. Even then, my tricks are not as good or comfortable as they used to be. I have lost most of them and have slowly started trying to re-learn them. </p>\n<p>The reason I bring this up is because, when going to skateparks and doing skill-based activities. Whether it be skateboarding, or wakeboarding, snowboarding, mountain biking etc. Any sport or skill where there is a long anf strong line of progression to be made, it is really important for the facilities available to reflect that progression. When you are starting out and learning something for the first time, especially with something you fall and can hurt yourself, it's important that a facility have features to represent a beginner level of skill. Features that are small and easy to step up to and learn on. From there, there then needs to be a steady progression or variety of features to build up your skills on. </p>\n<p>When I was in the USA, working at a ski resort, it was the first time I witnessed true attention to this assistance with progression. Firstly, when learning to ski or snowboard, the instructors, take you very slowly through the steps and routines to learn the skill the basics on the flat snow first, then, as you increase your level of comfort, they walk you a few steps up a very mellow slope to try new exercises and so forth, up until you are actually going down a fairly mellow slope on your own and more. </p>\n<p>In the same way that the skill is taught progressively, in the same way the features in the terrain parks were progressive. Where I was, there were two terrain parks, the beginner/intermediate park and the main terrain park. The beginnger/intermediate park had two distinct <em>lines</em> in it. On the one side, was the beginner line which had basic very small, basic features and jumps (they are not really jumps - just humps). These were really small and inviting enough for beginners to get their first taste of riding a rail, box or jumps on and to gain confidence on. The intermediate line, then had progressively larger features (but not too large) that would be within grasp of a more progressed beginner or intermediate rider. Finally, once you were capable in this park, you could at least ride through the <em>main</em> park and take a look.</p>\n<p>Now again, the main park had several lines through it, with a large variety of features. Most of them were larger than in the other park, but mostly, there was variety and progression. For example, in the jump section, there were 7 kickers (jumps). The first 3 were all within grasp of an intermediate with the first and even second being relatively small. From the third jump onward, they got progressively bigger with the final two being pretty big. Similarly, the rails and boxes had a large variety on show, so you could, try the features that were within reach and leave the scarier stuff out. Towards the bottom of the park, there was a set of really large rails and stairs that you would only hit if you were pretty advanced in your riding, but really, the whole setup just <em>breathed</em> progression.</p>\n<p>Granted, one cannot compare one of the best resorts in the north-east, with a dedicated team and resources to develop it to other facilities in other sports, but the concept holds. I believe, for a skatepark, or skill-based sports facility to be successful, both as a business and in fostering a community around the sport, the facility <em>must</em> cater to multiple levels of skill. And if in doubt, better to cater <em>more</em> toward the beginner/intermediate side than the advanced. Primarily because, if you cannot support the beginner in their progression, you will be left with precious few advanced riders. </p>\n<p>Granted, you might find that more advanced riders might become <em>bored</em> if the features are too basic. But the reailty is that in skill based sports like this, even with smaller features, advanced riders can still gain a lot of progression and have a lot of fun on them. That being said, one would need to support these riders too. However, from a business perspective, if you were able and capable to support and grow enough of the beginners and intermediates through progression, finding and making available resources to cater to larger features would come naturally. </p>\n<p>Skateboarding will always be different, however, skatepark owners would do well to consider the beginner/intermediate rider. Cater to the basics, the building blocks. Small mini-ramp, small box, small rails where one can ride lines and progress and flow. </p>","frontmatter":{"title":"Levels."}}},"pageContext":{"slug":"/post042/"}}