{"data":{"markdownRemark":{"html":"<p>I am currently in Muizenberg in the Western Cape. The goal coming down here was to learn to surf. Muizenberg is one of the best places for this. Nice long sandy beach, sand-bottom under the water and most importantly, consistent, beginner-friendly waves! </p>\n<p>Today was the first time I have surfed in years! The last time was more or less 3 years ago on a trip to Chile. This was completely different though, for one reason! Getting a real, one-on-one surfing lesson. In the past, while surfing, I struggled with the pop-up. That is, moving from lying down and paddling to standing up and riding. Often times I would tip over on the pop-up. The reason for this, I discovered from my instructor was that I was not placing my foot in the center of the board. This my friends, made <em>all</em> the difference! I cannot even tell you how much fun it was riding today! </p>\n<p>The waves were perfect! No wind, no side-current or wash, just regular, clean waves of decent beginner height. I even managed to catch a few open-faced waves in front of the white-water. So much fun!</p>\n<p>I have no idea why I did not ever get a surf lesson before. I recommend it whole-heartedly! There are so many small tips and nudges you get that push you in the right direction and help you improve your surfing enough to get the point that you are at least catching waves. Granted, I have some prior experience, mostly with other boardriding, but the trick with surfing, at least for the beginner, is the paddling, the wave selection, and the pop-up, and in this area I really lacked, but now, I feel I have, at least that bit of knowledge to take me to the next small step! </p>\n<p>My top take-aways from today are: </p>\n<ul>\n<li>Take a lesson, it is worth it! Better yet, take more. I have another tomorrow. </li>\n<li>When placing your hands for the pop-up, do not hold the rails, place them flat on the board, just under your shoulders. </li>\n<li>When popping, swivel your hips and get your front foot up and onto the middle of the board - if your foot is too far on the sides, you will topple over. In previous times, this happened to me time and time again and, not knowing any better, I just kept trying to make it. Sometimes I did, but mostly I didn't. Today, I caught pretty much every single wave I paddled for, which, for me, was a huge achievement! </li>\n</ul>\n<p>Note: I got my lessons from an instructor named James working at the Surf Emporium. If you are in town, Surf Emporium are great! The staff are super fiendly and helpful. The instructor was great! And they have lockers, change-rooms and hot showers! And for good measure, there is a Vida E Caffe inside their surf shop and it is right in front of the beach. Perfect! </p>","frontmatter":{"title":"Surfing."}}},"pageContext":{"slug":"/post039/"}}