{"data":{"markdownRemark":{"html":"<p>As is often the case, Fred Wilson put up an <a href=\"https://avc.com/2019/04/opting-out-of-the-legacy-model/\">article</a> yesterday regarding schooling in the US and the increasing number of charter schools, with special reference to the rise of homeschooling.</p>\n<p>Now, I don't have children, so I do not have skin in the game on this topic, but it did get me to thinking about my own feelings towards my experience of schooling. Granted, I left school 18 years ago, so I hope that much has changed in the intervening years. The more I thought about it though, the greater my feeling was that, at least in my case, schooling and the way school measures success is fundamentally misguided. </p>\n<p>Going through school and possibly other forms of education, the primary way to evaluate your progress and understanding of a topic is to write tests or exams. Effectively, this is a means of asking a question, and providing an answer which is then evaluated. The problem is that such a system sets up the wrong way of understanding the world and your progress through it. It creates the wrong expectations and importantly, creates the wrong incentives towards learning and success in general. </p>\n<p>For example, for the 12 years of schooling, your primary measure of success and progession is <em>passing tests</em> or <em>getting grades</em> which determine whether you move forward or remain where you are. In effect, you are rewarded for your efforts on a measurable scale. The problem with this approach is that when you step out the door into the real world. The measures and scales are thrown completely out the window. Doing X does not result in Y. The system of effort to reward is completely different. Take workplace politics for example: In the workplace, doing good work will hopefully get you some measure of whatever it is you seek. Be it a raise, promotion, more responsibility, recognition amongst your peers etc. However, there is no guarantee of this. </p>\n<p>Take a software project as another example, there are factors that determine a measure of right-ness or wrong-ness. Clearly, if the code written results in slow performance and the user interface is poorly laid out, then the project may fail on some level. Or funnily enough, it may still succeed. However, you could have a well designed, well written project fail completely regardless. Any number of factors can sink a project. Likewise, you can have people in jobs who are seemingly terrible at what they do, or at managing people and projects. Yet sometimes such people seem to succeed and keep moving onward or upward in position despite this. In my experience, there was no schooling that caters to this type of environment and dynamic, nor even acknowledged it's existence. </p>\n<p>Schooling teaches you nothing of this. To my mind, schooling teaches you only half the story (if that). It teaches you the knowledge building blocks if you will. This is necessary and this is good. The problem as I see it now with my schooling, was that it pretended as if it was everything. That it was somehow a microcosm of life. That you must do well in school to succeed in life. That you must do well in school and you will be rewarded. That you must follow the rules, and you will progress. This is a lie. In school, you are often given success by someone. You play by someone elses rules and you get rewarded accoding to someone else's choices or opinions. The issue is that life, in general, is completely the opposite. Life has no rules of that nature. There are no guarantees to your progress other than your own determination and satisfaction to learn your own lessons and walk your own path. </p>\n<p>Those who find success often make their own games and their own rules. If they don't like one set, they find or create another set. Undoubtedly, schooling is <em>very</em> important, but it is not the be-all and end-all it makes itself out to be. It is a place where you learn and build foundational skills. It is completely up to you and your own initiative to figure out for yourself how to use to create you own success and find your own rewards thereafter. </p>","frontmatter":{"title":"Schooling."}}},"pageContext":{"slug":"/post045/"}}