{"data":{"markdownRemark":{"html":"<p><em>Note: This post is a transplant. First published on 2017/05/23. It was written by myself on another site and has been moved.</em></p>\n<p><a href=\"https://www.theverge.com/2017/5/22/15673712/anker-battery-charger-amazon-empire-steven-yang-interview\">Great article</a> by Nick Statt on The Verge about Anker. A company in China that makes batteries, chargers, cables and much more. I had never heard of them before seeing the link on <a href=\"https://daringfireball.net/linked/2017/05/22/anker\">Daring Fireball</a>.</p>\n<p>Pity The Verge resorted to the typical \"game\" analogy in the headline. One fascinating aspect of this story is how central Google, Apple and some other tech giants are to this story.</p>\n<ul>\n<li>Anker's founder is a former Google employee.</li>\n<li>Anker sells products as good, but not as expensive as giants Apple, Samsung etc. (Read: Tech giants under-serving basic customer needs for charging and portable charging solutions)</li>\n<li>Anker's design and packaging sensibilities seem to be largely Cupertino-inspired.</li>\n<li>Anker is enabled purely through Amazon. On the flipside, Amazon is one of Anker's greatest weaknesses.</li>\n<li>Anker is following a very strong ladder-up strategy.</li>\n</ul>\n<p>Out of all their products though, the one that stands out to me is this - pure genius - <a href=\"https://www.anker.com/products/A1501011\">Compact Car Jump Starter and Portable Charger</a></p>\n<p>How many festival-goers would love one of these?</p>\n<p>Getting back to the large role the tech giants play in this story reminds me of a similar success story in South Africa. WeFix is a chain of stores that specialise in repairing mobile phones and tablets. Primarily Apple and Samsung. Similar to charging, this is also a market that has proved to be fertile ground for customers under-served by the large tech companies. Locally, if you drop your phone and crack the screen - if you go to your carrier (in my case Vodacom), they will inevitably take weeks to do anything and you will be left without a phone. There are no Apple Stores in South Africa, but the Premium Apple Reseller, iStore, will likely replace your phone, if it is under warranty, if not, they probably won't help you. WeFix fit perfectly into the gap, fixing your phone quickly and relatively cheaply - to big success. They have expanded quickly countrywide and are busy launching related businesses in an effort to expand into other areas. Again, following a ladder-up strategy.</p>\n<p>What is interesting though is as <a href=\"https://wefix.co.za/\">WeFix</a> have made a market out of the gap beneath larger suppliers when repairing phones - there is a market below WeFix being served by small, independent shops that repair phones.</p>\n<p>Rewinding a little. My first experience with WeFix was when they replaced my iPhone screen in one hour for a fair price in hurry. I was extremely impressed and grateful. What I would have done in India with a camera I do not know. (The screen had been completely shattered the day before I flew to India - I had dropped it while being escorte from the Indian Embassy - but that is another story!)</p>\n<p>My next experience with WeFix was one morning I woke up and noticed my iPhone had not charged. After making sure I had the cable in correctly, I left it be. Hours later I came back and found my iPhone stone dead. Once again, I took it to WeFix. An hour or so later, the consultant phoned me and said all was sorted. Having expected there to be something wrong with the phone and being prepared to fork out for some replacement part, I was pleasantly surprised when he told me they had just cleaned the charging port of all the fluff that had accumulated there. They charged me a small fee for the cleaning and that was it. Again, impressed and relieved.</p>\n<p>The next time my iPhone refused to charge I was wise to the trick and managed to pull all the fluff out the charging port myself. Tried again, no luck. Naturally, I headed straight for WeFix, confident they would sort the issue out in one hour and be done with it. I was wrong. They came back to me and said nothing could be done. I don't remember the details but the consultant seemed pretty adamant it was a lost cause. Disheartened, I walked around the mall looking for alternatives. I ended up at the iStore looking at the refurbished, Certified Pre-Owned iPhones straight from California. I bought one.</p>\n<p>I get home, unbox the iPhone, plug it in and off I went. Hours later, I come back, nothing. Certified Pre-Owned iPhone dead. No, not the old, broken one. The brand-almost-new one. This can't be right can it?\nI try it again. No dice. Next day I am back at the iStore. They give me some ideas and tips and I head home again. Nothing works. What now?</p>\n<p>Back to the mall, walking around looking for options. On a suggestion from my girlfriend, I walk into one of these little shops. Not holding out much hope since, to my mind, the chain goes like this:</p>\n<ul>\n<li>Vodacom takes forever, will charge you a lot and doesn't care because they are coining it anyway.</li>\n<li>iStore can't replace it, won't/can't fix it and is only interested in selling you another device.</li>\n<li>WeFix can't fix it.</li>\n<li>It's broke, ain't no-one gonna fix it.</li>\n</ul>\n<p>I walk up to the guy behind the counter and tell him my sad story. He asks me:</p>\n<p>\"Can I open up the phone?\"</p>\n<p>\"Sure\"</p>\n<p>\"No warranty?\"</p>\n<p>\"No\"</p>\n<p>\"Two minutes Turkish\" he says (not really - but he did say two minutes) and walks into a little back office. Two minutes later he comes back, says I should come back in 20 minutes to pick up the phone. True to his word, I come back, he shows me he is charging the phone and turns it on. Working, good as new. To this day.</p>\n<p>In the end, I returned the I'm-not-sure-it-was-certified-iPhone. Kudos to iStore who took it with little to no questions asked. I traded it in for an Apple TV and a JBL Charge3. Both fantastic purchases by the way!</p>\n<p>No-one is really <em>beating</em> anyone. The tech giants can't <em>win</em> at everything they do. Neither can the smaller giants in smaller markets win everything they do. It is exactly because no-one can <em>beat</em> everyone. That your greatest strength is also your greatest weakness and that everyone can <em>win</em> at something. That is the nature of the market and the business ecosystems around us. One minute a business is serving the under-served, the next minute it is over-serving and undercut.</p>\n<p>May we all be so lucky as to have websites write stories about how we are being beaten at our own game!</p>","frontmatter":{"title":"Winning The Game."}}},"pageContext":{"slug":"/post011/"}}