{"data":{"markdownRemark":{"html":"<p>If you have not tried <a href=\"https://www.cypress.io/\">Cypress.io</a>, I would suggest you give it a shot! </p>\n<p>In short, Cypress.io is a JavaScript-based library for writing end-to-end (e2e) tests. As their website says: \"Fast, easy and reliable testing for anything that runs in a browser.\" </p>\n<p>My experience of using Cypress so far bears that statement out. Being a newcomer to the library, I was able to write a fairly comprehensive set of e2e tests in an afternoon. As the website lays out, Cypress has 2 focus areaa:</p>\n<ul>\n<li>Test runner</li>\n<li>Dashboard service</li>\n</ul>\n<p>My usage so far has only covered the \"Test runner\" which is broken up into two basic parts: </p>\n<ul>\n<li>Setup tests (run tests)</li>\n<li>Write tests </li>\n</ul>\n<p>Now, getting started is quick and easy. There are no dependencies and you are ready-to-go with the following: </p>\n<p><code>npm i --save-dev cypress</code></p>\n<p>In your package.json, under <code>scripts</code> add (I have shortened my command for ease-of-typing): </p>\n<p>\"cy\": \"cypress open\"</p>\n<p>In your terminal you can then run: </p>\n<p><code>npm run cy</code></p>\n<p>This will start up the test runner which opens up a browser window with the Cypress interface. From this interface you can then select which tests you want to run or whether you want to run all tests. This, in turn, will open the test browser that will run all the tests. In this window, you have a UI with your tests steps on the left and the actual site/app view on the write. Granted, I am a novice when it comes to e2e testing, but I got a real kick out of seeing my tests run and interact with my app in real-time as the test steps on the left passed or failed. It really is like watching a screen-recording of someone test your app in high-speed! </p>\n<h3>Writing tests.</h3>\n<p>As far as writing tests goes: </p>\n<ol>\n<li>You write you tests in JavaScript in a style that is recognisable across many JS testing libraries. (You have your 'describe' and 'it').</li>\n<li>The API is very similar to jQuery in terms of selecting DOM elements and manipulating them. </li>\n</ol>\n<p>In my experience so far, Cypress \"just works\". Since you are \"interacting\" with the DOM in a way that the \"user\" would, you are basically replicating in declarative code, how someone would use your app, and what they will expect to see. From this perspective, I find it a lot simpler and intuitive than unit/integration testing. At my first outing, I was writing my e2e tests after the fact, now, my experience with unit testing had me nervous about this because, typically, writing tests <em>after</em> you have already implemented your app means you can look forward to a lot of refactoring, whereas, because Cypress is looking at your app as a whole, as the user, it is not concerned with all the implementation details, just with the what is on the screen and what happens as a result of interactions. </p>\n<p>In preparing my first project for the Udacity React Nanodegree, I felt it was a good opportunity to expand my skillset. I have heard a few things about Cypress lately, and wanted to try it out on a small example app. This project was a the perfect opportunity and I would encourage anyone out there to give it a try. Chances are you will be pleasantly surprised! </p>","frontmatter":{"title":"Cypress.io."}}},"pageContext":{"slug":"/til0124/"}}