{"data":{"markdownRemark":{"html":"<p>Development is not easy. Sometimes you get stuck. Sometimes you miss things which later seem obvious. Sometimes you need that Github Gist or Stack Overflow answer to get you over the hump. Sometimes you need to read a blog post, or tutorial or watch an online video or course to teach you. Sometimes all of the above. </p>\n<p>Coding does not <em>come naturally</em> for everyone or even anyone?</p>\n<p>It comes with curiosity, attention, perseverence and questioning. You learn by doing. And you learn better by doing it over again. By asking questions. And trying things that do not work. It certainly does not come by not trying, by not taking a shot. </p>\n<p>The thing I often try to remember with coding is that you need to start small. Start with the smallest thing possible: put something on the screen, even if you need to hardcode it. Log something to the console. Check the basics, take the small steps. Reference <a href=\"https://developer.mozilla.org/en-US/\">MDN</a>. Read. The. Code. Think it through. Ask yourself what the code is doing and then ask yourself, if it is really doing what you think it is doing. (If so why or why not?)  </p>\n<p>Do not just give up. Sure, you may find tasks you cannot do and might find you get horribly stuck and keep bashing your head against the same thing over and over. When you think you really cannot do it. Then <a href=\"https://rubberduckdebugging.com/\">rubber duck debug it</a>. If you still cannot get there. Then ask for help. There are many friends and colleagues more than willing to help. Just don't give up before you have even tried and definitely, do not try to pawn the work off to someone else before taking the shot.</p>\n<p>If you pass up on trying, not only do you pass the buck to someone else, but you also forfeit your chance to learn something new. You give up on an opportunity to grow and to figure something out for  yourself. Development is an endless series of small steps. Even if you do not get it right and end up having to ask for help, that is good. If someone else needs to help you, there is no shame in that, but if they help you and you have not tried, what will you really learn? Sure, the task will be done, but someone else would have done it and what progress would you have made? </p>\n<p>Take the shot. Even better, make it your best shot. Anything short of that and you are letting yourself down. You will often be surprised by what you will learn without even realising it. Anything short of a solid attempt, and chances are that next time, you will pass on taking the shot again. And again...</p>","frontmatter":{"title":"Give it a Shot."}}},"pageContext":{"slug":"/til0078/"}}