{"data":{"markdownRemark":{"html":"<p><em>Note: This post is a transplant. First published on 2018/05/14. It was written by myself on another site and has been moved.</em></p>\n<p>Google CEO Sundar Pichai <a href=\"https://www.theverge.com/2018/5/8/17332070/google-assistant-makes-phone-call-demo-duplex-io-2018\">demonstrated</a> an impressive and somewhat creepy version of a new feature coming to Google Assistant at Google I/O. Google Duplex, as the feature is called, is able to make a phone call and book an appointment at a hair salon and a table at a restaurant on behalf of the user.</p>\n<ul>\n<li>The impressive part of this demonstration was how real the Google Assistant sounded as well as how well it handled the call.</li>\n<li>The creepy part of this was that the person on the receiving end of the phone call did not seem to notice that the caller was not a real person. (Had I answered that phone, I would not have thought it was a computer on the other side).</li>\n</ul>\n<p>This has raised several questions over the possible use and deployment of this technology. As is often the case, despite Sundar Pichai saying that Google wants to \"get this right\" in terms of the user experience for both customers and businesses - the demonstration displayed little attempt to address what many in the tech press feel should be required from this technology. Namely, transparency.</p>\n<p>In Google's defence, they have said as much on the accompanying blog post announcing the technology. <a href=\"https://ai.googleblog.com/2018/05/duplex-ai-system-for-natural-conversation.html\">Yaniv Leviathan and Yossi Matias writing at the Google AI Blog</a>:</p>\n<p>\"The Google Duplex technology is built to sound natural, to make the conversation experience comfortable. It’s important to us that users and businesses have a good experience with this service, and transparency is a key part of that. We want to be clear about the intent of the call so businesses understand the context. We’ll be experimenting with the right approach over the coming months. \"</p>\n<p>Looking at this situation it is easy to see both Google and the tech press's positions on the demonstration - particularly, what Google means by transparency is that the receiver understands the intent of the call. What the press means by transparency is that the receiver knows who/what is making the call.</p>\n<p>\"The Google Duplex technology is built to sound natural\"</p>\n<p>Some commenters (myself included) feel that the Google Assistant should identify itself. Especially because it sounds natural and real. However, I sympathise with Google here because in order for a conversation to sound natural, the person on the receiving end needed to feel comfortable. Had the person been told they were speaking to Google Assistant or a robot, the conversation may have gone a lot differently and not demoed well. (Turing Test anyone?)</p>\n<p>As for whether these kinds of assistants should even sound like humans at all, again, this would not have demoed well for Google because, it is likely that the person would have hung up the phone. Again, I sympathise with Google here because, from personal experience, when I get called by automated systems, I hang up immediately. The reality is that this is a demo and Google is demonstrating the prowess of their technology to both consumers and to competitors. What is being demonstrated is:</p>\n<ol>\n<li>Look how natural it sounds!</li>\n<li>Look how well the assistant handles the call and the intricacies of it!</li>\n<li>Look how far we have come!</li>\n</ol>\n<p>Google are aware of the impact such technology would have - the use cases are rather compelling:</p>\n<ul>\n<li>As a business, I would certainly appreciate having to answer less calls during holiday periods and customers will appreciate having more up to date information.</li>\n<li>As a customer, yes, I can see the benefit of an assistant making a call on my behalf when I am in a rush as being useful.</li>\n</ul>\n<p>What Google completely missed in the demo however, is that much of the subsequent negative commentary around the demonstration could be (at least somewhat) addressed by being more specific in terms of what is being experimented with. For example, would it not have made a difference to the tone of the subsequent reporting had Sundar Pichai said something along the lines of:</p>\n<p>\"We understand this technology sounds like a real person and has progressed to the point at which it raises several questions in terms of usage. Some of the topics we are considering in our experiments are how to announce to the receiver of the call who is calling? Which voice should the assistant speak with in order to put the person on the on the receiving end at ease? And since this technology makes it possible to make many calls without humans making the actual calls, what large scale use cases are we going to enable so that customers are not spammed? We will be experimenting with this technology in the coming weeks.\"</p>\n<p>I do not work in PR, so I have no idea whether a statement such as the above would work. However, it does attempt to address the possible concerns raised by the use of this technology. Tech companies are going to be running into these situations more frequently as technology increasingly moves into more personal and 'real' interactions. The tech press have their scopes locked in on these companies and their announcements. Executives should be able to effectively address the issues around their technologies before, during and after release in order to ensure success. Effective communication on these topics is important as these companies come under ever more scrutiny.</p>\n<h3>Parting thought:</h3>\n<p>If Google Assistant can make the calls on behalf of the customer, can the business/customer not use the Google Assistant in the same way to answer them?</p>\n<p>If so, why is a call even necessary if there is an Assistant on both sides?</p>","frontmatter":{"title":"The Duplex Demo."}}},"pageContext":{"slug":"/post024/"}}