{"data":{"markdownRemark":{"html":"<p>While doing research yesterday on how to improve my surf pop-up, I came across this <a href=\"https://i1.wp.com/surfstrengthcoach.com/wp-content/uploads/2018/11/Cook-FMS-Performance-Pyramid.jpg?fit=846%2C692&#x26;ssl=1\">image</a> of the Performance Pyramid. At the base lies Movement, which is defined as \"Movement quality as influenced by mobility and stability\". In my mind, those two equate to flexibility and balance. </p>\n<p>Growing up I was very active. I spent my childhood tearing around outside whether on foot or bicycle and in later years I tore around hitting, kicking or throwing a ball in various ways. Despite all this, I was never flexible. I believe, I have a decent sense of balance though. When it comes to flexiblity, not so much. </p>\n<p>I have memories from long ago karate practice where we would sit, in what yoga calls <em>butterfly</em> pose and I was amazed at the people that could get there knees onto the floor. To this day, I still cannot do this. However, I have been doing yoga. Innately, I knew that on some level, it would be good for me to become more flexible. Now, several months later, am I actually more flexible? </p>\n<p>Yes and no. Yes, I can more easily touch my toes, and more importantly, yoga has taught me to breathe through the hurt the stretch brings on. No, because, to my mind, being flexible means you can do these things easily, which is not the case with me.  </p>\n<p>As to the flexibility question, I do believe I am <em>very</em> slowly loosening up. To some extent progress has been impeded by injuries. For several weeks I had neck and arm/shoulder pain that would not go away. I also have a hip and wrist injury that keeps rearing its head each time I fall on it while skateboarding. To top it off I have a muscle in my left butt which seems to be far tighter than it should be. After all these months of comparatively intense physical exertion, I would have thought my body would be feeling far looser, supple and more energetic than it does. Every morning when I wake up, I am tight all over, and by the end of a physically challenging day I am exhausted. This does not seem to fall in line with what I would have expected. </p>\n<p>That being said, I have really come to enjoy the release of muscles and tension that yoga brings about. Whenever I have finish a session, there is a sense of release. A subtle injection of energy and possibility into my body that was not there before. Regardless of my doubts regarding my flexilibity, I will continue in the understanding that over time. Likely a very long time, there will be benefits to be had. </p>","frontmatter":{"title":"Flexibility."}}},"pageContext":{"slug":"/post055/"}}