{"data":{"markdownRemark":{"html":"<p>As part of my experimentation with Glide Apps (and by extension Google Sheets), I asked myself whether I could bring RSS data into my app. After a cursory Google search, I found that this is possible and very easy. </p>\n<h3>IMPORTFEED.</h3>\n<p>First off, Google Sheets makes it very easy to import RSS data (from any RSS feed) using the <a href=\"https://support.google.com/docs/answer/3093337?hl=en\">IMPORTFEED</a> formula.</p>\n<p>I refer to the Google Sheets documentation which says that the format of the IMPORTFEED formula is as follows: </p>\n<p><code>IMPORTFEED(url, [query], [headers], [num_items])</code></p>\n<h3>WordPress RSS.</h3>\n<p>Self-hosted WordPress sites, by default, provide an RSS feed at the <a href=\"https://wordpress.org/support/article/wordpress-feeds/\">/feed URL</a>. If we were to use the <a href=\"https://wordpress.org/news/\">official WordPress blog</a> itself as an example you could find the RSS feed at: </p>\n<p><code>https://wordpress.org/news/feed/</code></p>\n<p>Based on the IMPORTFEED documentation, I want to request the following: </p>\n<ul>\n<li>url will be <a href=\"https://wordpress.org/news/feed/\">https://wordpress.org/news/feed/</a></li>\n<li>query will not be supplied since I am just looking to get the basic feed</li>\n<li>headers will be set to TRUE since I want the headers to populated as the title row in the spreadsheet</li>\n<li>num_items will be set to 5 since this is an example and I only want to bring in a few items as a test. </li>\n</ul>\n<p>With that in mind, as a test, we can create a \"News\" tab in our Google Sheet. Then in the first cell add the following: </p>\n<p><code>=IMPORTFEED(\"https://wordpress.org/news/feed/\",,TRUE,5)</code></p>\n<p>If all is well, you will receive data populated into your Google Sheet! </p>\n<p>From there, you can setup your page as is typical in Glide. </p>","frontmatter":{"title":"Import WordPress RSS Data into a Glide App."}}},"pageContext":{"slug":"/post060/"}}