{"data":{"markdownRemark":{"html":"<p>Yesterday I went to a climbing gym called CityROCK in Cape Town. This place is amazing! As you walk in, the facility looks fantastic. Everything is clean, well lit, the staff are friendly and welcoming and my impression was just one of overall quality. </p>\n<p>To my recollection, I have only ever climbed on a climbing wall once in my life before. This was over 12 years ago at a climbing wall in Durban. As such, I have practically no experience of it and had no idea what to expect. As a first time visitor, I filled in an indemnity form, paid for my day pass and climbing shoe and harness rental. A staff member then took me through the basics of the facility layout. Basically, they offer 3 types of climbing: </p>\n<ul>\n<li>Bouldering - which is more technical, lower to the ground climbing without ropes. </li>\n<li>Climbing - your typical climbing with a minimum of two people involved, one climbing and one belaying. </li>\n<li>Auto-belay climbing - for solo climbers where you are belayed by a safety device. </li>\n</ul>\n<p>Since I was on my own, I made use of the auto-belay walls. Basically, there is a climbing rope which you clip into and you start climbing. If you are jump off/repel from the wall, or fall while climbing, the rope automatically eases you down the wall at a gentle pace. While it seems obvious that such devices would exist in 2019, I admit I did not even know such a thing existed, and I am glad it did because without these, I would not have been able to climb on my own. </p>\n<p>The cimbing walls represent a great variety of difficulties, starting with a level 10 at the easiest and progressing up to I don't know where. I started with some easy walls, opting to pretty much to move from left to right along the walls, attempting all the routes I could amongst the auto-belay options. Granted, I was a little nervous of the auto-rope at first - once I reached the top, I opted to down-climb a little way before thrusting out away from the wall. There was no need for this though, the more you climb, you eventually just start puhing off to descend. </p>\n<p>I enjoyed the climbing, it is something very different to what I am used to. I take part in many physical activities, most of which involving riding on some sort of board or bicycle. Climbing is totally different - it is intensely physical, but not in the way running or other high tempo cardio activities are. Climbing requires a much more deliberate approach, both physically and mentally. I was able to climb all the walls I attempted until I reached my limit for the day. Whether it was that my fingers are not yet strong enough to hold the type of grips I encountered on this route, or wehther I was just to tired to keep the holds, I finally could not get past this one section of a route. The particular region was a challenge because, for the most part, up until this route, most of the routes I had been climbing had rather easy to grip holds and the positioning was such that it was not particularly difficult to make the moves. This combination however was really tricky for me and after several attempts I resolved to call it a day - mostly because I felt I was too tired to tackle this route. Had I been fresh, I think I may have been able to make a better challenge for it, but considering it was my first time climbing and was already tired, I was not in the right mindset physically or mentally to get through it. </p>\n<p>Regardless, this brief experience was revealing to me in many ways: </p>\n<ul>\n<li>\n<p>Climbing is a unique combination of physical and mental challenge wrapped up in confronting fear, discomfort and physical limitations. Granted, I am fully ware that climbing on a gym wall is nothing close to climbing an actual rock wall, neither in terms of skill, feel, height, exposure, weather and any number of external elements that make real climbig so incredibly challenging and dangerous. However, it strikes me that while being high off the ground and exposed is obviously dangerous, the interesting thing for me was that the failure is uniquely personal and unspectacular - mostly coming down to not being able to make seemingly simple movements successfully, or to hold a position appropriately. </p>\n</li>\n<li>\n<p>I am not sure I have a natural affinity or physicality for climbing. Typically, I have been very sporting in my life. As a youngster, I had a knack as well as a determination for certain sports - mostly ball sports which involved using equipment. In pure athletic endeavours such as athletics and swimming, I was less successful. Granted, I was not without ability, but I think I have been more suited to an ability to learn to use something in combination with my body than to purely use my own body. As I type this, it is a concept I have never thought of before. </p>\n</li>\n<li>\n<p>The realisation that what Alex Honnold does is even further beyond my comprehension than I realised. I already considered what he does as beyond any scope of my comprehension. Now, it is multiplied out exponentially in comprehension. </p>\n</li>\n</ul>","frontmatter":{"title":"Climbing."}}},"pageContext":{"slug":"/post051/"}}