{"data":{"markdownRemark":{"html":"<p>When the going is good you need to get going! Or better yet, make hay while the sun shines! This is a concept that has been on my mind for some time. As I was starting to wakeskate more often, I took the approach that if the sun was out (and when it was not) I was going to go a ride. Primarily because, if you have a day of great sun, no wind, the water is going to be perfect for riding and you don't know when you will next get another day like it. Weather can change, wind can pick up, rain might come and then conditions may not be as favourable. </p>\n<p>This lesson was learned again when I was in Langebaan to do a kiteboarding course. Kiteboarding, of course, requires wind. At least 12 - 15 knots for a beginner is a good windspeed. The first day I was in town, on the beach, the conditions were perfect for learning and I had my first two lessons. For the next 4 days there was almost no wind to speak of and one could not even get a kite up in the air. Fortunately, I at least got some time on the kite and in the water so that I at least learned something. </p>\n<p>Similarly, today, I went down to Muizenberg beach for my second surf lesson and what a contrast to yesterday. It was overcast and windy. Worse, the wind was not the favourable off-shore that you want for shaping up good waves. It was onshore, and the swell was more inconsistent. The waves for lumpy, mushy and washy. Still, I got in the water and caught some waves. I had to work far harder for them in terms of paddling and lifting over or diving under white water. It was so much tougher and the waves were not as rewarding as yesterday. Still, great learning experience! Conditions are likely not in your favour more often than they are and if you can surf or do whatever it is that you are doing in less than ideal conditions, then come good conditions and you will be so much better for it. </p>\n<p>The point is though, yesterday, I considered staying in the water and doing another lesson. I was in the zone, excited and more importantly, the conditions were just so good. Today, I regretted not doing another session just that little bit. Granted, had I done another session, I would likely have been super tired and fatigued today. And maybe, going on longer would have lead to diminishing returns as I started to tire, but the thought still stuck in my head. When the going is good, keep going because you don't know what tomorrow's weather may bring! </p>","frontmatter":{"title":"When the going is good."}}},"pageContext":{"slug":"/post040/"}}