{"data":{"markdownRemark":{"html":"<p><em>Note: This post is a transplant. First published on 2017/05/11. It was written by myself on another site and has been moved.</em></p>\n<p>What will Attorney General Eric Holder's report reveal about the culture at Uber?</p>\n<p>And what effect might the report have not only on the company and its prospects, but on the company's customers?  </p>\n<p>Uber has been in the line of fire this year after numerous reports including, but not limited to, <a href=\"https://www.susanjfowler.com/blog/2017/2/19/reflecting-on-one-very-strange-year-at-uber\">blog posts about sexual harassment</a>, CEO Travis Kalanick <a href=\"https://www.bloomberg.com/news/articles/2017-02-28/in-video-uber-ceo-argues-with-driver-over-falling-fares\">shouting at an Uber driver</a> on video, accusations from Alphabet about the alleged <a href=\"https://www.recode.net/2017/2/23/14717432/waymo-otto-uber-anthony-levandowski-lawsuit\">theft of intellectual property related to self-driving vehicles</a>, \"<a href=\"https://www.nytimes.com/2017/03/03/technology/uber-greyball-program-evade-authorities.html\">Greyballing</a>\", circumventing <a href=\"https://www.nytimes.com/2017/04/23/technology/travis-kalanick-pushes-uber-and-himself-to-the-precipice.html\">Apple's App Store policies</a>, <a href=\"https://www.theinformation.com/uber-groups-visit-to-seoul-escort-bar-sparked-hr-complaint\">visits to brothels</a> and ensuing attempts to cover them up. Even <a href=\"https://twitter.com/KyleOrl/status/856339201004109824\">disputes over records for Wii Tennis</a>. To top it all off,  <a href=\"https://www.recode.net/2017/5/1/15498026/uber-travis-kalanick-arianna-huffington-code-conference\">Kalanick has called off his appearance</a> at the Code conference later this month. </p>\n<p>Uber, the service, is fantastic! In my home country, unlike in the USA, there are no real alternatives. Lyft does not operate there, neither do any of Uber's numerous international competitors. As such, while I have serious misgivings about the company itself, what other ride-app options are there? </p>\n<p>The fact is, if I need a ride, without any meaningful alternatives, I will use Uber because it is the best ride service where I live, regardless of the feelings I have toward the company and its management. Unfortunately, I am sure that many people will feel exactly the same. It seems unlikely that these stories will have a wide scale effect on Uber's customers.</p>\n<p>One can hope that the soon-to-be-released report will lead to re-evaluations and changes in the management team and culture being promoted at Uber. All of these events have happened under the current management's watch and have resulted in substantial damage to the company image. If I were to consider my own job, if rumours and reports came out about me doing underhanded things and behaving in ways that legitimately threatened the existence of the company, my career would be in serious jeopardy. Is this really the case for Travis Kalanick, Emil Michael, Anthony Levandowski and others at the heart of these controversies? </p>\n<p>Peter Kafka writes on Recode about the upcoming report:</p>\n<p>Uber’s top executives and board will see it at the very end of May. But the company won’t distribute it to its employees, and explain what its next steps will be, until sometime after that, likely the week of June 5.</p>\n<p>I understand that companies need to manage situations like these at the highest levels, but what does a company do when it is the highest levels that are implicated in the damaging events?</p>\n<p>To outsiders, Uber looks relatively unchanged from a managerial or cultural perspective. Granted, this may all change once the report comes out. I suspect though, that the real loss for Uber will not be in their image or with their customers in the near term. Rather, these events will have created a sense of blood in the water for their competitors. If the competition was fierce before, the levels are likely to be increased. Where Uber once seemed to be unbeatable, it now seems like they are only ever one controversial step away from scuttling their own ship.</p>","frontmatter":{"title":"Uber Alles."}}},"pageContext":{"slug":"/post006/"}}