{"data":{"markdownRemark":{"html":"<p><a href=\"https://www.traversymedia.com/\">Brad Traversy</a> has a great introductory video to running <a href=\"https://www.youtube.com/watch?v=pYhLEV-sRpY\">WordPress, MySQL and phpMyAdmin within a Docker</a> container. In short, he shows you how to quickly setup a docker-compose file to spin up the official Docker images for WordPress, MySQL and phpMyAdmin. </p>\n<p>To my mind, the payoff for using Docker for WordPress is that, once you have Docker setup on your machine, the famous <a href=\"https://wordpress.org/support/article/how-to-install-wordpress/\">5-minute WordPress install</a> is now down to as long as it takes the <code>docker-compose up</code> command to run! </p>\n<p>No more downloading and unzipping folders, no manual installation of WAMP or XAMPP or any of the rest of it... You just run run one command and boom, you are ready to roll! </p>\n<p>From there, I advise you to take a look at Brad's follow-up video about using the <a href=\"https://www.youtube.com/watch?v=fFNXWinbgro\">WordPress REST API with React</a>. In it, he runs you through the basics of setting up the WP REST API and then shows you how to setup and use JWT Authentication, Custom Post Types and Custom Fields to customise your data. From there, he builds some very bare bones React components to illustrate usage with Axios and React-Router-Dom. The fantastic thing about this is that, if you have a little bit of WordPress knowledge, and are accustomed to working with React (or Angular, Vue) you will feel right at home in starting to build-out a front-end to use WordPress as a headless CMS. </p>\n<p>I really enjoyed these two videos. All up they should only take you and hour or two to work through and they really open up your eyes to a more flexible and modern way of working with WordPress.</p>\n<p>If you are interested, here is the <code>docker-compose.yml</code>:</p>\n<pre><code>version: \"3\"\n\nservices:\n  # database\n  db:\n    image: mysql:5.7\n    volumes:\n      - db_data:/var/lib/mysql\n    restart: always\n    environment:\n      MYSQL_ROOT_PASSWORD: ${MYSQL_ROOT_PASSWORD}\n      MYSQL_DATABASE: ${MYSQL_DATABASE}\n      MYSQL_USER: ${MYSQL_USER}\n      MYSQL_PASSWORD: ${MYSQL_PASSWORD}\n    networks:\n      - wpsite\n  # phpMyAdmin\n  phpmyadmin:\n    depends_on:\n      - db\n    image: phpmyadmin/phpmyadmin\n    restart: always\n    ports:\n      - \"8081:80\"\n    environment:\n      PMA_HOST: db\n      MYSQL_ROOT_PASSWORD: ${MYSQL_ROOT_PASSWORD}\n    networks:\n      - wpsite\n  # WordPress\n  wordpress:\n    depends_on:\n      - db\n    image: wordpress:latest\n    ports:\n      # 8000 on localhost, to 80 on container\n      - \"8080:80\"\n    restart: always\n    # ./ on local machine maps to /var/www/html on Apache, which is where WP files are stored\n    volumes: [\"./:/var/www/html\"]\n    environment:\n      # 'db' is service above. 3306 is default port on MySQL\n      WORDPRESS_DB_HOST: db:3306\n      WORDPRESS_DB_USER: ${WORDPRESS_DB_USER}\n      WORDPRESS_DB_PASSWORD: ${WORDPRESS_DB_PASSWORD}\n    networks:\n      - wpsite\nnetworks:\n  wpsite:\nvolumes:\n  db_data:\n</code></pre>\n<p>In future, I will look to add the React front-end to this docker-compose setup so that the React client can also get up and running with the <code>docker-compose up</code> command. </p>\n<p>Also note, in the example above, I have used environment variables for the users and passwords. As much as possible, I find it easier to use environment variables like this where I can. I find it simpler to use the same patterns and it (mostly) keeps me from having to think about where I defined what. </p>\n<p>The env vars should be populated into a <code>.env</code> files on the same directory level as the docker-compose file:</p>\n<pre><code>MYSQL_ROOT_PASSWORD=password_goes_here\nMYSQL_DATABASE=database_goes_here\nMYSQL_USER=user_goes_here\nMYSQL_PASSWORD=password_goes_here\nWORDPRESS_DB_USER=user_goes_here\nWORDPRESS_DB_PASSWORD=password_goes_here\n</code></pre>","frontmatter":{"title":"WordPress, Docker and the REST API."}}},"pageContext":{"slug":"/til0152/"}}