{"data":{"markdownRemark":{"html":"<p>While I have not been posting regularly of late, a lot has been going on. It has been a real rush of mixing and matching ideas, services and learning new things!  </p>\n<h3>Glide.</h3>\n<p>A while back I started experimenting with the incredible <a href=\"https://www.glideapps.com\">Glide</a>. I have been <a href=\"https://spectrum.chat/users/nicholas-preto\">contributing</a> to the <a href=\"https://spectrum.chat/glideapps\">community</a> where I can by answering questions. </p>\n<p>My journey into Glide introduced me to the world of Google Sheets. While I was familiar with Google Sheets and had a surface level of knowledge in terms of formulas, my Glide work really pushed me to dig deeper. This process resulted in me starting to learn a lot more about formulas, as well as to experiment with both Google App Script and Airtable. </p>\n<h3>Google App Script.</h3>\n<p>In short, Google App Script is essentially JavaScript. From what I can tell, it is more like JavaScript from several years ago! Out of the box, there is no support for modern ES features and the IDE environment leaves a lot to be desired. This lead me to looking for alternative options in order to: </p>\n<ul>\n<li>A: Develop locally in a more familiar and comfortable environment. </li>\n<li>B: Develop with more modern language features. </li>\n</ul>\n<p>My search quickly lead me to <a href=\"https://github.com/google/clasp\">Clasp</a> (Command-Line App Script Project). This library attracted me because it was command-line based and seems, on the surface, to be very similar to something like npm or the Heroku CLI. Furthermore, Clasp enables you to use TypeScript, which has modern ES language feagtures built-in. Since I am familiar with TypeScript form working with Angular, I was very happy with this! </p>\n<h3>Airtable.</h3>\n<p><a href=\"https://airtable.com\">Airtable</a> is pitched as a combination of a Spreadsheet and a Database, but with a much friendler, consumer-friendly face. Admittedly, my first hour using the application was frustrating since I carried over many of my expectations from Google Sheets. After butting my head against the UI for a while, I decided to take a step back and reset. This meant forgetting all expectations I had from the Google Sheets world, and looking at Airtable with fresh eyes. </p>\n<p>The thing I <em>really</em> like about Airtable, is that it comes with an API and Node.js client out of the box! This means, you can integrate Airtable into an app straight away. </p>\n<h3>Airtable Plus.</h3>\n<p>After a very brief initiation to the <a href=\"https://airtable.com/api\">Airtable API</a> and <a href=\"https://github.com/airtable/airtable.js/tree/master\">Node.js client</a> (which is promise based), I decided to dive straight in and use it for an app idea I have been thinking about. In recent time, working with Node.js and React has had me using async/await extensively and as a result, I was looking to use this approach for my app. Fortunately, there is a npm module called <a href=\"https://airtable-plus.js.org/\">Airtable Plus</a> which present the Airtable API in a async/await-friendly manner. </p>\n<h3>React &#x26; React Native.</h3>\n<p>While I have dipped my toe into React before, I have not jumped into the framework in a real project before. This has now changed. I have spent the past few weeks coming to grips with it and have no begun working on some real code. At the same time, I am learning React Native. Taking all the above into consideration, things have been quite busy! While any one of the above topics are interesting on their own, effectively taking them all in simultaneously has been quite a ride! None the less, I am inspired by what I have already learned and beyond excited for what is still to come! </p>","frontmatter":{"title":"Mix 'n Match."}}},"pageContext":{"slug":"/til0114/"}}