{"data":{"markdownRemark":{"html":"<p>Last week I started working towards building a basic microservice in Node.js. I have been following along with the <a href=\"https://www.udemy.com/nodejs-microservices-for-beginners/\">Node.js Microservices for Beginners</a> course on Udemy and I have enjoyed it thoroughly! </p>\n<p>While the course is a little rough around the edges in terms of presentation, the content is interesting and engaging from multiple perspectives as it takes you through building the following: </p>\n<ul>\n<li>A GraphQL server using Apollo. </li>\n<li>A basic REST API with MongoDB (the course uses mLab but I used my own local MongoDB instance).</li>\n<li>Managing your services with PM2.</li>\n<li>Pushing messages to RabbitMQ hosted on CloudAMQP.</li>\n<li>Sending email via Mailjet (Not yet watched and coded).</li>\n</ul>\n<p>I have worked with GraphQL on this very website, but beyond the initial implementation of this site, I have not been very familiar with this technology. This course has given me a good grounding and I am certainly keen to dig deeper! </p>\n<p>REST APIs with Mongo is not new to me at all as I have been working with this setup for quite some time now, however, it was great to see how to combine a Gateway GraphQL API in front, with a REST API behind it. This definitely opens up doors of possibility in decoupling apps and services. </p>\n<p>While the upcoming Mailjet portion of the course will be interestring - what I am particularly excited about is the implementation of the queue! While I have implemented my own email sending service via Nodemailer, I really excited about using a queue to sit in between the mailing service and the API. Using the architecture and setup I am learning in this course will give me plenty of confidence to refactor my implementation into a more modern setup. </p>\n<p>Every now and then, you learn and do something in development which makes you feel like you are entering a new phase of ability - being able to implement and use a microservices, queue/message based system definitely feels like a step in that direction! Can't wait to dig deeper on this! </p>\n<p>Note:\nWhile the course uses CloudAMQP for the RabitMQ implementation and MailJet for sending emails, I am going to look to expand upon this by setting up my own RabbitMQ server as well as using NodeMailer to send the emails. Cloud services are fantastic, and for production purposes are, in my view, the better option, however, for learning, I feel it makes sense to do the work to set up one's own instance for the experience. </p>","frontmatter":{"title":"Continuing Microservices."}}},"pageContext":{"slug":"/til0087/"}}