{"data":{"markdownRemark":{"html":"<p>I have never learned to play the guitar. I think, through the course of my life, I had two friends, on separate occassions, try to informally teach me, but that did not ever go beyond a first lesson. As such, I am pretty much useless and ignoratn when it comes to the guitar. </p>\n<p>Regardless, I am hoping this will soon change. On the internet, you can learn anything, guitar being one of them! </p>\n<p>First off, I have loaned my mothers old acoustic guitar which has, I am guessing, very old strings, and is also missing the first string (High E). </p>\n<p>Next is that, this thing was/is horribly out of tune. I don't know if string, as they get older \"lose\" tune, but in any event, tuning it was my first challenge! </p>\n<p>Google to the rescue! After Googling around a bit, I realised, obviously, that there are a myriad of tuning apps out there. The only name that stuck out to me was Fender Tune. Fender, of course, makes incredible guitars, so the brand name definitely tipped my choice in that direction. After installing it, the tuning interface was pretty simple I had my 5 strings tuned in no time! </p>\n<p>To my unskilled ear, I am a bit unsure of whether the guitar is <em>really</em> in tune perfectly, since, if I try the tuner again after a few minutes, it is out of tune again. I think this is likely due to the string being old and my being on the coast may also have something to do with it. It is also likely that the app does not \"hear\" the tune exactly, but anyway, tuning the guitar was a big obtacle for me and I am so happy that I can now move on, with the confidence that I can at least get it mostly in tune from here on out. </p>\n<p>Once in the Fender Tune app, I also noticed they have a Play section which leads one to their learning platform... This seemed almost too good to be true! Not only had they helped me get over my first major obstacle with the guitar, they also seemingly hold a key to my learning it. But more on this later... </p>\n<p>Next stop: Finding a music shop to buy new strings and a pick! </p>","frontmatter":{"title":"Guitar."}}},"pageContext":{"slug":"/post035/"}}