{"data":{"markdownRemark":{"html":"<p><em>Note: This post is a transplant. First published on 2018/01/29. It was written by myself on another site and has been moved.</em></p>\n<p>While Amazon does not have the presence in South Africa that it has overseas, personally, I have felt Amazon's presence beginning to expand in my day to day. This got me thinking of the incremental nature in which Amazon seem able to build its business. Slowly chipping away at the whole, adding to my monthly spend bit by bit.</p>\n<h3>Audible</h3>\n<p>I listen to Audible almost every day. Twice a day during the workweek to and from work and then on the weekend if I find myself driving somewhere on my own. Recently I have also started listening in between other things, like when getting ready for work, or when washing dishes and so forth. I am on the Gold monthly subscription which is $14.95 per month. I have been listening prolifically of late and have upped the speed of my listening to 1.25x. This has led me to start thinking about upgrading my subscription. We will see.</p>\n<p>Regarding 1.25x speed - I find this speed does not distort the reading much and after a few minutes sounds just right. Switching back to 1x speed I hardly notice the difference.</p>\n<h3>IMDB</h3>\n<p>I love the IMDB app! It is on the home screen of my iPhone (as is Audible) and it sees a lot of usage. Despite this, there does not seem to be a pull into further Amazon activity like purchasing films. This is likely a barrier of delivery in that Amazon is not willing to sell via the App Store due to Apple's 30% cut and cannot link directly into their own store. And now, due to Amazon Prime Video being bundled with Prime, I suppose the push would only result in a one time purchase regardless.</p>\n<p>While on the topic, I have recently been dying to see links, similar to the \"Cast and Crew\" links for both:</p>\n<ul>\n<li>The network that runs the show such as Netflix, Amazon, HBO, Hulu etc to get a list of all the available shows.</li>\n<li>The production houses behind the films to get a list of the string of films they produce.</li>\n<li>Links to where to watch as I have recently struggled to find certain titles.</li>\n</ul>\n<h3>Goodreads</h3>\n<p>I recently started recording my reading activity in Goodreads. I really enjoying taking a look through my Audible history and seeing what I have listened to in the past. I wanted a similar experience for my reading. Now, Goodreads does not seem able to provide the same stats that Audible does, but it at least keeps a measure of progress. I imagine there will be a much tighter coupling in Goodreads between what I browse and what I might purchase in future.</p>\n<ul>\n<li>I do wish I could log a start and end time of my reading session.</li>\n<li>I do not yet see a space with stats? It would be great to see stats on daily pages, average speeds etc.</li>\n</ul>\n<h3>Amazon Prime Video</h3>\n<p>I am not a Prime subscriber, so to date, I have not watched any Amazon Prime Video content nor have I subscribed. However, I have installed the Apple TV app, and have browsed through it a few times. Recently, I have checked Amazon Prime Video on four separate occasions to see whether there was content available that I could not find on Netflix and iTunes. Had the films in question been available there, it is likely I would have signed up. As such, it is just a matter of time.</p>\n<p>For the record, the three films I was looking for were:</p>\n<ul>\n<li>Hacksaw Ridge</li>\n<li>Tinker, Tailor, Soldier, Spy</li>\n<li>Cabin in the Woods</li>\n<li>Escape from New York</li>\n</ul>\n<h3>Amazon</h3>\n<p>Up until a few weeks ago I had never bought anything on Amazon. However, as a result of some resolutions I made, I was looking to buy some programming books. I had made an attempt at reading them online, but while I read a lot online, long form content is not something I do well with on my phone. It almost all exclusively RSS feeds, blog posts and articles. Since these books were not available in Exclusive Books or on Takealot, I figured I should try Amazon. The waiting period has been about 2-3 weeks due to international shipping, but if you plan your purchasing ahead, it works out really well. So far I have bought 3x programming books, 3x cookbooks, a non-fiction book as well as a book for my father. The ease of this process and the way the Amazon app keeps you right up to date with the detailed progress of your order has made it a really good experience. One that I am already planning on repeating soon. Now, it is only a matter of time until that Amazon Prime subscription raises its head.</p>\n<p>To date: 1 delivery was late by about 2-3 days. The other was a week early!</p>\n<h3>Amazon Web Services</h3>\n<p>Lastly, and maybe not least, is Amazon Web Services. To date, I have never used Amazon Web Services in a development capacity. However, since using Azure at work, I have become a keen learner on the topic of cloud services for development and I imagine that, once again, it is only a matter of time until I dip my toe in the AWS waters to try it out.</p>\n<h3>Conclusion</h3>\n<p>Amazon, despite not having much of a direct presence in my life (until recently) is slowly, but surely carving out niches in my day-to-day usage as well as my month-to-month spend. No doubt this effect has been a lot more drastic for many years in markets such as the USA, UK and Europe, but it does bear thinking about. That the long, slow game, with the right products and strategy can shave off more and more of the share of wallet.</p>\n<h3>Audible Sidenote:</h3>\n<p>I love Audible, however the more I think about it, the Gold/Platinum structure of the membership levels seem positively outdated. Paying $14.95 a month for a single credit seems almost archaic in comparison to today's Netflix-style all you can eat subscriptions. I subscribe to the Netflix Dual Screen subscription as well as the Apple Music Family Plan and both of these offer unlimited use on multiple devices. It seems to strange to have a relatively \"expensive\" subscription which allows you only 1 credit and (what amounts to) 1 device.</p>\n<p>Granted, I still believe Audible is fair. Even listening as much as I do, one credit a month more or less works out perfectly. I do not find myself without credits, and more often than not, I find myself playing catch-up. The thing is, a lot of thought goes into that credit. I actually look forward to browsing, evaluating, planning and choosing my purchase this way. I tend to be calculated and measured in my selections.  Though I hate to say it, listening time definitely has a big impact on my choices. I seldom select a book under 15 hours of listening time. The reality is that, while there may be thousands of really good short books out there that I want to listen to, but with only 1 credit a month, it a waste to spend it on a short book. I think this is where, I wish Amazon had a little more play in their Audible offering since the only options are 12 or 24 titles on subscription. In the same breath, it is great that a book that is 80 hours can be had for the same amount as a book of 6 hours. But still, going short feels like missing out, and as a result, there are many quality titles that I likely will not listen to as a result. I get the feeling that had Amazon not had such a firm grip on the audiobook market, this \"restrictive\" approach to subscriptions may have proven to be a potential weak spot to be used as an attack mechanism. Alas, this does not seem to be the case. I have started to look around at alternatives to Audbile however, the search is early and my decisions are slow to build when it comes to purchasing.</p>\n<p>That being said, two of those alternatives, not surprisingly are from Amazon itself. Bundled Audible as a benefit of Amazon Prime as well as the Kindle Unlimited deal which bundles Kindle books along with their Audible companions with Whispersync. Both fall short (by design I am sure) since the selections in both are so limited. Having experienced, what I find to be, quite uninspired selections in the Audible 2 for 1 sales, I have no intention of limiting my choices to either 50 rotating titles from Audible or to the large, but still limited set of audio titles available on Kindle Unlimited. (On that note, I have never used a Kindle and when I have read books on my iPhone, that has been via iBooks)</p>\n<h3>Uber and UberEats:</h3>\n<p>I have had a similar feeling when it comes to Uber. For quite some time, Uber had been slowly increasing in usage in my own life. Then when UberEats launched, my girlfriend and I started using it now and then to order in. This also got me to thinking about how companies, by satisfying jobs to be done, slowly start shaving off pocket share in other markets and from competitors. Personally, I think it is a hugely effective approach for companies with the kind of scale that makes the approach viable.</p>","frontmatter":{"title":"Incremental Amazon."}}},"pageContext":{"slug":"/post023/"}}