{"data":{"markdownRemark":{"html":"<p>Over the past few months, I have significantly increased my level of physical activity. I originally started jogging on a regular basis to improve my overall fitness. Once that was underway, I started wakeskating again after many years. Having really gotten into that again I started pushing around on the skateboard once more. While I have been on the road, travelling, I took some surf lessons and have been surfing several times a week. I decided to bring my mountain bike along on the trip and gone riding a few times too. This then lead me to trying out a dirt jump bike which has become a new fascination for me. Last on the list is that I tried out climbing. Through all of this, I have also mostly been keeping up an almost daily yoga/stretching routine. (Unfortunately my regular exercise and running routine has falled away - mostly because, doing several of these activities a day means I am typically to tired or sapped of energy to do all of it. Also of note, is that my wakeskate season has come to an end).</p>\n<p>All of these activities involve, and require (to some extent) progression. </p>\n<p>For example: A pure athletic activity such as running hopefully involves you both feeling fitter and stronger overall as well as being able to regularly run further and/or faster. Both however, are markers of progression and in this case, the progression is effectively how your body acts and responds to the activity thereafter. There is also a mental component in that you gain confidence or a sense of well being that you are getting fitter/strong/healthier etc.</p>\n<p>Similarly, exercise hopefully involves being able to do more repetitions or at least recover quicker from sets of exercises. Again, this is primarily physical, with a mental component of confidence and an increasing sense of well being. </p>\n<p>When it comes to sports such as wakeskating or skateboarding, there is a physical component in terms of physical capability or fitness. Along with a greater sense of accomplishment since being able to run, in and of itself, is not particularly <em>difficult</em>. That is to say, everyone can run to a greater or lesser extent. It is not <em>hard</em> to run. It is however, significantly more difficult to just stand and ride comfortably on a skateboard or a wakeskate. Firstly, you need to find a centre of balance, then you need to learn how to turn, how to control your speed, how to go up or down an incline etc. What it comes down to, is skill. Effectively, a combination of both physical capability as well as control of another object separate to your body. This differentiates it from activities such as running, swimming, or yoga in that those activities are purely concerned with mastering and controlling your body. Boardsports are primarily about mastering both your body and the board. This fundamental difference is what exponentially opens up the possibilities available to a rider and elevates the importance of progression to a whole new level. </p>\n<p>As such, when taking part in something like skateboarding or wakeskating, fitness, speed etc only matter in so far as they influence your ability to do tricks. First comes the challenge of actually being able to even do a trick - the path towards landing one is typically one of continual trial and error. Once you have landed it, the path then move towards landing it again and again. Once you have achieved this a few times, the level moves once more towards landing it regularly or every time. Once that is locked in, the progression moves more towards the height or pop you can do the trick at, or the style you can add to it. Once that is on the go, you start looking at learning to do the trick up, down, over or onto something and so it continues in a neverending cycle and push to progress and improve. </p>\n<p>For me, this cycle has been natural ever since I first started skateboarding. Then, once I tried snowboarding, it was a similar story - different only in the fact that I live in a country that is mostly devoid of snow. As a result, the progression story there was intense during the times I was actually able to ride. Similarly, when I learned to wakeboard and then shortly thereafter switched to wakeskating, the pursuit of progression has always been there. </p>\n<p>Recently, I started mountain biking. Now, I have, on occassion, mountain biked in my life. Mostly because I enjoy riding bikes. And secondly, because, similar to running, I saw mountain biking as a way to improve my fitness - but in a far more enticing and enjoyable setting. Additionally, it activated the element of fun more than running in that you would often find sections on the trail where you would pick up speed, or you would like the way a corner banked or how some terrain flowed. It was however, never hooked into the progression side of things in the same way that any of the boardsports were... until now. </p>\n<p>Ever since going to The Bike Park in Constantia to ride my mountain bike. Something has activated in me that, had a particular line or path in that park not existed, I don't think would have happened. Granted, I saw kids jumping their bikes, and I saw their were jumps there, but similarly, I have seen BMXers jumping their bikes at skateparks most of my life, and it never activated my desire to learn to do it. It is weird, but sometimes one just does not associate oneself with an activity - I have ridden a BMX at a skatepark once or twice before many years ago, but it felt more like I was going to hurt myself than fun. If one is not comfortable riding a BMX, going up or down quarterpipes on them for a few minutes might not be a good idea! </p>\n<p>The thing is, at The Bike Park, I noticed one of the <em>easy</em> trails had two small tabletop jumps on them. Having seen someone jump them, I thought that they looked benign enough for me to attempt them without hurting myself. So I started giving them a go and steadily started pushing myself a little faster and harder each time until I got to the point that it <em>felt</em> as if I might just be getting a little bit of air. I think there was just something that felt right about the flow of the jumps and how much fun it was to be doing them over and over again that clicked something in me. I wanted more of this. </p>\n<p>It was at this point, that I noticed that the bike a kid that was effortlessly doing jumps on was not a mountain bike. Granted, I knew you got different types of bikes, but as I looked at it, I noticed his was different, so I asked him about it and he told me it was a dirt jump bike. Going home that evening, I realised that The Bike Park rented bicycles. The following day I did not feel like loading my bike, so I decided to see if I could try a bike more suited to the terrain. When I checked in, I said I wanted to rent a bike and the guy behind the counter asked me if I wanted to rent a mountain bike or a jump bike. I chose jump bike. </p>\n<p>So, a jump bike. Differences to a regular mountain bike? </p>\n<ul>\n<li>It has one brake. </li>\n<li>It has one gear. </li>\n<li>The seat is far lower. </li>\n<li>The frame is a little more angled. </li>\n<li>The handlebars are wider. </li>\n</ul>\n<p>Simpler, less moving parts, less to break. To my mind it also lighter, but I can't be sure...</p>\n<p>What a difference! Where my mountain bike previously felt sluggish in getting into the air, the jump bike just seemed to float easily up into it! Where there was kindling that was just starting to smoke at the edges, this suddenly caught alight! </p>\n<p>Needless to say, I have not taken my mountain bike back to The Bike Park. I have only been renting jump bikes there and been loving it! This entire piece is basically one long winded way of saying that I have been bitten by the dirt jump bug. I can now easily jump the original two jumps I was attempting and can now comfortable clear the two smaller rollers in the park. I have not quite figured out the big rollers yet, but my biggest achievement was yesterday when I managed to actually <em>clear</em> the first two jumps in the jump line! </p>\n<p>As ridiculous as it sounds, being a full grown man, I now feel like one of the <em>big kids</em> at the park that can ride the jump line. I have not quite figured it out yet since my turn into the berm is not where it should be and I cannot yet clear the last jump yet... but, slowly but surely we are getting there! </p>\n<p>The reason this is such a big deal for me is two fold: </p>\n<ol>\n<li>\n<p>The first day I was trying the jumps out, I saw a kid absolutely nail himself on the first jump. He basically crashed into the opposite side of the jump, went head over handlebars and hurt himself more than I would care to. Needless to say, that kind of put me off attempting that jump. Yesterday though, the park was packed, and my typical lines through the park were absolutely congested - my favourite jump line was overcrowded with children all over the place making it near impossible to get a clear run through and my other favourite line was covered in mud since the sprinkler on the corner was on all day making it rather unpleasant to ride through. This left me only one option when it came to jumping - to face up to the scary one! </p>\n</li>\n<li>\n<p>With certain sports, there are levels or tricks you associate with progression. In a way, people who do this thing or that thing are the <em>real</em> deal. For example, in skateboarding, if you can do a stylish kickflip, that means something. Similarly, if you can drop in on a mini-ramp and do a couple tricks turn to turn, it means something. Like, you can hold your own, you have done some time, you have learned some thing. Being able to hit those first two jumps on that line are like a miniature badge of honour becuase the small jump represents a split in those that ride at the park. Everyone can pretty much ride everywhere in the entire park, regardless of skill. But that particular jump, only people who can actually do a jump can hit it. So in my mind, Level 1 passed! </p>\n</li>\n</ol>\n<p>Now its all about making it look better and more natural! </p>","frontmatter":{"title":"Mind and Progression."}}},"pageContext":{"slug":"/post052/"}}