{"data":{"markdownRemark":{"html":"<p>I came across <a href=\"https://github.com/adam-golab/react-developer-roadmap\">Adam Golab's \"React Developer Roadmap\"</a> some time ago, however, having spent the past few weeks deep-diving into React, I wanted to take another look at it from the perspective of my own experience. </p>\n<h3>Learn the Basics.</h3>\n<p>Adam's roadmap rightfully starts out with the basics. Having a solid understanding of HTML, CSS and JavaScript on their own is essential. I would however, put an asterisk on the \"JS Basics\". While you certainly need to know the basics, the \"Basics\" listed cover enormous parts of the JavaScript landscape and factor into some of the React specific elements later in the roadmap.  </p>\n<h4>JavaScript.</h4>\n<p>As my career has progressed, JavaScript has been an area of increasing focus for me. Becoming better at JavaScript should be a continual and ongoing process. While I understand exactly what he means by \"basics\" the reality is that, the concepts listed there will come in handly at any and every level of your programming journey. No matter how long you have been at it, I am convinced that there will always be something new to learn or to review with JavaScript. Considering how widely used JavaScript is, investing into improving your core JavaScript skills is something to focus on in an ongoing capacity. </p>\n<h4>CSS.</h4>\n<p>When I first started learning HTML and CSS, CSS-based layouts, with floats were becoming the norm as people moved away from \"table-based\" layout. For many year, that was more or less the standard required. With the mergence of CSS3 and later CSS pre-processors and the ever increasing improtance of responsive layouts catering to mobile devices, the importance and challenge of CSS only increased. To my mind, CSS is at times easy to dismiss, but surprisingly hard to master. In my experience many developers will claim to \"know\" CSS and then proceed to write the most atrocious CSS possible. CSS is deceptively simple at a glance, but surprisingly tricky to get right. With the proliferation of CSS in JS in the React world, my feeling is that it is important to spend a solid amount of time coming to grips with CSS - especially now that there are at least 3 major layout approaches available: floats, flexbox and grid. </p>\n<h3>General Development Skills.</h3>\n<p>When it comes to the section \"General Development Skills\", my feeling is that there needs to be some separation here. I understand why they are listed together, but my feeling is that \"Data structures and algorithms\" and \"Design Patterns\" should be more closely linked to \"Intermediate to Advanced JavaScript\", creating another JavaScript-related area would emphasise just how important JavaScript is to the entire roadmap. Especially since, out of the major frameworks (React, Angular and Vue) React tends to be more JavaScript-y than the others. As you dig into React, you start to realise that a lot of what React does is a representation of these segments. </p>\n<p>As for \"Terminal usage\", my feeling is that, in a sense, this is a skill that comes hand-in-hand with working with Git, npm and the various CLIs that are popular in use these days. Anyone working with Git, npm and any form of CLI is going to become far more familiar with the terminal than they would otherwise. Granted, some people may prefer to use GUIs that lie on top of Git, either through the VS Code or IntelliJ (or similar) IDEs or some other means, but my advice to any developer would be to try and use the terminal as much as possible. </p>\n<h3>HTTP/HTTPS Protocols and API Clients.</h3>\n<p>Here is another interesting grouping of skills. My feeling here is that, in order to best learn HTTP/HTTPS and API clients is to work with API based projects and to build Postman or Insomnia collections. Nothing will teach you more about HTTP/HTTPS/APIs than working with either your own or other's APIs. Better yet, is to learn to build  your own APIs. Now, this might not really fit in nicely with a \"React\" roadmap per-se, but for me, the best thing I could do for my JavaScript skils was to learn Node.js and the many associated skills that go with it. </p>\n<h3>Full-stack...</h3>\n<p>Now, I will be the first to admit that the term \"full-stack\" is very much overused and misunderstood. In my experience, the larger and organisation or team gets, the smaller the focus of a particular developer will tend to become. By their very nature, small teams will benefit from less people doing more, whereas larger teams tend to gain efficiency by \"more\" people \"doing less\". Not less in terms of productivity, but less in terms of the overall scope of their work. The reason I bring up this topic however is because, by learning Node.js, and how to build APIs, you are essentially investing into improving your JavaScript skills in a big way. Maybe it comes down to how I tend to learn things, or my own peculiar understanding of my place in the \"tech stack\", but I really felt that my JavaScript knowledge improved immensely once I opened the Node.js door. Building APIs and learning about the nature of backend development just opened so many doors and lifted so many limitations on my programming mindset. For me, learning Node.js made me realise that I could be a \"real\" programmer and learn other languages that had previously seemed out of my reach. </p>\n<h3>Learn to search for solutions.</h3>\n<p>This is an interesting one. Searching for and finding solutions is definitely a skill. As is recognising when how to learn from or absorb and apply the solutions you find. Something I would add, or rather preface searching with, is two fold: </p>\n<ul>\n<li>Learn to <em>read</em> code. </li>\n<li>Learn to <em>read</em> error messages. </li>\n</ul>\n<p>I have emphasized the above because, I found that one of the greatest breakthroughs I had in my programming life was when I realised that I could improve my comprehension of code and of error messages. In a way, when you start out, error messages are a terrible thing, they feel like blame. They are red, and they are written in weird, hard to undersrand language and often leave you confused and demotivated. The thing is, the more you read code, and the more you, on a very basic level ask yourself questions about what you are reading, the more helpful they will become. </p>\n<p>Next time you read code or an error message, don't just <em>read</em> it. After each line, ask yourself, literally, what does it mean? </p>\n<p>Something immensely useful in this process is <a href=\"https://rubberduckdebugging.com/\">\"Rubber Duck Debugging (RDD)\"</a>. I won't repeat it here, but needless to say, going through this exercise will do wonders. </p>\n<p>Additionally, something very closely related to \"RDD\" is that whenever you run into a bug, especially one you don't quite understand try and reframe your investigation as follows: Somewhere in your code, something you are <em>assuming</em> is happening is not happening. As a result, you need to retrace your steps, in a very detailed way to discover exactly where your code is diverging from the path you think you set for it. </p>\n<p>To be continued... </p>","frontmatter":{"title":"React Developer Roadmap."}}},"pageContext":{"slug":"/til0129/"}}