{"data":{"markdownRemark":{"html":"<p>I have worked with various text editors throughout my career. I started out using Macromedia Dreamweaver, then moved onto Sublime Text and had a brief fling with Atomic before moving to Visual Studio Code. At work however, I often need to work in a Java IDE. For the first few years this meant NetBeans, however, over the past year it has meant IntelliJ IDEA. As such, I currently need to switch between VS Code and IntelliJ regularly. </p>\n<p>Additionally, I use both on Windows and Mac, so it makes for a somewhat confusing scenario when it comes to keyboard shortcuts and menu options. The context switching can be a little annoying. Especially if you have spent a few days in one, only to switch over to the other and find that you don't even know the basic shortcuts. </p>\n<p>In an attempt to improve my workflows on these editors, here are some IntelliJ tips: </p>\n<h4>Settings</h4>\n<p>The Settings panel in IntelliJ plays a big part in your development experience on IntelliJ, as such, it helps to get familiar with it. Hit <code>CMD + ,</code> to open the Settings panel. </p>\n<p>Here you can do things such as: </p>\n<ul>\n<li>Setup External Tools to run .bat files</li>\n<li>Setup (and learn) Live Templates (which are code snippets)</li>\n<li>Setup File Watchers to run <a href=\"https://prettier.io/\">Prettier</a> on save.</li>\n<li>Install and manage Plugins</li>\n</ul>\n<p>Unfortunately, <code>Simple React Snippets</code> from VS Code is not available on IntelliJ IDEA. I have seen that there are several React snippet plugins in addition to the built-in 'Live Templates'.</p>\n<p>Here are some useful shorcuts: </p>\n<ul>\n<li><code>Alt + Shift up/down</code> to move lines up or down.</li>\n<li><code>Double Shift</code> to search everywhere.</li>\n<li><code>Alt + Shift + F</code> to search in file path.</li>\n<li><code>CMD + F</code> to search within a file.</li>\n<li><code>Ctrl + CMD + G</code> to find all occurences</li>\n<li><code>Ctrl + V</code> to open the VCS/Git panel</li>\n<li>Emmets is built-in, so this is great! </li>\n</ul>\n<p>Something I have noticed with IntelliJ is that, while it is a lot more integrated in so many ways. It is just that little bit slower than VS Code for most operations. This makes sense, but it is noticeable. For example, using Prettier on save with VS Code is practically instant. One IntelliJ it takes just that heartbeat longer. At first, I was not sure if it was working or not. </p>\n<p>To be continued...</p>","frontmatter":{"title":"IntelliJ Tips."}}},"pageContext":{"slug":"/til0077/"}}