{"data":{"markdownRemark":{"html":"<p>Since watching the incredible <a href=\"https://www,nationalgeographic.com/films/free-solo\">Free Solo</a>, a documentary about climber Alex Honnold's free solo ascent of El Capitan in Yosemite. Something Alex said has stuck with me. He said something along the lines of whenever he is climbing, he is continually working to expand his comfort zone. </p>\n<p>This phrase has been bouncing through my mind ever since. </p>\n<p>Many of us are familiar with the term \"getting out of your comfort zone\". Especially after times of stagnation, or during times of change, people will often talk about getting out of their comfort zone. </p>\n<p>The typical use case of the phrase \"getting out of your comfort zone\" tends to indicate someone is going to go and try something new and at some point thereafter, will likely return or arc back to the existing comfort zone. </p>\n<p>I much prefer Alex's take on it, which I will take as: \"Continually working to expand your comfort zone\".</p>\n<h3>Intention.</h3>\n<p><em>Continually</em> indicates a mindset applied, held and refined over time. This is not an item on a list to tick-off on the weekend or on holiday and forget about. <em>Continually</em> indicates the persistent application of mindset towards activity regardless of situation and context.</p>\n<h3>Effort.</h3>\n<p><em>Working</em> indicates that this is not easy. That it is an activity that takes considerable time and effort and presents ongoing challenges to perform and to improve. In context of Alex's activities, it is training. Training for a battle between life and death in the most literal sense. </p>\n<h3>Expansion.</h3>\n<p><em>Expansion</em> is the part of the phrase I love. The words comfort zone indicate a delineated, fixed area. As we tend to get older, we increasingly trend toward the familiar and the known. Often, without realizing it, we adopt very fixed mindsets about what we can and cannot do, who we are and how we go about our lives. And we accept them. Expansion changes the perception of the term. Expansion is intentional, it is ongoing, it is bigger and indicates an ongoing level of change. It is dynamic. </p>\n<h3>Comfort Zone.</h3>\n<p>When we first start doing something, we often know next to nothing about it. We may have seen it, or decided we want to know more, but we can do very little. Every part of the activity or movement takes up a lot of effort and energy since we are confronting something new that our minds and bodies are not yet comfortable with or even capable of doing. Our mind is racing, our bodies tense and our hearts quite possibly in our throats or stomachs. As we improve, we grow accustomed, more relaxed and at ease while doing what we are doing. This is how we learn and progress. We become increasingly comfortable. It is a sign of progress. </p>\n<p>The thing is, when you first learn something, you have <em>no</em> comfort zone at all! Everything is new and uncomfortable. You have no safe space to retreat to. No gear at which you just cruise along. The comfort zone does not exist. Yet as soon as we become capable, as soon as we gain that ability, we have a safe space or comfort zone to retreat to. </p>\n<p>Over the years, I have become increasingly fond of the concept of <em>beginner's mind</em>. That despite experience and knowledge, you need to (at least try) look at something with new eyes. To see a situation as it is, without the baggage of preconceived ideas and notions. Along with this, I want to add the concept of \"expanding the comfort zone\". </p>\n<p>Expansion also represents departure. You are leaving your established zone, for new territory. If we take, for example, a conqueror in the past. The conqueror has to physically leave her existing territory for the new conquest. When she leaves, she cannot effectively claim that territory if she keeps retreating to what was previously held. Yes, she will need to govern or put structures in place to maintain what is there while she is away. </p>\n<p>The crux is that the new territory cannot be claimed via retreat. Yet this is often how we start to approach what we do. As soon as we get uncomfortable, or out of our depth, we make for retreat to the comfort zone. Yet this is not the way of progress. This is not how we learned in the first place. </p>\n<p>In the end, the thing to remember is that all this discomfort, will not always be outside of your zone. The more you get uncomfortable, the more you expand, the larger your surface area of 'comfort' will be. More importantly, the more comfortable you will be come with being uncomfortable in the first place. </p>","frontmatter":{"title":"Expanding Your Comfort Zone."}}},"pageContext":{"slug":"/til0104/"}}