{"data":{"markdownRemark":{"html":"<p>I have been listening to an intriguing podcast episode on <a href=\"https://www.vox.com/ezra-klein-show-podcast\">The Ezra Klein Show</a>, titled <a href=\"https://podcasts.apple.com/us/podcast/work-as-identity-burnout-as-lifestyle/id1081584611?i=1000436045971\">\"Work as identity, burnout as lifestyle\"</a>, that discussed the concept of \"workism\" and how, in the past several decades, work, career and the concept of perpetual burnout has become the centrepiece of modern life. My feelings on work and this concept of workism are for another post on another day. Something that did catch my ear was a discussion around how our personal and social lives have become <em>workified</em> as well. </p>\n<p>Social media has lead to what one could call \"life performance\". Social media has amplified this desire in people to <em>perform</em> in their downtime. It is no longer enough just to \"crush it\" at work. You need to also be \"crushing it\" in your personal and social life. In essence, you need to continually be performing. To portray to others this carefully modelled and constructed viewpoint of yourl life and what you are doing on a day to day basis. </p>\n<p>Personally, I do not subscrbe much to this notion in practice. I have barely touched Facebook in the past few years. I don't use Twitter in any meaningful way and I have only recently started toying with Instagram again in recent time. I do use Whatsapp on a daily basis, but I disagree that Whatsapp is social media. To me, Whatsapp is communication. Despite it's attempted elevation of the \"Status\" tab to try and social-ize it. </p>\n<p>Despite not subscribing to the notion, I have felt its presence and pressure in subtle ways. When I resigned from my job earlier this year, I decided to setup a personal newsletter to keep people I know informed of what I am up to. Within that letter, I mentioned I would try and <em>be better</em> at social media by posting more regular photos of my travel on Instagram. I have mostly failed at this, since I have not posted much at all. The reasons I have not posted however are in direct relation to this idea of performance. There has been this background thought that despite travelling to several places and doing some fun things, my ability to \"capture\" these moments in an Instagram-worthy photo or video has not been up to my perceived level of what I mostly see on Instagram (i.e. mostly professional photographers and vloggers doing incredible things in incredible places). At the same time, this feeling that, despite enjoying what I am doing, there is this vague, nagging feeling that I should be doing <em>more</em> exciting things than I am. That, in some ways, I am wasting a valuable opportunity by not pushing out spectacular, Instagram-worthy moments on a daily basis. </p>\n<p>As a result, the strange thing is that despite not, for the most part, taking part in this social media wheel, I am still bound by its impact. This sense that I need to improve my <em>social</em> performance so that it can be glamourous and fun to those sitting on their couches enjoying a few downtime moments as they scroll through their feeds. Granted, I don't have to do any of this. And it is clearly my personal ideas and internalisations that lead to this, but still, listening to the podcast above makes me realise that this is clearly not unique to me.</p>","frontmatter":{"title":"Life Performance."}}},"pageContext":{"slug":"/post049/"}}