{"data":{"markdownRemark":{"html":"<p>For the past few days, I have been in Langebaan, down on the west coast of South Africa. I came here to do a kiteboarding course. I have never kiteboarded before, and as a child, I seldom flew a kite. As such, this was altogether something new for me. While I have done several boardsports before, kiteboarding is more about the wind and the control of the kite, at least at first, than the board itself. </p>\n<p>I arrived in good wind conditions. And on my first day, had an enjoyable lesson. First off, my instructor, Martin, took me through some of the theory behind kitesurfing. For instance, wind conditions, wave or water conditions as well as elements that may affect this. In terms of wind, ideally, you want sidewind or crosswind conditions. Namely wind that blows along the beach or coastline. Off-shore wind, that is, wind blowing away from the shore is not good since there is no wind to bring you back to shore. On-shore, similarly is not good since there is no wind to take you away from the shore. </p>\n<p>In addition to the general wind direction, the quality of wind is important. The quality is basically whether the wind is consistent or gusty (blowing in bursts/inconsistent). Finally, and I think most obviously, the strength or speed of the wind is critical. Too little and you cannot kite, too strong and it will be unwise or downright dangerous. </p>\n<p>There are also numerous other factors to consider such as the water conditions, for example what currents, rips, tides and waves are doing as well as the situation on the shore itself. For example, are there people or obstacles around you, rocks, barriers or any other elements (both in or out of the water) that may affect you. </p>\n<p>Regardless, all of the above, primarily, is determined by the weather. When living in the city, the primary question in terms of the weather is: </p>\n<p>What is the temperature?\nWill it rain or not? </p>\n<p>Beyond that, it is not particularly important since the weather is primarily determining our choice of clothing and to some extent or activity. When doing something like kiteboarding, or surfing one is completely reliant on the weather and what it is doing. It brings your attention to, not only the weather, but the minute details of the weather and how it may change and evolve over the course of a day or week. In many ways, it first makes one more aware of weather and in turn, nature and I feel that over time, will bring you closer to a greater sense of care and involvement with that which will affect it over the longer term. </p>","frontmatter":{"title":"Weather."}}},"pageContext":{"slug":"/post036/"}}