{"data":{"markdownRemark":{"html":"<p>I have been a fan and user of the <a href=\"https://insomnia.rest/\">Insomnia REST Client</a> for quite some time. Initially, I was a regular Postman user, but when Postman switched from a Chrome browser extension to a standalone app, their proxy user authentication and support was not great. As such, I could not get Postman to work through the corporate proxy at work. </p>\n<p>However, one door closing often leads to another door opening and I am so glad it did. Insomnia is great! I love the UI, I love the name (Finally, a REST client you'll love) and I love that Insomnia has actually taught me a few things I did not know! </p>\n<h4>cURL</h4>\n<p>I'll admint, cURL was a little obscure to me. However, ever since discovering that Insomnia allows you to quickly and easily re-create API calls via cURL by pasting the cURL into the 'address bar', I have become a regular user! (Special tip: When viewing the Resquest pane in your dev tools, right click on the request you are interesting and then select <code>Copy as cURL</code> and past it into the Insomnia address bar.)</p>\n<p>Combine that with my increased usage of Node.js which has me spending more time in the terminal than ever before and I have started to use cURL to test basic GET commands instead of Insomnia! </p>\n<p><em>Note</em>: This only for basic GET commands, for more complex calls, I still find Insomnia far better</p>\n<h4>JSON Path</h4>\n<p>Currently, I am working on a project which has some APIs which returns quite a lot of data. When investigating possible bugs and root causes, I work in Insomnia or transfer browser calls to Insomnia for the following reasons: </p>\n<ol>\n<li>Seeing both request and response in one pane far surpasses having to switch between panes in the browser. </li>\n<li>Being able to quickly change values and re-submit far surpasses having to redo actions in the browser. </li>\n<li>The UI far surpasses what appears in the browser. </li>\n<li>Being able to screenshot or share cURLs is far easier in Insomnia than it is from the browser.</li>\n</ol>\n<p>And now there is a 5th point to that list: <a href=\"https://goessner.net/articles/JsonPath/\">JSON Path</a>! </p>\n<p>While, somewhat frustratedly, scrolling up and down through the response pane and minimising/maximising objects and arrays to get a better sense of the data, I noticed the small input bar at the bottom right of the screen. When clicking the little ? icon at the end I discovered this: </p>\n<p><code>Use JSON Path to filter the response body. Here are some examples you might use on a book store API.</code></p>\n<ul>\n<li><code>$.store.books[*].title</code></li>\n<li><code>$.store.books[?(@.price &#x3C; 10)].title</code></li>\n<li><code>$.store.books[-1:]</code></li>\n<li><code>$.store.books.length</code></li>\n</ul>\n<p>This was <em>just</em> what I was looking for! Using JSON Path makes it so much easier to see get a sense of the overall shape or quality of the data you are getting back than scanning it manually! </p>\n<p>It strikes me, that, often times, the best software or technology, not only find a useful place in your workflow, but also teaches or reveals things to you that you were not aware of before. And especially, teaches you things that are really, incredibly useful! </p>","frontmatter":{"title":"JSON Path."}}},"pageContext":{"slug":"/til0089/"}}