{"data":{"markdownRemark":{"html":"<p>Microsoft continues to release what looks to be <a href=\"https://www.microsoft.com/en-us/surface/devices/surface-laptop/overview\">impressive hardware</a> in an attempt to pick-up on the high-end customers that do not use a Mac. As a long-time Windows user, the effort however seems to be on the wrong vector.</p>\n<p>The reason I switched was not based on hardware, but software. I got tired of Windows and its lack of speed. What initially struck me when using a Mac was how quickly and smoothly it worked. That being said, the \"locked-down\" Windows 10S announcement is more interesting.</p>\n<p>Locking the laptop down to applications only available on the Windows Store seems to be akin to the iOS App Store. The more direct comparison would be to the Mac App Store. The Mac App Store has struggled to gain traction with notable developers and in many ways the Mac App Store has been a failure. Primarily because there are marquee applications not available in that store. This lack of marquee applications will certainly be the case with Windows Store. Why then would Microsoft pursue this avenue when their hardware efforts seem focused on high-end customers?</p>\n<ul>\n<li>Are they going after the education market increasingly dominated by Chromebooks?</li>\n<li>Do they want to exert the level of control (and extract the % of sales) that Apple does on iOS in the App Store?</li>\n</ul>\n<p>Curiously, both of those points seem to contradict the high-end approach Microsoft seems to be taking.</p>\n<p>Apple's control and lack of sustainable business models on the App Store have in particular led to the handicapping of the iPad and have irked developers. The Mac App Store has achieved similar results with developers expressly not putting their application in the store. These developers themselves tend to be high-end customers. Locking down a laptop to a be Windows Store only is in opposition to the needs of the high-end market, who will definitely be using and require applications that are not in the Windows Store.</p>\n<p>The limitations Microsoft is placing on the customer in terms of forcing them to use Edge and Bing in this instance also seem to be user hostile. Many Windows users use Windows because it is flexible and more \"open\" than Apple.</p>\n<p>The education market is decidedly not high-end. So which customer is Microsoft trying to serve?</p>\n<p>All things considered, it is good that Microsoft is making the effort. For many years Microsoft stagnated and they are beginning to regain relevance with customers.</p>\n<p>On a product-related note, the fabric around the keyboard seems like it might be nice to the touch. Certainly an interesting choice - impractical as it seems.</p>\n<p>And what of that video? Impressive as they are, how many more of these \"construction in motion\" videos with Holi-Festival-like colour explosions will we see?</p>\n<p>[Video link removed as it is no longer available]</p>\n<p><em>Note: This post is a transplant. First published on 2017/05/05. It was written by myself on another site and has been moved.</em></p>","frontmatter":{"title":"Surface Laptop."}}},"pageContext":{"slug":"/post002/"}}