{"data":{"markdownRemark":{"html":"<p>\"Day One\" is officially done. I am mostly happy with how the day went, however, there are a few lessons I have learned: </p>\n<h3>Keep Your Laptop powered Up! (And other devices)</h3>\n<p>You never know when load shedding or a busted power station will hit! (This is South Africa after all #eskom)</p>\n<h3>Keep it Lean.</h3>\n<p>Keep your notes from The Lean Startup close, be mindful of activities that are valuable versus activities that are not. You need to figure out the right thing to build. That is, the thing customers want will pay for as quickly as possible. </p>\n<h3>#Agile</h3>\n<p>Keep things #Agile. </p>\n<p>The number of tasks one needs to do as a maker are many. Listing them out in a backlog can start to feel a little intimidating when you list them all out. </p>\n<p>In order to manage this, estimate not only in effort but also in energy! </p>\n<h3>Estimate in Effort &#x26; Energy.</h3>\n<p>This will help you when deciding on what to work on when and at what stage of the day. This will be a marathon and not a sprint and managing energy is likely just as, if not more important than managing time.</p>\n<p>I have set my estimates according to the following criteria: </p>\n<h4>Effort.</h4>\n<ul>\n<li>1 = 1 - 2 hours</li>\n<li>3 = 3 - 5 hours</li>\n<li>5 = 6 - 8 hours (Need to break task down at this point)</li>\n<li>8 = 9 - 16 hours (You definitely need to break the task down now)</li>\n<li>13 = 17 - 32 hours (You're kidding right...)</li>\n</ul>\n<h4>Energy.</h4>\n<p>H = High: The best time of the day, engaged and ready to go! (Reserved for most challenging tasks)\nM = Medium: You are cruising along.\nL = Low: You are tired, either physically of mentally.</p>\n<h4>Make Friends With Notebooks, Whiteboards and Stickies.</h4>\n<p>One should not be chained to the laptop or a digital device in order to do meaningful work. True, the product is digital, but the inspiration and concept exploration can be analog. </p>\n<p>Paper and whiteboard work can be immensely valuable. On the plus side, it can easily be thrown away, re-organised, re-arranged or redone because it is <em>quick and dirty</em>. Far better to spend less time and cover more conceptual ground in the work earlier than to invest a lot of time into code or high fidelity designs only to run into corners and dead-ends that could have been uncovered just as easily through low fidelity work.</p>\n<p>As such, I bought myself the following:  </p>\n<ul>\n<li>A whiteboard (+-1x0.5m) and some markers. (A local brand called Parrot from Game)</li>\n<li>A pile of sticky notes (Also from Game)</li>\n<li>A pile of notebooks (Technically, I did not buy all of these, many of them are repurposed from previous notes and have been gifts/handouts from various times.)</li>\n</ul>\n<h4>Whiteboard.</h4>\n<p>The whiteboard is to draw on, stick things onto and use as needed. It is immensely satisfying to be able to quickly write up and rub out ideas and thoughts. (Take photos if to refer back to later)</p>\n<h4>Sticky Notes.</h4>\n<p>The pile of sticky notes is to write out, add estimates, ideas, thoughts etc and to re-arrange as needed. The great thing about these is you can start to group, organise, annotate and general figure out in your head what can go there. </p>\n<p>The great thing is, once they are done, you can take them down and pile them up if you need to refer to them later. </p>\n<h4>Notebooks.</h4>\n<p>The pile of notebookes is to write, write, write. </p>\n<p>Use them for whatever you need! Sketches for screens, logos, thoughts, copy and anything else that might come up. You do not need to stay glued to a screen or another app to do these things. And better yet, you can change-up your scenery. You can write in notebooks from anywhere. (Yes, you can take your laptop anywhere, but its heavier and feels more <em>work-like</em>)</p>\n<p>Currently, the notebooks include, but are not limited to: </p>\n<ul>\n<li>Current Project Notebook</li>\n<li>Morning Journal/Notebook</li>\n<li>Priority &#x26; Todo Notebook</li>\n<li>Reading Notes Notebook</li>\n</ul>","frontmatter":{"title":"Day One: Lighthearted Lessons."}}},"pageContext":{"slug":"/til0099/"}}