{"data":{"markdownRemark":{"html":"<p>As far as I can remember, each time I have used the npm module <a href=\"https://www.npmjs.com/package/bcrypt\">bcrypt</a> I have run into installation/running errors. Typically these are variations of the following: </p>\n<ul>\n<li><a href=\"https://github.com/kelektiv/node.bcrypt.js/issues/16\">Here</a></li>\n<li><a href=\"https://github.com/kelektiv/node.bcrypt.js/issues/678\">Here</a></li>\n</ul>\n<p>The accepted 'solution' seems to be that, should you run into these issues, you need to use up/downgraded versions of Node.js and/or of bcrypt or some combination of both. In the past, I have resolved this by downgrading bcrypt to v1.0.3, however, considering the version is now up to 3.0.3, I don't feel this is a 'solution' since it requires running older version of Node.js. If that does not solve the problem, one may need to rebuild bcrypt accordingly, by running: <code>npm rebuild bcrypt --build-from-source</code>. This however, in my case, also leads to further errors with the node-pre-gyp, which, when you go down the rabbit hole, eventually leads you to having to install all kinds of other dependencies including X Code Command Line Tools!?  </p>\n<p>Regardless, this is all a bit much for me. The dependency chain is too deep and fickle/fragile in my experience. As a result, I looked around and found that there is a Javascript-based version of bcrypt called <a href=\"https://www.npmjs.com/package/bcryptjs\">bcryptjs</a>. It mimics the API of bcrypt, as such, you can keep your bcrypt code the same if you import the module as follows: </p>\n<p><code>import * as bcrypt from 'bcryptjs';</code></p>\n<p>While, it should be noted that bcryptjs is 30% slower than bcrypt. 30% sounds like a lot, but I did not notice any meaningful slowness, if anything, it was faster because bcryptjs actually worked! That being considered, I would rather have a smoother development experience with <em>slightly</em> slower processing, than a completely confusing and befuddling developer experience. </p>\n<p>Through this process, I have also come to realise that Node.js has its own <a href=\"https://nodejs.org/api/crypto.html\">crypto</a> module which I will need to explore in future. </p>","frontmatter":{"title":"Bcrypt."}}},"pageContext":{"slug":"/til0057/"}}