{"data":{"markdownRemark":{"html":"<p>In my <a href=\"/til0067/\">previous post</a>, I said that \"I feel that algorithms and mathematical-type programming is something I need to improve on\". That was an understatement. I am terrible at them! </p>\n<p>As evidenced by my struggle with the <a href=\"https://github.com/nicholaspretorius/dcp/blob/master/solutions/dcp02.test.js\">2nd problem</a>! (And these are the <em>easy</em> ones!) </p>\n<p>Never has the term <em>impostor syndrome</em> felt so appropriate... :(</p>\n<h4>Lessons Learned</h4>\n<p>But who wants to read that sob story! Rather, let's take a look at what I learned!</p>\n<ol>\n<li>I wrote my tests first! Before I attempted solving the problem I wrote tests for the solution, so at least I could prove it worked or not!</li>\n<li>I got ahead of myself, I started thinking about what new ES6 feature I would use before effectively thinking through a solution. </li>\n<li>Start with the most obvious part of the problem - even if it is not the solution! (As with much development, start small and get the obvious results first before leaping to solutions... move in increments)</li>\n</ol>\n<p>For example: The most obvious thing to do is to forget about excluding the one number in the multiplication and make sure you first get the products of all the numbers multiplied. From there, it is then far easier to focus on <em>excluding</em> the one number from that point than it is to get tangled up in a misguided attempt at solution.</p>\n<ol start=\"4\">\n<li>Drawing out a sketch of the idea for your solution helps you have a basis from which to work from and to which to go back to when you get caught up in going wrong. </li>\n<li>Get beyond embarrassment - I am embarrased that I struggled with this, the solution was so obvious once I got it (I am not sure if it was a <em>good</em> one - but it passed the tests.)</li>\n</ol>\n<h4>Possible Improvements</h4>\n<p>Now that I found a solution, it is time to consider some improvements: </p>\n<ol>\n<li>I could use .reduce for the multiply function rather than a loop</li>\n<li>With .reduce, I could combine move that functionality into one function rather than\ntwo. </li>\n<li>I could look into using .map instead of a for loop. </li>\n</ol>\n<p>On the bright side, I found a solution just as I was thinking I should step away and take a breather. Additionally, I discovered <a href=\"https://github.com/jest-community/jest-extended\">jest-extended</a> which is a collection of useful and convenient assertions. Specifically I used .toIncludeSameMembers to ensure the outputted array matched the expectation. </p>\n<p>That being said, I took a read through problem #3 and I feel more impostor-like than ever! I don't even know what a binary tree is... </p>","frontmatter":{"title":"Mo' Coding Problems."}}},"pageContext":{"slug":"/til0068/"}}