{"data":{"markdownRemark":{"html":"<p>Continuing from the beginning of my foray into the guitar yesterday, I have now learned a few more things about my chosen instrument: </p>\n<ul>\n<li>\n<p>The guitar I am using is in fact not an acoustic, but is a classical guitar. It has a different shape, wider neck and the headstock is different to a typical acoustic. It also has no points for a strap and is meant to be played sitting down with quite a <em>high</em> playing position and angle. </p>\n</li>\n<li>\n<p>What I do have though, is steel strings on a classical guitar as opposed to the typical nylon strings found on a classical. </p>\n</li>\n<li>\n<p>Since I was missing a string (High E or 1st string), I bought new ones. In researching what was what in that department, I discovered that you get different <em>guages</em> or thicknesses of strings. Also, you get different types of string with slightly different materials. What I ended up buying was Ernie Ball Earthwood \"Light\" Guage strings. </p>\n</li>\n<li>\n<p>As far as the strings themselves go, you have EADGBE (Eddie Ate Dynamite Good Bye Eddie). Confusingly, the High E, is in fact known as the 1st string and the Low E is the 6th string. </p>\n</li>\n<li>\n<p>Regarding tuning, I also learned, besides using a tuner, you can also tune by ear, which mostly, involves tuning holding the string in question on the 5th fret and playing the subsequent string open. With the exception of G, which you hold on the 4th fret when playing on B. </p>\n</li>\n<li>\n<p>As for some other tidbits, I learned about the parts of the guitar, that is, the body, the sound hole, the bridge (at which the strings are based and held by the ball-ends), the neck, on which is the fingerboard, on which there are fretwires and frets. On the 5th, 7th, 9th and 12th frets are dots as indicators to let you know where you are on the fingerboard with the board ending in the nut. After which you have the headstock which holds the tuning pegs and which fastens the ends of the strings. </p>\n</li>\n</ul>\n<p>All of this is super obvious and basic, but most of it was new to me! On to the next!</p>","frontmatter":{"title":"Guitar Follow-Up."}}},"pageContext":{"slug":"/post037/"}}