{"data":{"markdownRemark":{"html":"<p>Considering online security is becoming increasingly important, and the fact that I am currently on a trip, on which I will often be using wifi, I decided to update my security practices in two ways. </p>\n<p>Firstly, by using a VPN service.\nSecondly, by using a password manager service. </p>\n<h3>Nord VPN.</h3>\n<p>I decided on using <a href=\"https://nordvpn.com\">Nord VPN</a>. Their reviews were positive, the pricing was good and considering they store very little data about you and your usage, I was happy. They also happened to be running a sale at the time I was researching, so I went with it. So far, using the app and service has been straight-forward. Sign up and setup was easy and thus far I have no complaints. Granted, I have not been online much the past week, so I am sure my opinion will evolve over time. </p>\n<h4>Special mention: IVPN.</h4>\n<p>I also considered <a href=\"https://www.ivpn.net\">IVPN</a>. Primarily because Khoi Vinh, whose blog I follow and enjoy, uses it and wrote about his experience <a href=\"https://www.subtraction.com/2019/03/11/vpns-for-all/\">here</a>. IVPN is also the chosen VPN for <a href=\"https://thewirecutter.com/reviews/best-vpn-service/\">The Wirecutter</a>. </p>\n<h3>1 Password.</h3>\n<p>I decided to use 1Password as a password manager. Primarily, over the years, I have heard them be well recommended by various blogs I follow and as such, was inclined to make use of them. 1Password is a paid service. </p>\n<p>Again, while I am still new to this service, my first thought was that this was going to be a real chore to setup. Not because of the app or service itself, but because recalling all the services one uses regularly, as well as what their URLs, usernames and passwords are is chore. It is so easy to forget just how many online logins we have. Practically every site you use requires a username and password from you and all of these need to be strong and somehow memorable. </p>\n<p>Honestly, I could not do it anymore. Having to remember and manage all those passwords was becoming something I know I have to do appropriately, but was struggling to keep up with. Hence me starting to use a service like this. </p>\n<p>As such, I set aside some time to get it setup. The process was easy enough, and now that I have setup the majority of my accounts, I feel a lot better about my password situation. There are sure to be some more that I need to add. </p>\n<p>Some nice touches in the app are that it shows your which of your passwords are weak, and where you have repeated passwords before. This makes it easy to manage and update these where appropriate. </p>\n<p>I still have some work to do in terms of updating some of my accounts, but now that I have a base to work from, I am actually feeling quite positive about the prospect rather than dreading it! </p>","frontmatter":{"title":"Security Online."}}},"pageContext":{"slug":"/post034/"}}