{"data":{"markdownRemark":{"html":"<p>Today I took the leap and signed-up to the <a href=\"https://www.udacity.com/course/react-nanodegree--nd019\">React Nanodegree</a> course on <a href=\"https://www.udacity.com/\">Udacity</a>. </p>\n<p>At the same time I pledged to take up the <code>#30DaysOfUdacity</code> challenge which has me committing to do at least 30 minutes of Udacity course work a day for the following 30 days. My journey into React has been brewing for some time now and today marks a significant stepping stone on that journey. </p>\n<h3>React so far...</h3>\n<p>While I have significant experience in web development broadly, and AngularJs in more recent times, I have, as of writing this, no production React experience. This means that while I have confidence I will, in time, learn React and become increasingly comfortable and fluent in it, I do have a desire to <em>accelerate</em> my path towards confident competence. As a result, to date, I have been working through a few courses to help me along my way. </p>\n<p>Namely, I have completed the <a href=\"https://codewithmosh.com/p/mastering-react\">\"Mastering React\"</a> course by Mosh Hamedani (highly recommended as an introduction to the basics - without Redux). From there, I am currently busy with two Udemy courses by Stephen Grider: </p>\n<ul>\n<li><a href=\"https://www.udemy.com/course/react-redux/\">\"Modern React with Redux (2019 Update)\"</a></li>\n<li><a href=\"https://www.udemy.com/course/the-complete-react-native-and-redux-course/\">\"The Complete React Native + Hooks Course (2019 Edition)\"</a></li>\n</ul>\n<p>Both have so far been very good. From those course alone, I have fairly rapidly built up a base-level competence in understanding and working with React. The thing that is missing in the above courses however is feedback. Particularly, expert feedback. This is precisely what Udacity offers. </p>\n<h3>Why Udacity?</h3>\n<p>Despite similar names, Udemy and Udacity represent approaches on opposite sides of the \"online learning\" spectrum: </p>\n<h4>Udemy.</h4>\n<p>Offers anything and everything taught by anyone at very low prices. If there is something you want to learn, chances are Udemy has course by someone available. The trade-off however is that the quality and satisfaction that results may vary wildly. In the end though, chances are you may not worry too much about it one way or the other because the course are low-price. (At least during their <em>very</em> frequent sales). The trick with Udemy is to find instructors you like and stick them. In my case, these have been: </p>\n<ul>\n<li><a href=\"https://www.udemy.com/user/sgslo/?key=taught_courses&#x26;taught_courses=1\">Stephen Grider</a> (in-depth, mostly React and related ecosystems).</li>\n<li><a href=\"https://www.udemy.com/user/maximilian-schwarzmuller/\">Maximillian Schwarzmuller</a> (slightly less depth, but wider variety of topics covering Angular, Vue and React amongst others).</li>\n<li><a href=\"https://www.udemy.com/user/reed-barger/\">Reed Barger</a> for a variety of \"trendy tech\" code-alongs. </li>\n</ul>\n<p>In short, Udemy offers you all you could learn, and with the right instructors, very good value for money. The thing is, you are left pretty much to your own devices. As a result, you will learn quickly, and depending on what you do with the knowledge, you may or may not end up actually using what you have learnt. Even more so, you don't have much support or feedback on what you do. So, while the content you are taught is of a good quality, where that translates into any quality on your side is debateable. This is precisely where Udacity steps in... </p>\n<h4>Udacity.</h4>\n<p>Udacity is the Apple to Udemy's Android. Udacity is much higher-end. The courses are expensive. And while I cannot, yet comment on the quality, the difference they offer is in personalised service. Content and course quality aside, what Udacity offers is much more \"holistic\" approach to your learning experience with a heavy emphasis on: </p>\n<ul>\n<li>1:1 Mentorship - courses offer once weekly Zoom calls with course mentors. </li>\n<li>Feedback - this involves code and project reviews along with reviews covering your resume, cover letters, GitHub profile and LinkedIn profile amongst others. </li>\n<li>Career Counselling - as part of your course you get one meeting with a career counsellor in which you get feedback on your overall career situation. </li>\n<li>Career Services - following your graduation, you have available to you a variety of \"Career Services\" which include things like access to a pool or Udacity-specific recruiters and companies looking to hire Udacity graduates. </li>\n</ul>\n<p>Now, all of this is well and good. The thing that interested me was the Feedback and to a slightly lesser extent, the Mentorship. </p>\n<h4>Feedback.</h4>\n<p>Honest, constructive and useful feedback is critical to the learning experience and to getting better. If you do not get feedback on your work, how do you know whether what you are doing is up to scratch? </p>\n<p>The fact is, you don't. The consequence of this is that, while I have many years experience working in my field, a question I often have is just how do I stack up against those working in places like Silicon Valley? </p>\n<p>The reality is that, for better or worse, Silicon Valley is the hub of the technology world. The expectation is that the level of quality and performance in programming is of the highest level and regardless of whether that is true or not (I know there are high/higher quality developers the world over), the question of just how one's skills compare lingers. As a result, since Udacity is US-based, with ties to the Googles and Ubers of the world, my feeling was that enrolling for a course at Udacity, would, if nothing else, give me feedback through \"Silicon Valley\" eyes. As such, while moving to Silicon Valley would be quite a costly experience, maybe getting code-reviewed and mentored by those in Silicon Valley might provide a light facsimile of the experience. </p>","frontmatter":{"title":"Udacity React Nanodegree."}}},"pageContext":{"slug":"/til0118/"}}