{"data":{"markdownRemark":{"html":"<p><em>Note: This post is a transplant. First published on 2017/06/06. It was written by myself on another site and has been moved.</em></p>\n<ul>\n<li>Apple TV is the neglected child in the family.</li>\n<li>Anyone else think that: Apple TV + casual gamers + Apple game controller + in-app-purchase = taking candy crush from a baby?</li>\n<li>Lazy people don't yet have a reason to buy Apple Watch, but the watch continues to be attractive to fit or want-to-be-fit people. (Tim Cook and Craig Federighi are fit people. Did you see them running on and off stage?)</li>\n<li>Kids might also want those Pixar Apple Watch faces. (Adults may even want them)\n*'Do Not Disturb While Driving' is thoughtful and might save lives. (If it is the only idea to come out of Project Titan and least its a good one!)</li>\n<li>Did Apple just become a bank with peer-to-peer payments?</li>\n<li>Hopefully \"Pro\" users will stop complaining. For now. (Audiophiles will start complaining soon)</li>\n<li>iPad Pro will probably benefit slightly from massive hardware and software improvements. On the other hand, slight business model improvements in the App Store will probably benefit iPad massively. Go figure. (Where are you trial and upgrade pricing?)</li>\n<li>App Store 2.0. (Phill Schiller walked off stage before announcing trial and upgrade pricing)</li>\n<li>WWDC 2018 for the end of iTunes? (And the beginning of Apple Music, Apple Video, Apple Podcasts, Apple App Store, Apple Audio + iBooks, Apple Whatever-else-is-in-iTunes.)</li>\n<li>Why is QR Code scanning only available in China?</li>\n<li>Mall and Airport maps seems like a good idea for Apple Maps. (No matter where I am in the world, I will get lost in a mall. Does Google Maps have this?)</li>\n<li>3 Thoughts about the ongoing \"services narrative\":</li>\n<li>When do the data storage tiers for iCloud get better?</li>\n<li>When does iCloud TimeMachine get introduced?</li>\n<li>Not to say these are not hard problems to solve, but surely this is relatively low-hanging fruit as far as services go?</li>\n<li>As great as the Wingnut AR demo was... When do we see a demo of the Star Wars chess game (<a href=\"https://scifi.stackexchange.com/questions/35594/does-the-game-that-chewie-plays-with-r2-d2-have-a-name\">Dejarik</a>) from the Millenium Falcon?</li>\n<li>English-speaking people continue to hate on Siri. (Except of course if you don't speak the four or two languages supported by Google or Alexa)</li>\n<li>Alexa has a bazillion skills. Siri only has a few. But, a bazillion skills in a language you don't speak don't help in a country that doesn't sell the Echo.</li>\n<li>Lots of bonus points for diversity with the first mother/child-to-be-presenter I have seen at a big technology event.</li>\n<li>Will the Monument Valley 2 mention drive more sales than the Monument Valley House of Cards mention?</li>\n<li>Siri Hi-Fi, sorry, HomePod will please 0 audiophiles and 0 price conscious buyers. I imagine several other people will be pleased and buy one (or more).</li>\n<li>People already calling Siri out for its minor role in the HomePod story. And yes, HomePod will probably be a huge flop. But:</li>\n<li>Better sound quality.</li>\n<li>21 languages/36 country localisations.</li>\n<li>More countries with Apple Stores. (Yes, actual stores that sell products. With Geniuses and Apple Today)</li>\n<li>More announcements and integrations by the end of the year (Here's looking at you, Apple TV Elephant in the room).</li>\n<li>As for those Wynn/Echo sales... if you are premium hotel, do you rather want a cheap Echo in your room with dubious privacy records or an expensive, privacy conscious speaker in your room?</li>\n<li>Maybe, just maybe HomePod makes it for the holiday quarter?</li>\n<li>iPhone integration.</li>\n<li>As for having only one HomePod... Nano, Mini, Plus. I am sure they are sitting somewhere in Jony's lab right now...</li>\n<li>Doesn't look too bad now does it?</li>\n</ul>\n<p>I need machine learning to help remember any more of it. Anyone count how many times they said \"machine learning\"?</p>","frontmatter":{"title":"WWDC 2017 Review."}}},"pageContext":{"slug":"/post012/"}}