{"data":{"markdownRemark":{"html":"<p><em>Note: This post is a transplant. First published on 2017/05/15. It was written by myself on another site and has been moved.</em></p>\n<p>Farhad Manjoo has an interesting piece at The New York Times considering which of the <a href=\"https://www.nytimes.com/interactive/2017/05/10/technology/Ranking-Apple-Amazon-Facebook-Microsoft-Google.html\">top 5 technology companies and their services one might drop</a>?</p>\n<p>I voted as follows:</p>\n<ol>\n<li>Amazon</li>\n<li>Facebook</li>\n<li>Google</li>\n<li>Microsoft</li>\n<li>Apple</li>\n</ol>\n<h3>Amazon</h3>\n<p>I debated which one would go first between Amazon and Facebook, the fact is, Amazon barely has a presence in my home country. Strange as it might seem, I have not bought much through Amazon over the years (I still shop the traditional way). I am a huge Audible fan and listen to it most days. As a movie buff, I am also regularly browsing IMDB. The fact that I pay for Audible gave me pause here, as it means enough to me that I am willing to pay for it. I do not pay directly for any of Facebook's offerings. Regardless, Amazon goes first.</p>\n<h3>Facebook</h3>\n<p>Facebook is next. I do not use Facebook or Messenger much having turned off all their notifications and banished the apps to a folder on the second-screen of my iPhone. Out of sight, out of mind. I use Instagram fairly regularly and enjoy it, however, I would not miss it that much if it were gone. (My girlfriend on the other hand practically lives in it. While I do not use it nearly as much, Instagram has a notable presence in my life.) The other notable app in Facebook's collection is WhatsApp. I (and most people I know) use it daily. Considering most of the people I know are split fairly evenly between using iPhones and Android phones, Messages is not a true replacement. Where I am from, WhatsApp is the app everyone uses to communicate. My family uses it, my friends use it and colleagues from work use it. Coming back to the tussle with Audible - while I do not pay for WhatsApp, it certainly saves money on SMS fees!</p>\n<h3>Google</h3>\n<p>Originally I had Google pegged at 4th. However, one lens from which I need to view this question is to consider the role work plays in my choice. The applications we use at work are dominated by Microsoft. All communications are done through Outlook or Skype. Pretty much everything is some combination of Outlook, Word, Excel, PowerPoint, Project and Visio. From a development perspective, I would not shed a single tear for Microsoft if it did not play a role in my day to day. I far prefer MacOS for development, but, I earn a living on Microsoft. Despite my preference for Google, Google leaves the building first.</p>\n<p>On that note, it is worth elaborating on which Google apps I find most useful. Google Maps is the first. Without a doubt my go to app for travelling. Myself and my girlfriend use it endlessly while travelling and in recent time I have started using the Google Trips app when going to new, unknown cities. Google Maps offline features are a fantastic way to save on data fees. I have used Apple Maps on the odd occasion, but none the less it is the odd occasion. When I have used it, it has not proved to be much help. It may very well be improving in many ways, but in my experience it is still lacking. I am however, willing to try. (On the travel note - Google Flights has also proved to be useful entry point to searching for flights and comparing prices in recent time)</p>\n<p>YouTube is great! I like YouTube and I think it occupies similar territory to what Facebook videos do for most people. I use it to fill small spaces in between other things. It almost goes without saying that I use GMail on a daily basis. The thing is, I am pretty ambivalent about email. It is no doubt essential, however, if I had to jettison the service, so be it. Lastly, Chrome. I use it every day and prefer it to Safari because of one thing. Chrome Developer Tools! As a web developer, I spend pretty much all day in Chrome DevTools. On Windows, Chrome is the best browser. I used to be a great supporter of Firefox, but in recent years, Firefox has proven to be average. While it certainly better than IE and Firefox is improving. Chrome is still my bread and butter. (That being said, I refer to the Mozilla Developer Network very often in my daily routine.)</p>\n<h3>Microsoft</h3>\n<p>As mentioned above, Microsoft's place in my hierarchy is solely due to work. Google is the true owner of fourth place. Skype used to play a large role in my personal life in that I used it to keep in touch with many people. My usage has been reduced to nothing over the years except. I far prefer FaceTime these days. Though I use Skype daily, what I am using is Skype for Business, which used to be Lync. I think I used Bing once. By mistake. Don't even get me started on Internet Explorer. At this point, while I hear good things about Windows 10 and Edge, we have not upgraded to them at work yet.</p>\n<h3>Apple</h3>\n<p>I am writing this on a Macbook. I use almost every single application above (with the notable exception of all Microsoft's apps) on my iPhone. Almost everything I watch on a TV screen is through an Apple TV. I listen to Apple Music. Anything I can't find on Netflix I rent through iTunes. Having used Apple software and hardware, I have little desire to ever go back to Windows for personal use.</p>\n<h3>The slightly less frightful, but soon to be Threatening Three</h3>\n<p>Netflix - plays a larger role in my life than Facebook, Instagram, YouTube or iTunes.</p>\n<p>Uber - As mentioned in a previous post, Uber's service is fantastic. Though I have serious misgivings about the company itself. With a lack of competitive options in my home country. I don't see it going anywhere. That is to say if Uber does not self-destruct.</p>\n<p>Airbnb - Travel is a large part of my life, and Airbnb plays a vital role in it. I have stayed in Airbnb apartments around the world, and far prefer them to hotels or other, look-a-like services.</p>","frontmatter":{"title":"The Frightful Five."}}},"pageContext":{"slug":"/post007/"}}