{"data":{"markdownRemark":{"html":"<p>While I was working at my previous job, my morning routine was as follows: Wake up at 4:55AM, shower, change, brush teeth and leave for work as soon as possible in an attempt to beat traffic. Once at the office, I would make a cup of coffee and start working. This would be at around 06:30AM. I would then only have breakfast after 8, when the canteen opened. It might sound crazy to leave for work at 05:45 in the morning, but I had a commute to take care of. If I left any later, it would easily take me over an hour to 90 minutes to drive to work. Leaving early, beating traffic, meant it would only take me 30-40 mins at most. Additionally, because the office is relatively quiet early in the morning, at best, I could get some really productive work in. And at worst, I could at least \"get ahead\" of the day. I did this for many years. </p>\n<p>I could of course, have taken the alternate option, which would be to have a more personal morning and only leave for work after the traffic. This would mean me leaving after the rush (i.e. after 8AM), getting to the office around 08:30 - 09:30 depending entirely on what the traffic situation was during the rush. At that time, the day is already in full swing and emails and meetings are already in full flow. Chances of getting a good productive coding session in the morning were slim at best. In later times, a hot desk policy was initiated because space was at a premium. And so getting into the office \"late\" meant that you would likely need to hunt for a desk and have to sit in a random spot, which may or may not have a good screen and position setup. Needless to say, I was not enamoured with plan B.   </p>\n<p>Now, that I am working independently, I am able to set my own routine and schedule. As such, I want to have a healthier, more fulfilling start to my days. A start that prioritises sanity and stability instead of traffic and schedules. A start the takes care of personal priorities through habit. As such, I have been doing the following: </p>\n<ul>\n<li>Wake up at 6AM since I still want a relatively early start to the day. </li>\n<li>Write a morning journal for 5-10 minutes to release any random thoughts and get clarity. </li>\n<li>Meditate for 3 minutes to get my mind settled and focused. (I do the Daily Headspace meditation)</li>\n<li>Exercise for 30-40 minutes which typically involves an ever changing mix of exercise, stretching and yoga. (Typically I used Nike Training Club or Asana Rebel)</li>\n<li>Make Breakfast and eat it while reading a few blog posts from my RSS feed (via Feedly, usually Daring Fireball, Seth's Blog, AVC or Ben Thompson). (15 - 20 mins)</li>\n<li>Make coffee and settle down to write a blog post. (30 - 40 mins)</li>\n<li>Shower and brush teeth.</li>\n<li>Start working. </li>\n</ul>\n<p>All in all, it takes me about 2.5 hours to do all the above. Since I don't have a commute anymore, I gain that time for exercise. The huge benefit for me though is that I have taken care of some of the most important parts of my day and the day has only just begun! </p>\n<p>My mind, my body, my soul and my stomach are all happy and I am all clear to focus on the important work that needs to get done during the day!</p>\n<p><em>Note: Leaving during rush is a no go for me. I did this for a while, but after too many days of sitting in traffic for hours on end due to some incident I decided to not do this ever again. One day it took me over 3 hours to get to work!</em></p>","frontmatter":{"title":"Morning Routines."}}},"pageContext":{"slug":"/post028/"}}