{"data":{"markdownRemark":{"html":"<p>Below are a few thoughts and notes on using MySQL with TypeORM.</p>\n<h4>MySQL</h4>\n<ul>\n<li>The default location for MySQL installation (on Mac) is: /usr/local/mysql</li>\n<li>If you get an error when running: <code>mysql --version</code> it likely means you do not have mysql added to your $PATH. Check this by: </li>\n<li><code>echo $PATH</code></li>\n<li>If it is not there, you will need either add it to your session via: <code>export path=$PATH:/usr/local/mysql/bin</code></li>\n<li>Or you can add it to your .bash_profile file, this is typically located at: /usr</li>\n<li>In order to start your MySQL session, in terminal, run: <code>mysql -h hostNameGoesHere -u usernameGoesHere -p</code></li>\n<li>You can start or stop your MySQL server from System Preferences. </li>\n<li>To access a specific database, you can run: <code>mysql -h hostNameGoesHere -u usernameGoesHere -p databaseNameGoesHere</code></li>\n<li>In MySQL terms, Schemas and Databases are synonyms. </li>\n<li>You can install MySQL Workbench separately as a GUI for interfacing with MySQL. (I tried using DBeaver, but I had some issues with the MySQL Driver, so have not got it working yet.)</li>\n</ul>\n<h4>TypeORM</h4>\n<p>If you run into the following error when trying to connect to MySQL from TypeORM: </p>\n<p><code>Error: ER_NOT_SUPPORTED_AUTH_MODE: Client does not support authentication protocol requested by server; consider upgrading MySQL client</code> </p>\n<p>The reason this happens is explained in detail <a href=\"https://github.com/mysqljs/mysql/issues/1959\">here</a>, but in short, MySQL 8.0.4 introduced a new default authentication mechanism 'caching<em>sha2</em>pasword'. This is more secure than the previous method used by MySQL, which is 'mysql<em>native</em>password'. Now, TypeORM, under the hood, uses mysqljs (I think). Work is being done in order to support this new authentication, however, as of writing, it has not been merged into master. As such, in order to get around this, on MySQL, you need to do the following: </p>\n<pre><code>ALTER USER 'userName'@'hostName' IDENTIFIED WITH mysql_native_password BY 'passwordHere';\nSELECT plugin FROM mysql.user WHERE User = 'root'; \n</code></pre>\n<p>Thereafter, you need to run (from the MySQL terminal): </p>\n<ol>\n<li><code>FLUSH PRIVILEGES;</code></li>\n<li><code>quit</code></li>\n<li>Stop MySQL server.</li>\n<li>Start MySQL server. </li>\n</ol>\n<p>You should not be able to run TypeORM again and hopefully it will connect. If not, you may find some guidance by reviewing the following: </p>\n<ul>\n<li><a href=\"https://github.com/typeorm/typeorm/issues/2093\">TypeORM issue</a></li>\n<li><a href=\"https://github.com/mysqljs/mysql/issues/1507\">mysqljs issue</a></li>\n<li><a href=\"https://github.com/mysqljs/mysql/pull/1962\">mysqljs PR</a></li>\n<li><a href=\"https://github.com/mysqljs/mysql/issues/1959\">mysqljs issue</a></li>\n<li><a href=\"https://dev.mysql.com/doc/refman/8.0/en/caching-sha2-pluggable-authentication.html\">MySQL documentation</a></li>\n</ul>\n<h4>TypeORM and Nest.js</h4>\n<p>Ultimately, I dug into all of the above in order to add a MySQL database to my Itemly API. The work-in-progress code is <a href=\"https://github.com/nicholaspretorius/itemly/tree/itemly-mysql\">here</a>.</p>","frontmatter":{"title":"MySQL and TypeORM."}}},"pageContext":{"slug":"/til0054/"}}