{"data":{"markdownRemark":{"html":"<p>Over the past few days I have been going through several 'official' introductory tutorials. </p>\n<h4>Socket.io</h4>\n<p>While I have been aware of socket.io, I have never used it. Today I went through the official tutorial <a href=\"https://socket.io/get-started/chat/\">here</a>.</p>\n<p>I really enjoyed it! It is amazing how simple and powerful it is. I have not yet had time to go through any deeper examples but it has certainly piqued my interest! </p>\n<h4>Ionic</h4>\n<p>Last week I spent some time doing a basic Ionic app based on what I did for the Itemly Angular app. As a result, yesterday, I went through the official <a href=\"https://ionicframework.com/docs/intro/tutorial/\">Ionic tutorial</a>. Of the tutorials I have gone through recently, this was the most disappointing since it was not so much a tutorial as it was a walk through of the code generated by the Ionic CLI. While it was interesting to me to see how heavily Ionic uses Angular, it was not a \"tutorial\". There could be a lot more value development wise in having a more detailed step-by-step walkthrough. So far, both Angular and React tutorials are far better. </p>\n<p>What did stand out in terms of Ionic was their <a href=\"https://ionicframework.com/docs/components/#overview\">component library guide</a>. I really enjoyed going through this and it made me excited to spend more time working with Ionic. The Components are cleanly presented with a mobile view on the right which lets you toggle between iOS, Android and Windows Phone views of the Ionic components. While the information was great, what I really <em>loved</em> where the examples! While displaying the myriad components, all the examples were heavily pop-cultured inspired with reference to Star Wars, Game of Thrones, Indiana Jones, Harry Potter and more which made going through the examples a lot more fun than they might have been otherwise! </p>\n<h4>Vue</h4>\n<p>I have started going through the Vue docs, however, as far as I can see, there is no official tutorial as such. There is a link to a free Vue course on a site called Vue Mastery where it looks as though they work through an e-commerce example. However, the docs themselves take the approach of various separate, standalone examples. Personally, I prefer a text based, step-by-step tutorial where you can build 'something' in an hour or two. </p>\n<p>I am a big believer in online courses, and I have done several of them, however, they are very time intensive, and, as I have mentioned previously, I enjoy going through the official tutorials since they do not take much time and they provide information direct from the development team, as such, you can trust that best practice is shown. </p>\n<p>I will need to stick with the Vue docs for a while to see if a more cohesive example or tutorial is presented. </p>","frontmatter":{"title":"Those Tutorials."}}},"pageContext":{"slug":"/til0063/"}}