{"data":{"markdownRemark":{"html":"<p>These are some tips when coding with React: </p>\n<h4>Components</h4>\n<ul>\n<li>\n<p>When creating components, <em>use</em> the component first before implementing it. That is to say, use the planned component in the parent before you have coded it so you can think about the interface before implementing the code. </p>\n</li>\n<li>\n<p>When creating components, give props generic names so that you do not tightly bind the name of props to the type of the data in the current implementation. Chances are good that when you look to re-use the component with another data source or context, the name of your prop may no longer suit. In cases, whe you are not certain what the props data names might be, you can pass props that specify the name of the field to be read, then in the component, you can use <code>item[value]</code> square bracket notation for object properties as opposed to <code>item.value</code> dot notation for properties. This makes your components more generic.</p>\n</li>\n</ul>\n<h4>Default Props</h4>\n<p>You can set default props if you think most components or data that will be used will use the same property names. For example: <code>_id</code> or <code>name</code>. You can use default props as follows: </p>\n<pre><code>ComponentName.defaultProps = {\n    valueProperty: “_id”,\n    textProperty: “name”,\n};\n</code></pre>\n<p>This will enable you to pass the necessary props only when they will differ from the default props. </p>\n<h4>Event Bubbling</h4>\n<p>Note that when you do something like this when bubbling an onClick event: </p>\n<pre><code>&#x3C;ComponentList\n    items={this.state.items}\n    currentItem={this.state.currentItem}\n    onClick={item => this.handleItemSelection(item)}\n/>\n</code></pre>\n<p>The function looks like this: </p>\n<pre><code>handleItemSelection(item) {\n    ... do something ...\n}\n</code></pre>\n<p>You can achieve the same thing like this: </p>\n<pre><code>&#x3C;ItemsList\n    items={this.state.items}\n    currentItem={this.state.currentItem}\n    onClick={this.handleItemSelection}\n/>\n</code></pre>\n<p>With a function like this: </p>\n<p>handleItemSelection = item => {\n... do something ...\n}</p>\n<h4>Object Destructuring</h4>\n<p>When you are referencing this.props. a lot in your component, it helps to use object destructuring to simplify.</p>\n<p>In a class component, within the render() method, but before the return statement, you can do the following: </p>\n<pre><code>const { onClick, currentGenre, genres } = this.props;\n</code></pre>\n<p>Then, where you would have used, for example: </p>\n<p><code>this.props.onClick</code> or <code>this.props.currentItem</code>, you can instead just use <code>onClick</code> or <code>currentItem</code>. </p>\n<p>When using a function component, you will enter the same object destructuring code within the component function, and before the return statement. For example: </p>\n<pre><code>const ItemList = props => {\n    const { items, textProperty, valueProperty, onItemSelect } = props;\n    ...\n}\n</code></pre>","frontmatter":{"title":"React Tips."}}},"pageContext":{"slug":"/til0074/"}}