{"data":{"markdownRemark":{"html":"<p><em>Note: This post is a transplant. First published on 2017/12/04. It was written by myself on another site and has been moved.</em></p>\n<p>I have been an avid blog reader for many years. I first became aware of the form way back when Blogger was a <a href=\"https://en.wikipedia.org/wiki/Blogger_(service)#History\">thing</a>. I don't remember which blogs I read and the habit soon died away. Many years later, more or less nearing the end of 2010 I started reading <a href=\"https://daringfireball.net/\">Daring Fireball</a> and kept up to date with RSS feeds via Google Reader (<a href=\"http://googlereader.blogspot.co.za/2013/07/a-final-farewell.html\">RIP</a>). I have been coming back ever since. [1]</p>\n<p>Shortly after becoming a regular Daring Fireball reader, I became aware of \"<a href=\"https://daringfireball.net/thetalkshow/\">The Talk Show</a>\" (during the James Bond days) and by extension the <a href=\"http://5by5.tv/\">5by5</a> network of podcasts (which is where The Talk Show began). Via 5by5 I discovered \"Build &#x26; Analyze\" which was the first time I had listened to a developer talking about his craft other than talking to my coworkers. It was refreshing and insightful to listen and learn from some really smart people having conversations.</p>\n<p>Many years later still, it was on Marco Arment and _DavidSmith's podcast \"<a href=\"https://www.relay.fm/radar\">Under the Radar</a>\" that I came across the term \"unexpected complexity\". The first half of which this site is named after. Unexpected complexity describes the challenges developers often encounter when building software and encountering complexity that they had not considered or planned for. I felt the term perfectly captured one of the daily challenges that comes up in writing code and solving problems. More importantly though, in some ways I see unexpected complexity as a lens through which to see some of life's own challenges. We often think things are going to be one way and discover them to be another. This is neither good nor bad, but it is interesting, that despite the fact that the unexpected and unplanned-for complexity happens almost every day, it still often feels that we do not expect the unexpected.</p>\n<p>And thus, this site was named. I do not yet know what format, or content I will share on this site, but the important thing for me is to write and to communicate. Consistently.</p>\n<p>This is a start, after many stops and many more false starts.</p>\n<p>--</p>\n<p>Inspired by: <a href=\"https://twitter.com/gruber\">John Gruber</a>, <a href=\"https://twitter.com/marcoarment\">Marco Arment</a>, <a href=\"https://twitter.com/_davidsmith\">David Smith</a>, <a href=\"https://en.wikipedia.org/wiki/RSS\">RSS</a> and <a href=\"https://en.wikipedia.org/wiki/Podcast\">podcasts</a>.</p>\n<p>Currently reading RSS via <a href=\"https://feedly.com/\">Feedly</a>.</p>\n<p>Currently listening to podcasts via <a href=\"https://overcast.fm/\">Overcast</a>.</p>\n<p>[1] I really wish I could remember how I first came across Daring Fireball.</p>","frontmatter":{"title":"The Name."}}},"pageContext":{"slug":"/post015/"}}