{"data":{"markdownRemark":{"html":"<p><em>Note: This post is a transplant. First published on 2017/12/14. It was written by myself on another site and has been moved.</em></p>\n<p>Sarah Perez writing for <a href=\"https://techcrunch.com/2017/12/08/apples-widened-ban-on-templated-apps-is-wiping-small-businesses-from-the-app-store/?utm_source=raywenderlich.com+Weekly&#x26;utm_campaign=58cb5c275d-raywenderlich_com_Weekly_Issue_145&#x26;utm_medium=email&#x26;utm_term=0_83b6edc87f-58cb5c275d-415822029\">TechCrunch</a>:</p>\n<p>\"Many companies have recently been given a January 1, 2018 deadline, after which point any new apps they submit will be rejected by the App Store Review team, they’ve been told by Apple. In the meantime, some have been able to maintain their existing apps, but it’s unclear how long that will last. [...] What’s unfortunate about the expanded policy enforcement is that these app makers specifically target the small business market. They build apps for businesses that don’t have the internal resources to build their own apps or can’t afford to hire a custom shop to design a new iOS app from scratch.\"</p>\n<ul>\n<li>Cleaning up the App Store is a good thing.</li>\n<li>Apple clamping down on spammy, keyword-squatting, low quality apps is a good thing.</li>\n<li>Banning apps only because they are generated by a template or app builder is not a good thing.</li>\n</ul>\n<p>Firstly, the argument that this move by Apple is akin to banning websites running WordPress or Squarespace from the internet is off base. The App Store is not the internet. The App Store is Apple's. Right of admission reserved.</p>\n<p>The case can also be made in defence of Apple's move that, if these app generators allow legitimate small businesses to generate apps, the same will go for spammy businesses generating spammy apps. Chances are fair that there is a side to this story not highlighted in the article and that Apple may well be responding to scenarios where these generators are being used to submit many low-quality apps to the App Store. If this is the case, the situation would improve if the companies behind the generators were to apply a more rigorous approach to enforcing standards on their customers. In the same breath however, this would likely reduce the app generator sales pitch - which is anyone can make an app, easily, quickly and cost effectively.</p>\n<p>What does not ring true about this situation is that Apple's focus seems to be on the <em>implementation details</em>. On the surface it seems that Apple may be using this as a polite way of kicking out hordes of low quality apps without saying so directly. Ultimately though, the centre of the affair should be that the banning of apps from the App Store should be about app <em>quality</em> and app <em>content</em>. That is to say, that the app should have a purpose and reason to exist beyond just being a copycat or spam. While it may irk Apple to have, for example, 50 pizza ordering apps that are more or less the same, chances are good that there are, at the same time, some unique, high quality apps that are built by generators too.</p>\n<p>I don't know anything about the technical merits of these bans, but as mentioned in the article, Apple's partnership with IBM and their app generators are not included in the ban. The optics of this are poor: \"Large successful company can sell template apps to large corporate customers for very high fees, but John Doe down the way may not use the same approach in a more cost effective manner\".</p>\n<p>As is often the case, one needs to consider the sheer scale of the App Store. The volumes of app submissions are enormous and as the saying goes \"You can't make an omelette without breaking a few eggs\". However, if you take a look at the <a href=\"http://www.shoutem.com/\">Shoutem</a> website, it certainly <em>seems</em> like they have created a high quality product and now, their egg is broken. Apple does not mind breaking a few eggs on balance, yet the rub is that there are real people on the other end of these businesses catering to real needs and real gaps in the market. Apple is eager to promote the successful underdog stories however it is not all roses in the App Store. This reminds developers that this is not the Internet. This is a walled garden and you are at the whim of a gatekeeper whether you like it or not.</p>\n<p>Without being able to see more clearly how Apple judges or determines these bans it is difficult to side with Apple on the surface of it. As is often the case, more transparency and clear guidelines would alleviate the confusion. This is precisely what Congressman Ted W Lieu asks for in his letter to Apple. The concern is that Apple is \"casting too wide a net\" and it seems this could be true. If anything, large tech companies likely do not want to be under any further scrutiny than is necessary.</p>\n<p>After all, quality should come before implementation. Just because your app was generated in some way, does not necessarily mean it is low quality. In the end, while we all know the App Store is not a level playing field, developers would rest easier at night knowing that if John Doe down the way cannot build apps from templates, then IBM should not be allowed to either.</p>","frontmatter":{"title":"Apple's Widened Ban On Templated Apps."}}},"pageContext":{"slug":"/post019/"}}