{"data":{"markdownRemark":{"html":"<p>For the past two months I have been wakeskating. Similar to wakeboarding, but without the bindings. Essentially, it is skateboarding on water. Skill-wise, it is a very challenging sport. Firstly, you are being pulled around the water at 30km/h. Secondly, you fall. A lot. Unlike skateboarding, if you fall, you cannot just get right up and try it again immediately. You first need to swim to the shore, then walk all the way back to the starting dock and only then can you start again. Depending on where on the course you fell, you may be swimming and walking considerably further. And so, it takes a lot of patience as well. </p>\n<p>Physically, it is just as challenging. Your arms are continuously worked, as are your legs, and I am sure everything in between. Back to the falling, it may be water, but hitting water at 30km/h full in the face, or straight onto your back or neck is not pleasant. Never mind getting water up your nose and into your ears... Yet, it is a lot of fun, and I really enjoy it.</p>\n<p>The thing is, my body has been taking a beating. My riding fitness has improved, so I can ride for 2-3 hours, and the evening/morning after stiffness has been lessening, but not to the extent I had hoped. As a result, I have started doing yoga and mobility exercises/stretches. On one hand, I do a session in the morning to release the stiff and soreness of the previous day's session. And on the other hand, it loosens me up for the day and gets my body off to a better start to the day. I am also hoping that, with repetition and regular practice of yoga, my flexibility and strength will improve which will counteract the pummeling my body takes on the cable. </p>\n<p>I have never been a flexible person physically. Even when I was a kid, touching my toes and, when doing a butterfly stretch, getting my knees on the ground was difficult if not impossible. I think all the years of sitting in front of a computer and going through phases where I was not very physically active have dramatically worsened the state of my flexibility. This morning, while doing a yoga session, I burst out laughing at some of the movements I had to do, because, looking at the form of the instructor and looking at the state and position I was in was not even closely comparable. Doing yoga, has made me realise just how terrible I am at using my own body. Granted, one needs to be very flexible and in tune with one's own movements to get some of these movements right, but realising just how inflexible I am, I had to laugh. </p>\n<p>None the less, I am going to stick with it. I am now trying to do two sessions a day, one in the morning to loosen-up and one in the evening to release. I don't know that I will ever be able to reach the form of some of the poses and movements, but I hope, that with time and repetition, that I will at least get closer! </p>","frontmatter":{"title":"Yoga."}}},"pageContext":{"slug":"/post030/"}}