{"data":{"markdownRemark":{"html":"<p><em>Note: This post is a transplant. First published on 2017/05/23. It was written by myself on another site and has been moved.</em></p>\n<p>As a kid, Soundgarden was the best! Their albums Badmotorfinger, Superunknown and Down on the Upside were amongst my favourite. My first exposure to them was on a taped copy of Superunkown. A tape! I have memories sitting in my parents lounge just listening to the tape over and over again. Play, rewind, play, rewind. Soon after, some of my first CDs were Soundgarden albums.</p>\n<p>My favourite t-shirt at the time was a Soundgarden tee. It was a kind of bastardised, grey-tie-dyed affair with the Badmotorfinger cover on the front and Superunkown on the back. Or was it the other way around? I bought it at a flea market. I must have worn that shirt through pretty quick.</p>\n<p>I had heard of Temple of the Dog when I was younger, I had no idea who was in the band. It was only later, when I really got into Pearl Jam that I discovered Temple of the Dog. It blows my mind to this day to listen to that band. Chris Cornell and Eddie Vedder in one band?</p>\n<p>I have been lucky enough to see some of my grunge-era heroes live. Eddie Vedder, Matt Cameron and even Dave Grohl with Pearl Jam (Dave went on stage to rock the tambourine for a rendition of 'Kick out the Jams'). I even got to see Chris's bandmates from Audioslave when Rage Against the Machine played their reunion gig in Finsbury Park. Sadly, I never got the chance to see Chris live.</p>\n<p>It has been some time since I've listened to Soundgarden. King Animal was the last time I remember. Spending so much time in Europe these days, the thought even occurred to me I might get the chance to see them soon. Listening to their albums now, I am struck, not just by how good the songs are, or how much I really love that band, but by how eerily the lyrics evoke the news of Chris Cornell's death. Some of their greatest songs, \"Blow Up the Outside World\", \"Fell on Black Days\", \"The Day I Tried to Live\" delve into some dark parts. The lyrics on \"Pretty Noose\" left me cold.</p>\n<p>RIP Chris.</p>\n<p><em>Singing one more time around, might do it.</em></p>\n<p><a href=\"https://www.youtube.com/watch?v=dbckIuT_YDc\">https://www.youtube.com/watch?v=dbckIuT_YDc</a></p>","frontmatter":{"title":"One More Time Around."}}},"pageContext":{"slug":"/post009/"}}