{"data":{"markdownRemark":{"html":"<p>Over the past few months, I have been listening to the audiobook series version of Game of Thrones. Mostly, in anticipation for the now playing series, but also because I was curious as to how closely the series hews to the books. Up until A Feast for Crows, it seemed to me that, for the most part, the books and the series were in step as to the general spirit and events that were happening. Details were often different, namely the portrayal of Ramsey, the Wildling attack on the wall as well as a few other character subtleties. There is much internal dialogue and dream sequences in the books that would be difficult to render on screen. For the most part though, to me the series was mostly well representing the books. </p>\n<p>A Feast for Crows, seems to me to be a point of major departure. I think, for me, this has been the weakest book in the series. The entire books makes barely a mention of the primary characters John Snow, Danaerys Taergaryen and Tyrian Lannister and is filled with minute court conspiracies and sideplots that do not even make an appearance in the series at all. There are also several, quite significant differences in how certain plotlines are developing. The arch of the stories, and the inherent conflict points are still there, but the representation of how they occurr differe drastically. </p>\n<p>To my mind there is one significant departure in this book from the series in both storyline and feeling in that this book tells of a significant split between Jamie and Cersei Lannister. I do not remember if this is hinted at in the series, but this book goes into great detail as to the deterioration of their relationship. There is also an very long and deep dive into the details of the Dawnish kingdom in the aftermath of the Red Viper's death at the hands of the Mountain which is very briefly and differently related in the series. </p>\n<p>The book is still a good read and is has a much strong thread of dark humour running through it. I really enjoy the characterizations, but this book felt more like filler and moved at a snails pace. As I write this, I now realise there was also no chapters (that I recall) that detailed Bran's movements either. Considering John, Danaerys, Tyrian and Bran are likely the most compelling characters in the stories, this is a big loss I think. Neither, has there been any mention of the Night King. Additionally, there is a bizarre twist in that Catlin Stark is still present after The Red Wedding. I am not quite sure, but she is seemingly a zombie of some sort. Not a flesh-eating one, but she was raised up from the death. I won't get into any more details since as I go, I notice more and more differences in detail. </p>\n<p>None the less, I am now starting A Dance with Dragons, which I hope will be significantly more centred around the primary characters than the endless parade of sideshows A Feast of Crows represented. It seems Martin really got into the weeds and <em>inside baseball</em> with this book in terms of the world of Westeros... </p>\n<p>Here's to hoping he got back to the real game in the next! </p>","frontmatter":{"title":"A Feast for Crows."}}},"pageContext":{"slug":"/post046/"}}