{"data":{"markdownRemark":{"html":"<p>Amazon has announced the <a href=\"https://www.amazon.com/dp/B01J24C0TI\">Echo Show</a>, the recently rumoured Echo device with a screen.</p>\n<p>[Video link removed as video is no longer available]</p>\n<p>A few thoughts after watching the video:</p>\n<ul>\n<li>The acting is pretty bad.</li>\n<li>The demonstrations are convincing and the value proposition is obvious.</li>\n<li>The product itself is certainly from the \"form follows function\" school of design.</li>\n<li>The white version is odd - why not offer a completely white version?</li>\n</ul>\n<p>This product seems, from both the way it looks and the way it operates to be the Alexa-powered love-child of an old TV-monitor and a smartphone. It is however intriguing to consider the spaces, use cases and price points that Amazon is occupying with their collection of Echo devices.</p>\n<ul>\n<li>Echo - Smart speaker ($149.99)</li>\n<li>Echo Dot - Smart speaker minus the speaker (for spreading throughout the home) ($49.99)</li>\n<li>Echo Tap - Portable smart speaker (for travel, picnics etc) ($129.99)</li>\n<li>Echo Look - Smart speaker with a camera ($199.99)</li>\n<li>Echo Show - Smart speak with a screen and a camera ($229.99)</li>\n</ul>\n<p>Looking at Amazon's Echo products and Alexa services, it certainly seems that Amazon is picking up relevant and significant mindshare in the marketplace.</p>\n<p>[Updated: 11/05/2017]</p>\n<p>For comparison, I have included several other home based products for comparison. While the wifi-routers are different devices, there might be the option to combine such products:</p>\n<ul>\n<li>Google Home - Smart speaker ($114)</li>\n<li>Google Wifi - Wifi router ($129)</li>\n<li>Eero - Wifi router ($199)</li>\n<li>Apple TV - Smart TV puck ($149 32GB)</li>\n<li>Apple Airport Extreme - Wifi router ($199)</li>\n<li>Apple Airport Express - Wifi router ($99)</li>\n</ul>\n<p>[End update]</p>\n<p>It will be interesting to see if/when Apple enters this market and what Google will do to expand on their offerings. What approach will Apple take in the the following respects:</p>\n<h3>Pricing</h3>\n<p>Amazon is certainly taking the the portfolio approach. Considering Apple has been very slow to develop the Apple TV product, it is difficult to see Apple being able to effectively pay attention to such a device. Should they release such a device, it is likely to be just one (at least for quite some time) and it will likely be more expensive than the Echo.</p>\n<h3>Functionality</h3>\n<p>There is an ongoing debate as to which voice assistants are the best between Alexa, Siri, Google Assistant and Cortana. People's feelings seem to be dictated by personal preference and with their preferred style of interaction. While Apple can certainly justify the higher prices for their computers and mobile devices because the software (MacOS and iOS) are superior.</p>\n<p>What happens when the software (Siri) is just another assistant and is even considered to be inferior? The differentiating factor for Apple is then left with the design of the device.</p>\n<h3>Design</h3>\n<p>The home is an area that people spend a lot of money on and the \"form\" of many objects in the home is very important. Apple will certainly find meaningful customers in the home for an attractive and functional device. The tricky point here is, considering that, up until we can have a HAL-like omni-present assistant throughout the home, the multi-device approach is likely to be the better approach in the home when trying to span your entire home. Will these customers want to buy an \"Apple speaker/screen/dingus\" for every room if the functionality is not where it should be and more expensive?</p>\n<h3>Apple TV</h3>\n<p>When considering what products might be most similar to a smart speaker-like device. The Apple TV comes closest. The Apple TV has been a point of disappointment for several customers. While I am certainly happy with mine, I was coming from a background of regular TV. The bar was very low. The majority of potential customers in this market have much higher expectations. There have been very high hopes for the Apple TV, yet the device seems to be only acceptable on most vectors. Considering Siri falls into this \"not quite the best of Apple\" category - will customers be willing to invest into products Apple is likely not to going to make regular, meaningful updates to?</p>\n<h3>Google Home</h3>\n<p>Admittedly, I do not know much about Google Home. The device seems to be pretty good, if somewhat undifferentiated. One advantage they do have at present is Google Home's voice identification feature. This feature which recognises different people's voices stands out from the pack at present. However, this will likely be coming to other platforms soon. Features are easily copied.</p>\n<h3>Apple's Advantage</h3>\n<p>The fact is though, that Apple and Siri are with their customer's everywhere they go. Added to that, Apple customers are very likely to give an \"Siri speaker\" at least one chance. While advantages in one technological space generally means disadvantages in others. The fact that Alexa/Echo is not with you everywhere you go, means their is a significant gap in the Amazon/Alexa product offering that is not easily filled by the many smart home product players. The continuity that Siri on your iPhone and in your EarPods offers is compelling. While Apple seems to be losing valuable ground in the smart home, there is still opportunity there. How long that opportunity lasts is another question.</p>\n<h3>Samsung</h3>\n<p>Samsung seem to be conspicuously absent in this space which is strange considering they make a variety of the most expensive home appliances. That is without considering their purchase of Harman. Samsung are able to make and price products of almost every kind and in every price point. However, their efforts with Bixby on their latest Galaxy flagship seem to leave much to be desire and their purchase of Viv is yet to bear fruit.</p>\n<p>Samsung look to be taking a leaf out of the failed Nokia/build-your-own-OS playbook here rather than Samsung's own transformative Android playbook. Samsung are trying to differentiate in an area they are not skilled in. This is a mistake by Samsung in this market. Would it not be better for them to leverage Alexa along with their existing product strengths than to try and forge their own platform?</p>\n<p>Granted, not being able to differentiate themselves on the level of software is a thorn in Samsung's side when it comes to smartphones. None the less, they have succeeded admirably in the smartphone market. I see no reason not to take a similar approach in the home market.</p>\n<h3>Alexa in your ears</h3>\n<p>Lastly, I suspect that one area Amazon could be looking to leapfrog their \"always with you\" gap is by pushing the Echo into the in-ear/wearable speaker space. While wearables certainly take a level of finesse, nuance and expertise in software and hardware that only Apple has been able to display to date, surely such a product must be on Amazon's mind. That gap in experience Echo/Alexa customers have when they aren't home is a big one, and is prime territory for Apple or Samsung to enter through.</p>\n<h3>Iterations</h3>\n<p>It is still relatively early days in the voice assistant and product space, however, the speed with which Amazon is iterating will be difficult to match considering Apple's slow and deliberate pace. Even if someone can match Amazon on that vector, Amazon's ability to monetise outside of the product itself, will be even harder to compete with.</p>\n<p><em>Note: This post is a transplant. First published on 2017/05/10. It was written by myself on another site and has been moved.</em></p>","frontmatter":{"title":"Show and Tell."}}},"pageContext":{"slug":"/post005/"}}