{"data":{"markdownRemark":{"html":"<p>I recently started learning to play the guitar. While it is still terribly early and I can barely play two chords, I am none the less quite excited about it all! </p>\n<p>Primarily, due to something that happened in the online course I am learning to play through. The site is called <a href=\"https://www.guitartricks.com\">Guitar Tricks</a> and I am busy doing the beginner, Guitar Fundamentals 1 Course. Up until today, the going was pretty slow. Most of the introductory sections up until now were dealing primarily with the basics such as what the guitar is, how it makes sounds and how it works, the different parts of the guitar, how to sit, hold and tune the guitar as well as how to play notes etc. For a short while, I was a little disappointed, since it felt like an overly long introduction. To be fair, it is probably the right way to go, since a base of knowledge and understanding of the instrument does need to be built up. </p>\n<p>Never the less, the whole point of the course is to learn to play, not to <em>know</em> about the guitar, and today's section finally began with this journey. It was all very simple in concept. Learn two simple chords, C Major and G Major, and then play them to rhythm in 4/4. very straight-forward stuff. What really stuck out for me, and got me really excited was that, you then \"play along\" with the instructor. (Not literally, since it is a video recording) This was a really nice touch and made it feel more like a \"real\" lesson than watching and playing along to a vide. What really hit it out the park though, was on the second play along, the video introduced a drummer playing along. Following this, not only did you play along with the instructor and the drummer, the instructor sang and a bassist was introduced. Almost as if you were playing a song with a band! Very cool! </p>\n<p>Granted, it is a very simple song with very simple lyrics, but the fact that one could at least get a hint of what it might be like to play with other musicians made it stand out in my mind. Needless to say, I am very excited to practice this basic introductory song and play along with the virtual band. </p>","frontmatter":{"title":"Guitar Tricks."}}},"pageContext":{"slug":"/post041/"}}