{"data":{"markdownRemark":{"html":"<p>I am a big fan of online, video based learning. In a field such as programming, I find it works very well. One, being programmers, we already spend a lot of time on the computer. Second, switching between the video you are watching and the code you are writing in the environment you are working in is quick and seamlesss. Lastly, I find it hugely valuable to see how other programmers think through problems, how they code, how they think through the code. It has taught me a lot and I would encourage any programmer (or anyone else for that matter) to try it out! </p>\n<p>There is so much to be learned out there, and so many good resources through which to do so. Here are some options I would recommend: </p>\n<h3>Udemy.</h3>\n<p><a href=\"https://www.udemy.com\">Udemy</a> is a large marketplace. Anyone can upload a course and anyone can buy a course. There is a huge variety of content available covering many wide-ranging fields. From a programming perspective, I would recommend the following instructors: </p>\n<p><a href=\"https://www.udemy.com/user/maximilian-schwarzmuller/\">Maximilian Schwarzmuller</a> - He teaches a wide range of topics, mostly JavaScript and Angular related, though he does cover React, Vue and several other topics. </p>\n<p><a href=\"https://www.udemy.com/user/sgslo/\">Stephen Grider</a> - Stephen is another great teacher and focused mostly on the React and related ecosystems. </p>\n<p><a href=\"https://www.udemy.com/user/reed-barger/\">Reed Barger</a> - Reed is also more React based, however, his courses are not so much courses as they are code alongs. He rapidly codes through various app examples. He does not explain the code, or teach you how, but I find it great to code along. </p>\n<h3>Angular University.</h3>\n<p>I believe Vasco, who is the teacher behind <a href=\"https://angular-university.io\">Angular University</a> had his start on Udemy, but I have watched several courses on his own site. As the name suggests, he is focused on Angular and the Angular ecosystem. </p>\n<h3>Ultimate Courses (formerly Ultimate Angular).</h3>\n<p>Todd Motto is a Google Developer Expert and runs <a href=\"https://ultimatecourses.com\">Ultimate Courses</a>. I first came across his site, then called Ultimate Angular, as I was brushing up on my AngularJs skills. He created three very good courses on the topic. Since then, he has expanded his site with several courses on Angular, Typescript and the Angular ecosystem. He has since rebranded the site and it looks like the course content will expand to cover vanilla JavaScript topics too. </p>\n<h3>Mosh Hamedani</h3>\n<p><a href=\"https://programmingwithmosh.com\">Mosh</a> also seems to have originally built his following through Udemy. Now he runs his own site independently. I thoroughly enjoyed his course on <a href=\"https://codewithmosh.com/p/the-complete-node-js-course\">Node.js</a> development and I think he has a great way of teaching an explaining topics in a progressive and understandable way. </p>\n<h3>Wes Bos.</h3>\n<p><a href=\"https://wesbos.com/\">Wes</a> is an independent teacher/developer. As far as I know, he has not been on Udemy at all(similar to Todd Motto) and has built his audience completely from the ground up. I have been through his courses on JavaScript and CSS and listen to a his <a href=\"https://syntax.fm\">Syntax</a> podcast on a frequent basis. He is also mostly React based in his teaching. </p>\n<h3>Design+Code.</h3>\n<p>More on the design side, but containing a lot of code too is <a href=\"https://designcode.io\">Design+Code</a> by Meng To. Meng has built up an independent site focused on teaching design (mostly through Sketch) as well as the coding of iOS app via Swift and React. The content is great! And for someone such as myself that now needs to design as well as code it has been a valuable resource to draw upon. </p>\n<h3>Other platforms.</h3>\n<p>At various other stages, I have been on and used the following: </p>\n<h4>Treehouse.</h4>\n<p><a href=\"https://teamtreehouse.com\">Treehouse</a> offers various courses on a large variety of topics. They tend to be more broad-based, so they cover all the building blocks through various teachers. They have a really cool platform, high quality, well-produced videos and good customer support. They were the first platform I signed up with, and if you are looking for variety, they are a great option. I do however, feel that the independent teachers mentioned above provide more in-depth, niche focused content, typically going hand-in-hand with deep dive course projects. Treehouse as mentioned is more, covering the basics on the high level than getting deep into the nitty-gritty. </p>\n<h4>Pluralsight.</h4>\n<p><a href=\"https://teamtreehouse.com\">Pluralsight</a> seems to be the mass-market choice, similar to Lynda/LinkedIn Training. They have a huge variety of topics and teachers, but I prefer to follow individual teachers and, similar to Treehouse, Pluralsight is more high-level, building-block type courses. There are few deep-dive courses that I have come across. In terms of Angular, <a href=\"https://www.pluralsight.com/authors/john-papa\">John Papa</a> is a great teacher on the platform, I thoroughly recommend his content. </p>\n<h4>Lynda.</h4>\n<p><a href=\"https://www.lynda.com\">Lynda</a> is probably the oldest, most recognised player in online, video learning as they have been around forever. I used them for a while, but also found the content to be more broad-based, ticking the boxes type of content without the deep dives that really get into the details that developers have to navigate on a daily basis. </p>","frontmatter":{"title":"Video Learning."}}},"pageContext":{"slug":"/til0107/"}}