{"data":{"markdownRemark":{"html":"<p><em>Note: This post is a transplant. First published on 2017/12/07. It was written by myself on another site and has been moved.</em></p>\n<p>The launch of the Amazon Prime Video app on Apple TV yesterday is a reminder of the scale of challenge I believe HBO will face when Game of Thrones, currently the biggest (and last) TV show on earth, ends:</p>\n<ul>\n<li>Netflix is currently available in over 190 countries</li>\n<li>Amazon Prime Video is available in over 200 countries</li>\n<li>HBO Go is available in 1 country. HBO Now is available in that same country as well as US territories.</li>\n<li>HBO itself, is available in over 50 countries.</li>\n<li>The rest of the world gets its HBO shows through regular TV.</li>\n</ul>\n<p>Added to the pure reach of these services, one of the more underrated aspects of Netflix's strategy is that they are investing heavily into foreign language shows. In the past few months myself or my girlfriend have watched:</p>\n<ul>\n<li>Peaky Blinders (UK)</li>\n<li>Fauda (Israel)</li>\n<li>Cable Girls (Spain)</li>\n<li>Dark (Germany)</li>\n<li>Luther (UK)</li>\n<li>Sherlock (UK)</li>\n</ul>\n<p>The significance of the above is that, over the past few years, the majority of shows we have watched have been American shows. Now that we have access to such variety, there is no reason for us to watch only American shows.</p>\n<p>No one disputes HBO's ability to create incredible shows that people the world over want to watch, but the questions I have are:</p>\n<ol>\n<li>Can HBO extricate itself from all the international rights deals that feed its business model in order to go direct to customers worldwide?</li>\n<li>Can HBO build out the necessary networks in order to to reach those worldwide customers?</li>\n<li>Can HBO continue to create the great shows while Netflix, Amazon, Apple and others start to compete for and possibly to crowd out the talent base with their deep pockets?</li>\n</ol>\n<p>Keep in mind, that Netflix is very quickly becoming the default. Amazon seems to be rapidly establishing itself as the sidekick in second place (especially since it is free for Prime members). Personally, the third spot is currently reserved to the local competitor Showmax (which has the rights to all HBO's shows in this country and is quickly expanding in Africa) and fourth place is a holdout for what is likely to be Disney's horse in the race.</p>\n<p>So if HBO's answer to my 3 questions above is: Yes.</p>\n<p>The remaining question is can HBO do all of that before people lose their desire the fork out for yet another video service?</p>\n<ul>\n<li>All of this goes without saying that YouTube, Facebook and Instagram are also steadily carving out more viewing time from all of the above</li>\n</ul>\n<p>** There is however, always that anticipated <a href=\"http://www.rollingstone.com/tv/news/hbo-clarifies-game-of-thrones-prequel-spin-off-plans-w485701\">Game of Thrones spin-off</a> to potentially kickstart things.</p>","frontmatter":{"title":"Yet Another Video Service."}}},"pageContext":{"slug":"/post016/"}}