{"data":{"markdownRemark":{"html":"<p>I used to work a lot in Photoshop, and in later years, I taught myself Sketch. I did not used it heavily, but I was comfortable enough to get what I need done done. Now it has been some time since I used it, at least 2 years. Now that I am working on my own, I am having to revisit skills I long last used while working in a team. It is interesting, how the focus shifts quickly when your priorities and tasks change. Over the past few years, I have increasingly focused on development. I was involved in UX and design, but mostly with representing it in code, checking it matched the designs and with improving user experience and user flows where possible. I was not practicing the physical act of designing from scratch. Additionally, working with corporate identity means you are mostly putting together and re-arranging already-designed elements. It's a little more like Lego or Ikea. You have pre-fabricated blocks that you need to represent and put together according to existing rules. Creating new designs from scratch is something I have not done in a long time. </p>\n<p>Granted, designing for mobile means you need to take into account design practice as well as the Human Interface Guidelines, so you are not completely without guidance, but the act of creating from scratch is certainly more challenging. </p>\n<p>I am however, incredibly excited about it! Sketch is a great piece of software and I am looking forward to digging into both design and the software around it again. Admittedly, this will be a process. It is easy to think that you can just pick up where you left off years ago, but trade-offs are real. Spending years focusing on one set of skills, while not practicing or performing another means that you need to rewind, adopt a beginner's mind and approach the topic as if you are a novice to it. In many ways, you are, despite prior experience. Technology, software and the general practice and application of skills changes and evolves rapidly while you are doing other things! </p>\n<p>So, coincidentally, on the occassion of my 100th 'Today I Learned' post, I looked forward to (re)learning new things and digging into design with fresh eyes and a fresh mind! Hopefully, improving on the old things too! </p>","frontmatter":{"title":"Revisiting Design."}}},"pageContext":{"slug":"/til0100/"}}