{"data":{"markdownRemark":{"html":"<p><em>Note: This post is a transplant. First published on 2017/10/02. It was written by myself on another site and has been moved.</em></p>\n<p>Frederic Filoux's threw in his few cents on the \"what Apple should spend its cash hoard on\" topic with his latest blog post titled \"<a href=\"https://mondaynote.com/why-apple-should-buy-sony-22a9d576c1d9\">Why Apple Should Buy Sony</a>\". Speculating on what Apple will or will not do is certainly fun and going through the thought exercise of building the cases for and against such a hypothetical deal can be educational in building up and framing an understanding of why a company might do something. But therein lies the rub, Frederic's post only raises the \"pros\" and and spends very little time on the what would be the \"cons\". Considering that Apple is famous for saying \"No\", this is a big gap in an otherwise interesting argument for the buying of Sony. So let me present my view on the \"cons\":</p>\n<h3>#1 Acquisition Size</h3>\n<p>At the beginning of the post, Frederic notes that Apple's current cash hoard is at $262 billion. At the end of the article, he lists Sony's market cap as being at $47 billion (just over 20% of the value of the cash hoard). Now, while one cannot say that because Apple has to-date, not made such large acquisitions that it will not do so in the future. It is certainly worth considering what Apple would be looking to gain from spending upwards of $40 billion more than their largest acquisition to date which was a mere $3 billion for Beats.</p>\n<h3>#2 Camera Sensors</h3>\n<p>The primary thrust of the article's argument is that Apple is reliant on Sony for a critical component in the iPhone, namely the image sensor and that it competes with other manufacturers to secure the production of these components from said suppliers. This makes sense, as securing the supply chain to feed the immense demand for components is critical to creating and supplying iPhones the world over. Added to that, Apple has famously driven relentlessly towards \"owning\" the critical components to their business. Considering the camera is one of the most important pieces of the iPhone and that the photos people take with them are priceless, it certainly makes sense Apple would want to secure this production. The thing to remember here is that generally, Apple does not buy the suppliers. Apple buys and secures the capacity or production from the supplier. What is more likely to happen is that, similar to the A-Series of chips, Apple will design the sensors and then purchase the production from said suppliers. Apple's ever increasing lead in chip prowess is not due to the production of the chips, but due to the design, integration and optimisation specific to Apple's needs coupled with the large scale production that brings about the competitive advantage. From that perspective, camera sensors are no doubt important, but colour me skeptical when it comes to Apple buying the cow when it is happy to pay for the milk. Remember also that Apple is a such a large customer, it is highly likely Apple is also the best customer. It is unlikely that even Samsung could compete with Apple's buying power in this regard.</p>\n<h3>#3 Culture</h3>\n<p>Purchasing a company as large as Sony with as long a history comes with the enormous challenge of integrating two cultures that are likely to be very different with years of ingrained behaviour. Not to mention the location of the companies and the staff. Apple is primarily located in California, with small branches in other areas and countries. Sony is headquartered in Japan with locations the world-over. Looking at Apple's list of acquisitions over time, it is clear that Apple prefers to integrate smaller, growing companies into the fold. Mashing two very large companies together is an entirely different proposition. Not to colour Apple with the same brush, but two relatively similar acquisitions in recent history by big American technology companies did not prove very fruitful in the hardware department, namely Google and Motorola as well as Microsoft and Nokia. Apple and Sony sounds like it would fall into that camp.</p>\n<h3>#4 Playstation</h3>\n<p>Fredric lists the Playstation with $20 billion in sales as a reason for purchase. While $20 billion is by no means something to sniff at, look at what Apple would need to pay, acquire and integrate to even access that value. First of all, the Playstation is a gaming console. While iOS is a gaming behemoth, Apple has traditionally not shown much interest in venturing into the hardcore gaming market. With the release of the latest Apple TV, this notion has only been reinforced with little to no change to either the remote or even a hint at first party gaming accessories or controllers. Gaming on the Apple TV, as it is, leaves something to be desired for gamers. However, it would not be a stretch for Apple to release an Apple TV product that took \"casual\" gaming more seriously and released a game controller. Game developers would likely jump at the opportunity should it arise and I doubt that Apple believes the gaming market is unachievable should it set its mind to entering it.</p>\n<p>Further to that, I highly doubt Apple thinks it would need Sony's VR goggles and TV sets. Apple would much prefer to create their own hardware should they choose to do so, and chances are fair that such a product would be an improvement over what Sony has to offer.</p>\n<h3>#5 Films and Music</h3>\n<p>The dark horse here is Sony Pictures Entertainment and Sony Music. Apple is serious about music and has signalled clear intentions in the original video content arena. Owning these entities would certainly give Apple a large sword to yield. As Fredric notes, SPE is one of the Hollywood Big Six and Sony Music holds around 20% of the music sales industry. Yet again the question arises \"What do they gain by doing so?\". The music and film industries are already suspicious of Apple's movements here. Purchasing one of the major studios could possibly endanger existing or future content deals Apple has with the other large houses and could send the other houses running into the arms of a competitor. Remember that the labels hold a lot of the power in the music streaming business and while it would be great for Apple to have \"exclusive\" content, it goes against the desire of the artists and content that would arise. Artists want their work to be consumed by the largest number of people possible - yes Apple Music is on Android, but containing Sony content to be exclusively on the Apple ecosystem is likely to engender as much unhappiness as it is business. Besides, for that amount of money, if Apple wanted to go all in on video content like that, why wouldn't they buy Netflix or Spotify? Failing that, why not just buy Sony Pictures Entertainment and Sony Music outright without the rest of Sony?</p>\n<p>In the end, I am sure the totality of Sony's business may signal possible gains for Apple, but it is the cost of those gains that one needs to consider. To my ears, such an acquisition does not align with what i know about Apple. Purchasing a huge company and trying to force integration in areas of competency that are already within Apple's wheelhouse seems like a horribly expensive exercise and likely to deliver far less value in the long run.</p>\n<p>If we were to distill the argument, my retort would be:</p>\n<ul>\n<li>Securing camera sensors - Apple designs its own sensors and purchases the production capacity as they do with other components.</li>\n<li>Hardware - Apple can create the necessary hardware and software necessary to build VR/AR goggle TV sets and better gaming hardware.</li>\n<li>Culture - Apple is likely not looking to merge such a large company into itself.</li>\n<li>Music - Apple already has a music platform and is iterating on it slowly but surely.</li>\n<li>Film - Apple is investing and slowly developing in the area.</li>\n</ul>","frontmatter":{"title":"Why Apple Should Not Buy Sony."}}},"pageContext":{"slug":"/post013/"}}