{"data":{"markdownRemark":{"html":"<p>Yesterday I read about the <a href=\"https://ewn.co.za/2019/05/13/ct-surfing-community-shaken-to-its-core-after-member-murdered\">horrific murder</a> of a surfer near Kommetjie in the Western Cape. I am deeply saddened and disturbed by this crime. My thoughts go out to the family and friends of this man. I hope too, that justice will be done. </p>\n<p>Having very recently spent a month in Cape Town learning to surf, this story cuts close to home. Especially since I have been travelling solo. For the most part, it has been me, in the car going around and doing things on my own. Travelling on your own raises unique perspectives on situation you often would not think twice on when in a group. Especially when you are going to do something out in nature. Through the course of my trip I was struck, not only by how incredibly beautiful the Western Cape is, but also by the sheer amount of activities you have available to enjoy. With one, very dark and ominous negative. Crime. </p>\n<p>During my stay there, when discussing hiking with no less than 3 different people, the dangers of hiking, especially alone, came up. As the story linked above attests, these dangers extend to surfing, as well as cycling and any outdoor activity. It saddens me deeply, that in a place as beautiful and diverse as Cape Town and by extension the Western Cape (and the rest of South Africa in general) that the primary question when considering what outdoor activity to do is not: </p>\n<p>Do I want to do this? </p>\n<p>But rather: </p>\n<p>Am I willing to risk my life doing this? </p>\n<p>This might sound overblown, and true, out of the hundreds if not thousands of surfers in the Western Cape, 99.99% will not end up burnt to death in the boot of a car. But, there are plenty of other stories to go around of muggings, robbings, and various forms of attack that have built up a large enough body of evidence that doing something you love, in the place that you live, could get you into trouble. Especially if you are doing it on your own. </p>\n<p>On Saturday, I hiked the wonderful Cape St Blaize Trail from Mossel Bay to Dana Bay. The trail is about 13.5km long and runs throughout its length along the coastal cliffs. I did the hike solo, there and back. It was an incredible walk, the views are spectacular and the walking is not that challenging. I was even fortunate enough to see some dolphins! </p>\n<p>The challenge for me, was not with hike itself, it was with the looming sceptre of crime. Prior to doing the hike, my decision on whether to do it or not was not based on whether I actually wanted to hike it, or whether I was physically capable, but whether I wanted to risk walking along an <em>exposed</em> section of coastline on my own? </p>\n<p>Ultimately, I decided to trust that I would be able to walk for 27km on my own, unhindered and unencumbered by violence. Thankfully, I was rewarded for my trust and had an amazing day, hiking a beautiful trail. However, the experience was to some overhung by the potential prospect of violence. And I think, this is the thing that is so insidious about living in a place where one very regularly comes across news and stories of such terrible criminal acts. While many of us will hopefully never experience such atrocities firsthand, they infiltrate your thought process and build fear.</p>\n<p>One need only look at the success of horror films to know that fear, whether real or imagined has power, and in South Africa fear has great power. </p>","frontmatter":{"title":"Crime."}}},"pageContext":{"slug":"/post056/"}}