{"data":{"markdownRemark":{"html":"<p>Something a little different for today. For the past year or so, I have been wakeskating more or less regularly (excluding winter). While I did not keep any records of my riding before March 2019, I started wakeskating somewhere around December 2018 again. </p>\n<p>By December 2018, It had been several years since I had been to the cablepark. Looking back, I have had 2x prior phases where I rode at least somewhat regularly for a few months or so at a time. Back in 2011, when I first learned to ride, I went through a phase where I wakeboarded a bit. I can't recall exact dates, but I rode for a few months, once or twice a week in the summer that year. Unfortunately, as winter came around, I got busy with other things and the habit fell away. </p>\n<p>A year or two later, roundabout summer 2013/14, I went through another phase - this time I started wakeskating. If you are not aware, wakeboarding is more or less similar to snowboarding - you are riding a board on the water, but your feet are strapped into bindings onto the board. Wakeskating is basically a board, without bindings - more akin to a skateboard on the water. During this time, I probably rode once or twice a week for a few months that summer. Sadly, as winter came around, the habit fell away as I focused on other things. During that time, I had other priorities that took up my free time. Several months later however, I had a very brief moment when I started riding again, but took a bad fall where I seriously injured my ribs. That effectively ended my riding... until December 2018.</p>\n<p>At that stage it had been more or less 3-4 years since I had last stepped on a board. As I was rediscovering the fun of riding and the excitement of progression, through early 2019 I was not riding that much. Maybe once or twice every week or two. Then in March 2019 things changed. </p>\n<p>In March, I started going several times a week as my love for riding was rekindled and I started connecting with progression again. I rode alot before going on my trip in early April. While I was not keeping accurate notes, I calculated that I rode 20x separate sessions, totalling more or less 44 hours of riding time on the water in March. On my trip, I rode twice down in Cape Town at the Blue Rock cable park. I was not able to ride again until early October 2019 - both due to my travels as well as a strain in my back that kept me from doing much physical activity at all. </p>\n<p>As my visits to the physio-therapist drew to a close and I felt ready to start exercising again, I started riding again in October 2019. Since then I have been keeping records of my riding. I bought a membership to the cablepark and wanted to keep a track of my riding for financial purposes. As it turned out, it helped me keep a riding diary of sorts. Essentially I would record the date and the number of hours I rode according to what the \"regular\" price of the session would have been had I not been a member. Primarily I did this to keep track of what the membership was saving me. What I found though, was that as I was doing this, I also started to write a brief note or two about how the session went. This has become a habit. </p>\n<p>Now that I have been riding on an almost daily basis since October 2019, I took this morning to transfer my notes to a Google Sheet so I no longer need to calculate totals myself. This gave me time to reflect on my first back-to-back seasons of riding. </p>\n<p>Since March 2019, the following are the big picture stats: </p>\n<h4>March/April 2019</h4>\n<ul>\n<li>In March I rode for 20x sessions, totalling about 44 hours all at Stoke City Wakepark. </li>\n<li>In April I rode only 2x sessions, both at Blue Rock Wakepark in Cape Town.</li>\n<li>In October, before getting my membership, I rode 12x sessions totalling 22 hours. </li>\n<li>Since getting my membership in November, through the end of 2019 I rode x35 sessions to a total of 76 riding hours. </li>\n<li>Since the start of 2020, I have ridden 7x sessions for a total of 17 hours riding so far</li>\n<li>All up, since I started keeping records, I have ridden 71x sessions for a total of, more or less, 150 hours or riding time! </li>\n</ul>\n<p>Funnily enough, in the end, that really is only about 4 months of solid riding. The rest of the time I was travelling or the park was closed. </p>\n<h4>Lessons Learned</h4>\n<p>So what have I learned through this process? </p>\n<h3>1. Progression</h3>\n<p>I have progressed more in my riding in the past 3 months than I ever have. I attribute this to a combination of consistency as well as priority. You need to prioritise riding (or any hobby or sport) if you are looking to progress. Additionally, that time on the water, even on days you are not riding well, you are learning, your body and mind are adapting in small ways. Even when you are falling, your body and mind are getting accustomed to making movements, to adjusting. To my mind, so much of sport is building muscle memory, which builds instinct, which over times\n, helps attune you to the small adjustments and movements that eventually mean the difference between falling or landing your trick.</p>\n<ol start=\"2\">\n<li>\n<h4>Financial Commitment</h4>\n</li>\n</ol>\n<p>Making a financial commitment such as a membership (and I don't include \"buying kit or equipment\" as a financial commitment) and tracking it. This helps keep you acountable in the true sense of the word. In the past, if I did not feel like riding, I would not go and ride - now that I am financially committed, the choice is made. I might as well go anyway because, basically, it's return on investment if nothing else. Don't get me wrong, I love riding! It does not take much to get me to go. The thing is, when you are riding a lot, some days, you just don't feel like you have the energy after a hard week of riding. The thing is, now, I might as well go anyway just to take a few laps because I have already paid for it! </p>\n<p>Another thing to note is the weather - these days, unless it is raining, I go. Almost 90% of the time, if you think the weather won't let you ride - it probably will - so go anyway!</p>\n<ol start=\"3\">\n<li>\n<h4>Failure, Experimentation and Expanding Your Comfort Zone</h4>\n</li>\n</ol>\n<p>I have written about the impact watching the movie \"Free Solo\" had on me before. Particularly, there is a quote where free climber Alex Honnold says that he is always working on expanding his comfort zone. That really stuck with me, and in all honesty - this is where having the membership comes into play. </p>\n<p>When I am paying hour to hour for riding, my goal, without realising it, was to have a good session. Duh! Not so fast! </p>\n<p>The thing is, what this <em>really</em> meant, at least for me, was a session where I \"land tricks\". At least on a subconscious level, you are looking at the session from a perspective of \"scarcity\" and you are jealous for riding time. If you fall on the cable, that means swimming and then walking back to the dock. Depending on how busy it is, this might mean that you lose a lot of riding time to swimming/walking/waiting on the dock if you are falling a lot while trying something new. </p>\n<p>Additionally, swimming back, especially if it is from towers 2-4 takes a lot of energy, which you think you would rather spend riding. Without realising it, this has the overall effect of making your riding far more conservative and less experimental than it should be in order to truly unlock progression. </p>\n<p>With a membership, while the basic mechanics of the session are the same, I have changed my outlook on riding: </p>\n<ol>\n<li>\n<p>If I am not falling, I am not learning. Falling is an indicator of experimentation and progression. If you are not falling, your are not progressing. Not to say I aim to fall, I do my best to land everything I do. The difference is, I have already accepted that I will fall, likely many times, and to my mind now, even this is progress when learning a new trick.  </p>\n</li>\n<li>\n<p>Falling is no longer a time sink, because, on membership, I have effectively as much time as I want. While the clock is still ticking - it does not signify the end of the game, only a break and then I can come back tomorrow. Essentially, the falls are not costing me time or money since all the money is paid and the time is up to me. </p>\n</li>\n</ol>\n<p>Essentially, I now see progression as: \"I am going to fall, maybe a lot, but let's just see how it feels. Maybe it works, maybe it doesn't. Either way, each attempt is at worst a nudge in the right direction and at best you realise you can actually stick it!\"</p>\n<p>As a result, I might try something a few times on a day and I am nowhere near it. Or, sometimes it feels close - like this is something I could pull off. In that case, it lights me up and suddenly something new is possible. In the former case, where it is not even close, it does not matter. I just think: \"Cool, that sucked! At least I tried and honestly, this is probably the worst it will be! It will only get better from here. Let's see how it feels tomorrow!\"</p>\n<ol start=\"3\">\n<li>Falling is not failure. At the cable, you might get beginners getting demotivated falling all the time. It can be frustrating when you see all these people around you riding and doing things that they make look so easy yet you are falling. Try to remember this: those people riding around have fallen far more than you before getting there! Also, they all probably fall more everyday than you have! It's a rite of passage, not failure - just keep at it! Some people \"click\" quickly, others take longer, but eventually, you will learn and it will be worth it!</li>\n</ol>\n<h3>Takeaways</h3>\n<p>In the end, whatever it is that you do, or want to do, prioritisation and consistency are key. It is better to go than not to. It is better to experiment and try something new, than not to. If it is something you enjoy, commit to it somehow, financially, or enter an event, or get a friend to do it with you. Whichever it is, create a mechanism by which, when you don't feel like it - you will go anyway! And, while it might seem nerdy, keep track of what you are doing! It is so easy to skip it for a few days, which turn into a few weeks, which can lead to months or even years away - this is harder to do when you have commitments and when you have a record, telling you that you have not been in X time. </p>\n<p>Also, people often say just have fun with it - but most of the time - things worth doing are not that \"fun\" to begin with! When I first went snowboarding, I effectively rolled down the hill. It was not fun in the typical sense. It was fun in a \"this is ridiculous\" type of way no doubt - but it takes a certain type of person to enjoy that. Many people actively avoid it! </p>\n<p>When riding cable, most people spend their first day, falling at the dock, falling at each corner, falling, falling, falling. Water up your nose, in your face, in your ears. It is not the most pleasant experience hurling face first into the water at high speed. All the more so because everyone there, on the dock or at the tables can you see you! But stick with it - the payoff is so much more fun!</p>\n<p>I am reminded of surfing too. When you see surfers, it is hard not to marvel at how much fun it looks! Yet the older you get, the more unpleasant it is to learn - it is tiring, frustrating, you have water coming in and going out of every area and it is so much harder than you ever thought. Worse, it is far scarier, even downright terrifying! The waves are bigger and faster than you realised! You get dunked under water, you get held down, you get stuck trying to paddle out only to realise you are going backwards! </p>\n<p>The thing is, the fun comes later! You first need to pay your dues, you look like you have no idea what you are doing because you literally don't and you feel like a fool - but it will pass - stick with it. What you are experiencing is the only road to the party. Keep falling, keep paddling, keep swimming, keep trying and those moments will come - when it is all worth it and something clicks you into another gear! </p>","frontmatter":{"title":"Wakeskating."}}},"pageContext":{"slug":"/til0148/"}}