{"data":{"markdownRemark":{"html":"<p>Being a lifelong learner can take many forms. Learning new things might take shape in your personal life through reading up on interests and curiosities, it could manifest in developing new hobbies or revisiting old ones. For me, it learning appears in attempting to fill \"gaps\" in the things that I do. For example, having worked in web development over the past decade, one tends to go through phases where you dive in on particular topics, for me, at the start, it was learning to code HTML and buill CSS-based layouts. Then it was figuring out how to work with Joomla themes, then WordPress. From there it became about adding interaction with jQuery. Along with the mobile revolution responsive design became important and being able to make your site look good on a myriad of devices. Bootstrap and AngularJs emerged and soon that was where I was spending my time. To date, I had always been a front-end guy. I was able to build front-ends. Beyond that, I was to some extent, a \"site builder\" with content managements systems, and was able to customise PHP code in order to augment functionality, but I was never truly full-stack until I started learning Node.js towards the end of 2017. </p>\n<p>Having worked extensively with APIs and AngularJs, I would say that by that stage of my career, I was very much working as the \"backend of the frontend\". JavaScript and not CSS was my primary focus. Being responsible for a multi-market SPA (Single Page Application) meant that deployments, SSL certificates, build pipelines and performance monitoring became points of responsibility for me beyond just \"how it looked\". Data, the time it took to get to the screen and how it was managed became central pillars for my work and the reality was that the front-end could no longer provide the answers. Node.js opened the door and through it I found an entire new world which I had to come to grips with. In many ways, it was similar to how I first discovered CSS or AngularJs. It looked familiar, but at the same time I did not know it. As a result I dug in. Slowly but surely it became more natural, it felt like my wheelhouse was expanding, but in some respects I still did not feel like a \"real\" backend of full-stack developer. </p>\n<p>Taking on the Full-Stack Web Developer Nanodegree on Udacity is the new leg of my ongoing journey. For me, this course represent several new things: A new language (Python), a new database (PostgreSQL) and the entirely new environment that surrounds those two. In many ways, I am continuing on the same journey, but it is also a new journey. I am once again a beginner. Wish me luck!</p>","frontmatter":{"title":"Beginning Again."}}},"pageContext":{"slug":"/post061/"}}