{"data":{"markdownRemark":{"html":"<p>Thinking about the past Apple Services Event, I think it was a miss. </p>\n<h3>Apple News+.</h3>\n<p>Apple News + seems okay-ish. I don't see how having publications release .pdf format news in 2019 is worth paying for. Sure, they will all, eventually, migrate to the Apple News Format, but still. If they are not migrated now, why even provide it? </p>\n<p>Yes, there is a bundle that is worth it, but the reality is that the true, cornerstone publications are unlikely to be fully invested. As such, it remains to be seen whether this is compelling. It seems like Newsstand re-hashed, but without much though as to why Newsstand did not succeed. Apple News is not even available in South Africa, so personally, it's a miss. </p>\n<h3>Apple Arcade.</h3>\n<p>This looks interesting! Exclusive iOS content, mobile focused, I think there <em>might</em> be something here. Whether it is worth it for developers, I am not sure. The App Store dynamics are already not particularly friendly to indepenent developers that do not breakout with huge hits, but the App Store and consumers <em>love</em> games. For consumers and for Apple this looks pretty compelling for mobile and casual gamers. </p>\n<p>Still, when do we see an Apple TV game controller? </p>\n<p>On any level, Apple Arcade is much better sounding name than Google Stadia!?</p>\n<h3>Apple Card.</h3>\n<p>Credit cards, Goldman-Sachs, personally, I have little interest in this. Kudos to Apple for the no numbers on the card thing, I think this is the type of thinking that Apple is often able to bring to older industries. Just because the numbers have always been there, does not mean they necessarily should. Making credit cards safer is laudable. Credit card fraud is a big problem in South Africa, so I appreciate the moves Apple are making in general in this area. The thing is, I have never used Apple Pay, I doubt it is even available anywhere in this country. </p>\n<h3>Apple TV+.</h3>\n<p>Channels are a great idea! As I understand it, Amazon Prime Video already does this quite successfully. The skinny bundle is attractive, and again, regional differences matter a lot here. Will, we, here in South Africa, or other similar, smaller countries get access to channels like HBO? </p>\n<p>I hope so. But we will see. As I understand it, HBO shows are mostly locked-up to local providers DsTV and Showmax. </p>\n<h3>Apple's Video Subscription Service.</h3>\n<p>This, really, was a huge disappointment. A line of stars, with very little to show for it. What will it cost? What is going to be on it? We don't know yet. Some shows from A-listers is about all we know. To my mind, the inital thought was that the entire goal of this event, was to reveal THIS service. But, all it was, was a \"wait and see\" type of thing. </p>\n<p>Overall, it really felt under-cooked. Apple News+, at present, seems average. It looks great, and the formatting and delivery looks good, but is it compelling enough for $9.99 in a sea of competing subscription news services? </p>\n<p>I get it, video production, especially, high quality production takes an enormous amount of time and effort to produce, but, when one considers, how Netflix tends to do this, this approach seems so outdated. Netflix pretty much just releases a show when it is ready. There is a teaser, and then shortly thereafter, the release, everywhere, worldwide. Instant. What Apple did was parade a bunch of stars, talking about things that likely are not even finished yet. We all know, the service is coming. </p>\n<p>Wake me up when it is actually available for a price. </p>\n<h3>Parting Thoughts.</h3>\n<p>This event feels like Apple out of its comfort zone in the most awkward way. When the Apple Watch launched, Apple was trying to schmooze with high fashion and over time, has settled back to a fitness/health oriented device which has lead to more success for the Watch. Here, we have Apple trying to hobnob with celebrities and A-listers in a very awkward manner. They will settle into a more, natural stance over time, and I am sure these services will evolve and solidify into more compelling versions of themselves, but this event, was more miss than hit. </p>","frontmatter":{"title":"The Apple Services Event."}}},"pageContext":{"slug":"/post029/"}}